[
  {
    "title": "Microsoft Defender mistakenly flags SQL Server as end-of-life",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-defender-mistakenly-flags-sql-server-as-end-of-life/",
    "date": "2025-10-09T18:09:26.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft is working to resolve a known issue that causes its Defender for Endpoint enterprise endpoint security platform to incorrectly tag SQL Server software as end-of-life. [...]..."
  },
  {
    "title": "From HealthKick to GOVERSHELL: The Evolution of UTA0388's Espionage Malware",
    "link": "https://thehackernews.com/2025/10/from-healthkick-to-govershell-evolution.html",
    "date": "2025-10-09T17:19:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-aligned threat actor codenamed UTA0388 has been attributed to a series of spear-phishing campaigns targeting North America, Asia, and Europe that are designed to deliver a Go-based implant kno..."
  },
  {
    "title": "RondoDox botnet targets 56 n-day flaws in worldwide attacks",
    "link": "https://www.bleepingcomputer.com/news/security/rondodox-botnet-targets-56-n-day-flaws-in-worldwide-attacks/",
    "date": "2025-10-09T17:17:28.000Z",
    "source": "Bleeping Computer",
    "summary": "A new large-scale botnet called RondoDox is targeting 56 vulnerabilities in more than 30 distinct devices, including flaws first disclosed during Pwn2Own hacking competitions. [...]..."
  },
  {
    "title": "Fastly CISO: Using Major Incidents as Career Catalysts",
    "link": "https://www.darkreading.com/cybersecurity-operations/fastly-ciso-major-incidents-career-catalysts",
    "date": "2025-10-09T15:33:49.000Z",
    "source": "Dark Reading",
    "summary": "Marshall Erwin shares how crisis leadership shaped his path from CIA analyst to the US Congress to protecting global Web traffic at Fastly...."
  },
  {
    "title": "New ClayRat Spyware Targets Android Users via Fake WhatsApp and TikTok Apps",
    "link": "https://thehackernews.com/2025/10/new-clayrat-spyware-targets-android.html",
    "date": "2025-10-09T15:30:00.000Z",
    "source": "The Hacker News",
    "summary": "A rapidly evolving Android spyware campaign called ClayRat has targeted users in Russia using a mix of Telegram channels and lookalike phishing websites by impersonating popular apps like WhatsApp, Go..."
  },
  {
    "title": "Microsoft: Windows Backup now available for enterprise users",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-backup-now-available-for-enterprise-users/",
    "date": "2025-10-09T14:56:57.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced this week the general availability of Windows Backup for Organizations, a new enterprise-grade backup tool that helps simplify backups and makes the transition to Windows 11 easier..."
  },
  {
    "title": "SonicWall: Firewall configs stolen for all cloud backup customers",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-firewall-configs-stolen-for-all-cloud-backup-customers/",
    "date": "2025-10-09T14:13:04.000Z",
    "source": "Bleeping Computer",
    "summary": "SonicWall has confirmed that all customers that used the company's cloud backup service are affected by the security breach last month. [...]..."
  },
  {
    "title": "From infostealer to full RAT: dissecting the PureRAT attack chain",
    "link": "https://www.bleepingcomputer.com/news/security/from-infostealer-to-full-rat-dissecting-the-purerat-attack-chain/",
    "date": "2025-10-09T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Researchers map a campaign that escalated from a Python infostealer to a full PureRAT backdoor — loaders, evasions, and TLS-pinned C2. Join Huntress Labs' Tradecraft Tuesday for deep technical walkthr..."
  },
  {
    "title": "Take Note: Cyber-Risks With AI Notetakers",
    "link": "https://www.darkreading.com/cyber-risk/take-note-cyber-risks-with-ai-notetakers",
    "date": "2025-10-09T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Transcription applications are joining your online meetings. Here's how to create policies for ensuring compliance and security of your information...."
  },
  {
    "title": "Hackers Access SonicWall Cloud Firewall Backups, Spark Urgent Security Checks",
    "link": "https://thehackernews.com/2025/10/hackers-access-sonicwall-cloud-firewall.html",
    "date": "2025-10-09T13:48:00.000Z",
    "source": "The Hacker News",
    "summary": "SonicWall on Wednesday disclosed that an unauthorized party accessed firewall configuration backup files for all customers who have used the cloud backup service.\n\"The files contain encrypted credenti..."
  },
  {
    "title": "Azure outage blocks access to Microsoft 365 services, admin portals",
    "link": "https://www.bleepingcomputer.com/news/microsoft/azure-outage-blocks-access-to-microsoft-365-services-admin-portals/",
    "date": "2025-10-09T12:38:27.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is working to resolve an outage affecting its Azure Front Door content delivery network (CDN), which is preventing customers from accessing some Microsoft 365 services. [...]..."
  },
  {
    "title": "ThreatsDay Bulletin: MS Teams Hack, MFA Hijacking, $2B Crypto Heist, Apple Siri Probe & More",
    "link": "https://thehackernews.com/2025/10/threatsday-bulletin-ms-teams-hack-mfa.html",
    "date": "2025-10-09T12:16:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyber threats are evolving faster than ever. Attackers now combine social engineering, AI-driven manipulation, and cloud exploitation to breach targets once considered secure. From communication platf..."
  },
  {
    "title": "SaaS Breaches Start with Tokens - What Security Teams Must Watch",
    "link": "https://thehackernews.com/2025/10/saas-breaches-start-with-tokens-what.html",
    "date": "2025-10-09T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Token theft is a leading cause of SaaS breaches. Discover why OAuth and API tokens are often overlooked and how security teams can strengthen token hygiene to prevent attacks.\nMost companies in 2025 r..."
  },
  {
    "title": "Hacktivists target critical infrastructure, hit decoy plant",
    "link": "https://www.bleepingcomputer.com/news/security/hacktivists-target-critical-infrastructure-hit-decoy-plant/",
    "date": "2025-10-09T11:13:49.000Z",
    "source": "Bleeping Computer",
    "summary": "A pro-Russian hacktivist group called TwoNet pivoted in less than a year from launching distributed denial-of-service (DDoS) attacks to targeting critical infrastructure. [...]..."
  },
  {
    "title": "Chaos Ransomware Upgrades With Aggressive New C++ Variant",
    "link": "https://www.darkreading.com/threat-intelligence/chaos-ransomware-upgrades-aggressive-new-variant",
    "date": "2025-10-09T09:44:12.000Z",
    "source": "Dark Reading",
    "summary": "New encryption, wiper, and cryptocurrency-stealing capabilities make the evolving ransomware-as-a-service operation more dangerous than ever...."
  },
  {
    "title": "From Phishing to Malware: AI Becomes Russia's New Cyber Weapon in War on Ukraine",
    "link": "https://thehackernews.com/2025/10/from-phishing-to-malware-ai-becomes.html",
    "date": "2025-10-09T09:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Russian hackers' adoption of artificial intelligence (AI) in cyber attacks against Ukraine has reached a new level in the first half of 2025 (H1 2025), the country's State Service for Special Communic..."
  },
  {
    "title": "Critical Exploit Lets Hackers Bypass Authentication in WordPress Service Finder Theme",
    "link": "https://thehackernews.com/2025/10/critical-exploit-lets-hackers-bypass.html",
    "date": "2025-10-09T06:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors are actively exploiting a critical security flaw impacting the Service Finder WordPress theme that makes it possible to gain unauthorized access to any account, including administrators,..."
  },
  {
    "title": "Hackers claim Discord breach exposed data of 5.5 million users",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-claim-discord-breach-exposed-data-of-55-million-users/",
    "date": "2025-10-09T00:22:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Discord says they will not be negotiating with threat actors who claim to have stolen the data of 5.5 million unique users from the company's Zendesk support system instance, including government IDs ..."
  },
  {
    "title": "Vampire Bot Malware Sinks Fangs Into Job Hunters",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/vampire-bot-malware-job-hunters",
    "date": "2025-10-08T21:02:42.000Z",
    "source": "Dark Reading",
    "summary": "The campaign is the latest by BatShadow, one of a growing number of cybercrime groups operating out of Vietnam...."
  },
  {
    "title": "Red Hat Hackers Team Up With Scattered Lapsus$ Hunters",
    "link": "https://www.darkreading.com/threat-intelligence/red-hat-hackers-team-up-scattered-lapsus-hunters",
    "date": "2025-10-08T20:40:36.000Z",
    "source": "Dark Reading",
    "summary": "Crimson Collective, which recently breached the GitLab instance of Red Hat Consulting, has teamed up with the notorious cybercriminal collective...."
  },
  {
    "title": "LockBit, Qilin &amp; DragonForce Join Forces in Ransomware 'Cartel'",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/extortion-gangs-join-forces-ransomware-cartel",
    "date": "2025-10-08T19:56:33.000Z",
    "source": "Dark Reading",
    "summary": "The three extortion gangs also invited other e-crime attackers to join their collaboration to share attack information and resources, in the wake of LockBit 5.0 being released...."
  },
  {
    "title": "New FileFix attack uses cache smuggling to evade security software",
    "link": "https://www.bleepingcomputer.com/news/security/new-filefix-attack-uses-cache-smuggling-to-evade-security-software/",
    "date": "2025-10-08T19:49:47.000Z",
    "source": "Bleeping Computer",
    "summary": "A new variant of the FileFix social engineering attack uses cache smuggling to secretly download a malicious ZIP archive onto a victim's system and bypassing security software. [...]..."
  },
  {
    "title": "Qilin ransomware claims Asahi brewery attack, leaks data",
    "link": "https://www.bleepingcomputer.com/news/security/qilin-ransomware-claims-asahi-brewery-attack-leaks-data/",
    "date": "2025-10-08T18:42:22.000Z",
    "source": "Bleeping Computer",
    "summary": "The Qilin ransomware group has claimed responsibility for the attack at Japanese beer maker Asahi, adding the company to its extortion page on the dark web yesterday. [...]..."
  },
  {
    "title": "Microsoft 365 outage blocks access to Teams, Exchange Online",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-outage-blocks-access-to-teams-exchange-online/",
    "date": "2025-10-08T18:35:01.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft is working to resolve an ongoing outage preventing users from accessing Microsoft 365 services, including Microsoft Teams, Exchange Online, and the admin center. [...]..."
  },
  {
    "title": "Microsoft enables Exchange Online auto-archiving by default",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-enables-exchange-online-auto-archiving-by-default-to-fight-overflowing-mailboxes/",
    "date": "2025-10-08T17:49:59.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is enabling threshold-based auto-archiving by default in Exchange Online to prevent email flow issues caused by mailboxes filling up faster than expected. [...]..."
  },
  {
    "title": "Crimson Collective hackers target AWS cloud instances for data theft",
    "link": "https://www.bleepingcomputer.com/news/security/crimson-collective-hackers-target-aws-cloud-instances-for-data-theft/",
    "date": "2025-10-08T17:33:38.000Z",
    "source": "Bleeping Computer",
    "summary": "The 'Crimson Collective' threat group has been targeting AWS (Amazon Web Services) cloud environments for the past weeks, to steal data and extort companies. [...]..."
  },
  {
    "title": "Framelink Figma MCP Server Opens Orgs to Agentic AI Compromise",
    "link": "https://www.darkreading.com/vulnerabilities-threats/figma-mcp-server-agentic-ai-compromise",
    "date": "2025-10-08T17:14:02.000Z",
    "source": "Dark Reading",
    "summary": "Patch now: A bug (CVE-2025-53967) in a third-party option for connecting Figma to agentic AI can lead to remote code execution (RCE)...."
  },
  {
    "title": "Hackers Exploit WordPress Sites to Power Next-Gen ClickFix Phishing Attacks",
    "link": "https://thehackernews.com/2025/10/hackers-exploit-wordpress-themes-to.html",
    "date": "2025-10-08T16:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a nefarious campaign targeting WordPress sites to make malicious JavaScript injections that are designed to redirect users to sketchy sites.\n\"Site vi..."
  },
  {
    "title": "China-Nexus Actors Weaponize 'Nezha' Open Source Tool",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/china-nexus-actors-nezha-open-source-tool",
    "date": "2025-10-08T14:02:28.000Z",
    "source": "Dark Reading",
    "summary": "A threat actor is putting a spin on classic remote monitoring and management (RMM) attacks, using a Chinese open source tool instead...."
  },
  {
    "title": "Chinese Hackers Weaponize Open-Source Nezha Tool in New Attack Wave",
    "link": "https://thehackernews.com/2025/10/chinese-hackers-weaponize-open-source.html",
    "date": "2025-10-08T13:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with suspected ties to China have turned a legitimate open-source monitoring tool called Nezha into an attack weapon, using it to deliver a known malware called Gh0st RAT to targets.\nThe..."
  }
]