[
  {
    "title": "Notepad++ update feature hijacked by Chinese state hackers for months",
    "link": "https://www.bleepingcomputer.com/news/security/notepad-plus-plus-update-feature-hijacked-by-chinese-state-hackers-for-months/",
    "date": "2026-02-02T14:53:52.000Z",
    "source": "Bleeping Computer",
    "summary": "Chinese state-sponsored threat actors were likely behind the hijacking of Notepad++ update traffic last year that lasted for almost half a year, the developer states in an official announcement today...."
  },
  {
    "title": "Panera Bread breach impacts 5.1 million accounts, not 14 million customers ",
    "link": "https://www.bleepingcomputer.com/news/security/panera-bread-data-breach-impacts-51-million-accounts-not-14-million-customers/",
    "date": "2026-02-02T13:46:39.000Z",
    "source": "Bleeping Computer",
    "summary": "The data breach notification service Have I Been Pwned says that a data breach at the U.S. food chain Panera Bread affected 5.1 million accounts, not 14 million customers as previously reported. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Proxy Botnet, Office Zero-Day, MongoDB Ransoms, AI Hijacks & New Threats",
    "link": "https://thehackernews.com/2026/02/weekly-recap-proxy-botnet-office-zero.html",
    "date": "2026-02-02T11:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Every week brings new discoveries, attacks, and defenses that shape the state of cybersecurity. Some threats are stopped quickly, while others go unseen until they cause real damage.\nSometimes a singl..."
  },
  {
    "title": "Securing the Mid-Market Across the Complete Threat Lifecycle",
    "link": "https://thehackernews.com/2026/02/securing-mid-market-across-complete.html",
    "date": "2026-02-02T11:45:00.000Z",
    "source": "The Hacker News",
    "summary": "For mid-market organizations, cybersecurity is a constant balancing act. Proactive, preventative security measures are essential to protect an expanding attack surface. Combined with effective protect..."
  },
  {
    "title": "Microsoft fixes bug causing password sign-in option to disappear",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-bug-causing-password-sign-in-option-to-disappear/",
    "date": "2026-02-02T11:34:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has fixed a known issue that was causing the password sign-in option to disappear from the lock screen options after installing Windows 11 updates released since August 2025. [...]..."
  },
  {
    "title": "NationStates confirms data breach, shuts down game site",
    "link": "https://www.bleepingcomputer.com/news/security/nationstates-confirms-data-breach-shuts-down-game-site/",
    "date": "2026-02-02T10:05:57.000Z",
    "source": "Bleeping Computer",
    "summary": "NationStates, a multiplayer browser-based game, has confirmed a data breach after taking its website offline earlier this week to investigate a security incident. [...]..."
  },
  {
    "title": "Notepad++ Official Update Mechanism Hijacked to Deliver Malware to Select Users",
    "link": "https://thehackernews.com/2026/02/notepad-official-update-mechanism.html",
    "date": "2026-02-02T08:55:00.000Z",
    "source": "The Hacker News",
    "summary": "The maintainer of Notepad++ has revealed that state-sponsored attackers hijacked the utility's update mechanism to redirect update traffic to malicious servers instead.\n\"The attack involved [an] infra..."
  },
  {
    "title": "eScan Antivirus Update Servers Compromised to Deliver Multi-Stage Malware",
    "link": "https://thehackernews.com/2026/02/escan-antivirus-update-servers.html",
    "date": "2026-02-02T05:47:00.000Z",
    "source": "The Hacker News",
    "summary": "The update infrastructure for eScan antivirus, a security solution developed by Indian cybersecurity company MicroWorld Technologies, has been compromised by unknown attackers to deliver a persistent ..."
  },
  {
    "title": "Open VSX Supply Chain Attack Used Compromised Dev Account to Spread GlassWorm",
    "link": "https://thehackernews.com/2026/02/open-vsx-supply-chain-attack-used.html",
    "date": "2026-02-02T05:04:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a supply chain attack targeting the Open VSX Registry in which unidentified threat actors compromised a legitimate developer's resources to push mal..."
  },
  {
    "title": "Exposed MongoDB instances still targeted in data extortion attacks",
    "link": "https://www.bleepingcomputer.com/news/security/exposed-mongodb-instances-still-targeted-in-data-extortion-attacks/",
    "date": "2026-02-01T16:27:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A threat actor is targeting exposed MongoDB instances in automated data extortion attacks demanding low ransoms from owners to restore the data. [...]..."
  },
  {
    "title": "New Apple privacy feature limits location tracking on iPhones, iPads",
    "link": "https://www.bleepingcomputer.com/news/apple/new-apple-privacy-feature-limits-location-tracking-on-iphones-ipads/",
    "date": "2026-02-01T15:20:40.000Z",
    "source": "Bleeping Computer",
    "summary": "Apple is introducing a new privacy feature that lets users limit the precision of location data shared with cellular networks on some iPhone and iPad models. [...]..."
  },
  {
    "title": "OpenAI says you can trust ChatGPT answers, as it kicks off ads rollout preparation",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-says-you-can-trust-chatgpt-answers-as-it-kicks-off-ads-rollout-preparation/",
    "date": "2026-02-01T02:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI previously confirmed that it's testing ads in ChatGPT for free and $8 Go accounts, and now we're seeing early signs of that rollout, at least on Android. [...]..."
  },
  {
    "title": "OpenAI is retiring famous GPT-4o model, says GPT 5.2 is good enough",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-retiring-famous-gpt-4o-model-says-gpt-52-is-good-enough/",
    "date": "2026-02-01T01:26:02.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI has confirmed that it's retiring ChatGPT's most popular model called GPT-4o and several other models, including GPT-5 Instant, GPT-5 Thinking, GPT-4.1, GPT-4.1 mini, and o4-mini. [...]..."
  },
  {
    "title": "U.S. convicts ex-Google engineer for sending AI tech data to China",
    "link": "https://www.bleepingcomputer.com/news/security/us-convicts-ex-google-engineer-for-sending-ai-tech-data-to-china/",
    "date": "2026-01-31T17:33:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A U.S. federal jury has convicted Linwei Ding, a former software engineer at Google, for stealing AI supercomputer data from his employer and secretly sharing it with Chinese tech firms. [...]..."
  },
  {
    "title": "Cloud storage payment scam floods inboxes with fake renewals",
    "link": "https://www.bleepingcomputer.com/news/security/cloud-storage-payment-scam-floods-inboxes-with-fake-renewals/",
    "date": "2026-01-31T16:21:32.000Z",
    "source": "Bleeping Computer",
    "summary": "Over the past few months, a large-scale cloud storage subscription scam campaign has been targeting users worldwide with repeated emails falsely warning recipients that their photos, files, and accoun..."
  },
  {
    "title": "Mandiant details how ShinyHunters abuse SSO to steal cloud data",
    "link": "https://www.bleepingcomputer.com/news/security/mandiant-details-how-shinyhunters-abuse-sso-to-steal-cloud-data/",
    "date": "2026-01-31T15:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Mandiant says a wave of recent ShinyHunters SaaS data-theft attacks is being fueled by targeted voice phishing (vishing) attacks and company-branded phishing sites that steal single sign-on (SSO) cred..."
  },
  {
    "title": "Researcher reveals evidence of private Instagram profiles leaking photos",
    "link": "https://www.bleepingcomputer.com/news/security/researcher-reveals-evidence-of-private-instagram-profiles-leaking-photos/",
    "date": "2026-01-31T14:27:12.000Z",
    "source": "Bleeping Computer",
    "summary": "A researcher has released detailed evidence showing some Instagram private accounts exposed photo links to unauthenticated visitors. The issue was later fixed, but Meta closed the report as not applic..."
  },
  {
    "title": "Iran-Linked RedKitten Cyber Campaign Targets Human Rights NGOs and Activists",
    "link": "https://thehackernews.com/2026/01/iran-linked-redkitten-cyber-campaign.html",
    "date": "2026-01-31T12:02:00.000Z",
    "source": "The Hacker News",
    "summary": "A Farsi-speaking threat actor aligned with Iranian state interests is suspected to be behind a new campaign targeting non-governmental organizations and individuals involved in documenting recent huma..."
  },
  {
    "title": "Mandiant Finds ShinyHunters-Style Vishing Attacks Stealing MFA to Breach SaaS Platforms",
    "link": "https://thehackernews.com/2026/01/mandiant-finds-shinyhunters-using.html",
    "date": "2026-01-31T07:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Google-owned Mandiant on Friday said it identified an \"expansion in threat activity\" that uses tradecraft consistent with extortion-themed attacks orchestrated by a financially motivated hacking group..."
  },
  {
    "title": "CERT Polska Details Coordinated Cyber Attacks on 30+ Wind and Solar Farms",
    "link": "https://thehackernews.com/2026/01/poland-attributes-december-cyber.html",
    "date": "2026-01-31T07:05:00.000Z",
    "source": "The Hacker News",
    "summary": "CERT Polska, the Polish computer emergency response team, revealed that coordinated cyber attacks targeted more than 30 wind and photovoltaic farms, a private company from the manufacturing sector, an..."
  },
  {
    "title": "Torq Moves SOCs Beyond SOAR With AI-Powered Hyper Automation",
    "link": "https://www.darkreading.com/remote-workforce/torq-moves-socs-soar-ai-powered-hyper-automation",
    "date": "2026-01-30T22:14:31.000Z",
    "source": "Dark Reading",
    "summary": "Investors poured $140 million into Torq's Series D Round, raising the startup's valuation to $1.2 billion, to bring AI-based \"hyper automation\" to SOCs...."
  },
  {
    "title": "2026: The Year Agentic AI Becomes the Attack-Surface Poster Child",
    "link": "https://www.darkreading.com/threat-intelligence/2026-agentic-ai-attack-surface-poster-child",
    "date": "2026-01-30T21:16:15.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading asked readers whether agentic AI attacks, advanced deepfake threats, board recognition of cyber as a top priority, or password-less technology adoption would be most likely to become a tr..."
  },
  {
    "title": "Out-of-the-Box Expectations for 2026 Reveal a Grab-Bag of Risk",
    "link": "https://www.darkreading.com/threat-intelligence/cyber-expectations-2026-grab-bag-risk",
    "date": "2026-01-30T21:14:32.000Z",
    "source": "Dark Reading",
    "summary": "Security teams need to be thinking about this list of emerging cybersecurity realities, to avoid rolling the dice on enterprise security risks (and opportunities)...."
  },
  {
    "title": "Tenable Tackles AI Governance, Shadow AI Risks, Data Exposure",
    "link": "https://www.darkreading.com/cyber-risk/tenable-tackles-ai-governance-shadow-ai-risks-data-exposure",
    "date": "2026-01-30T20:23:53.000Z",
    "source": "Dark Reading",
    "summary": "The Tenable One AI Exposure add-on discovers unsanctioned AI use in the organization and enforces policy compliance with approved tools...."
  },
  {
    "title": "Crypto wallets received a record $158 billion in illicit funds last year",
    "link": "https://www.bleepingcomputer.com/news/security/crypto-wallets-received-a-record-158-billion-in-illicit-funds-last-year/",
    "date": "2026-01-30T18:49:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Illegal cryptocurrency flows hit a record $158 billion in 2025, reversing a three-year trend of declining amounts from $86B in 2021 to $64B in 2024. [...]..."
  },
  {
    "title": "Microsoft to disable NTLM by default in future Windows releases",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-disable-ntlm-by-default-in-future-windows-releases/",
    "date": "2026-01-30T17:08:57.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced that it will disable the 30-year-old NTLM authentication protocol by default in upcoming Windows releases due to security vulnerabilities that expose organizations to cyberattacks...."
  },
  {
    "title": "OpenClaw AI Runs Wild in Business Environments",
    "link": "https://www.darkreading.com/application-security/openclaw-ai-runs-wild-business-environments",
    "date": "2026-01-30T16:40:34.000Z",
    "source": "Dark Reading",
    "summary": "The popular open source AI assistant (aka ClawdBot, MoltBot) has taken off, raising security concerns over its privileged, autonomous control within users' computers...."
  },
  {
    "title": "Operation Switch Off dismantles major pirate TV streaming services",
    "link": "https://www.bleepingcomputer.com/news/legal/operation-switch-off-dismantles-major-pirate-tv-streaming-services/",
    "date": "2026-01-30T16:39:43.000Z",
    "source": "Bleeping Computer",
    "summary": "The latest phase of the global law enforcement action resulted in seizing three industrial-scale illegal IPTV services. [...]..."
  },
  {
    "title": "Researchers Uncover Chrome Extensions Abusing Affiliate Links and Stealing ChatGPT Access",
    "link": "https://thehackernews.com/2026/01/researchers-uncover-chrome-extensions.html",
    "date": "2026-01-30T13:42:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered malicious Google Chrome extensions that come with capabilities to hijack affiliate links, steal data, and collect OpenAI ChatGPT authentication tokens.\nOne of..."
  },
  {
    "title": "China-Linked UAT-8099 Targets IIS Servers in Asia with BadIIS SEO Malware",
    "link": "https://thehackernews.com/2026/01/china-linked-uat-8099-targets-iis.html",
    "date": "2026-01-30T12:08:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new campaign attributed to a China-linked threat actor known as UAT-8099 that took place between late 2025 and early 2026.\nThe activity, discovered by Cisco..."
  }
]