[
  {
    "title": "Windows 10 KB5061087 update released with 13 changes and fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5061087-update-released-with-13-changes-and-fixes/",
    "date": "2025-06-24T18:07:43.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released the June 2025 non-security preview update for Windows 10, version 22H2, with fixes for bugs preventing the Start Menu from launching and breaking scanning features on USB multi-..."
  },
  {
    "title": "AT&T customer? You might get a cut of $177 million data breach settlement",
    "link": "https://www.zdnet.com/article/at-t-customer-you-might-get-a-cut-of-177-million-data-breach-settlement/",
    "date": "2025-06-24T17:53:57.000Z",
    "source": "ZDNet Security",
    "summary": "Millions of customers had their data stolen. Now AT&T is offering compensation...."
  },
  {
    "title": "Microsoft fixes known issue that breaks Windows 11 updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-known-issue-that-breaks-windows-11-updates/",
    "date": "2025-06-24T17:13:30.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is rolling out a configuration update designed to address a known issue causing Windows Update to fail on some Windows 11 systems. [...]..."
  },
  {
    "title": "How to get Windows 10 extended security updates for free: 2 options",
    "link": "https://www.zdnet.com/article/how-to-get-windows-10-extended-security-updates-for-free-2-options/",
    "date": "2025-06-24T17:00:19.000Z",
    "source": "ZDNet Security",
    "summary": "Don't want to fork over $30 for a one-year subscription to Windows 10 Extended Security Updates? Microsoft is offering a couple of ways to avoid the fee. But there is a catch...."
  },
  {
    "title": "Windows 10 users can get extended security updates using Microsoft points",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-10-extended-security-updates-available-using-reward-points/",
    "date": "2025-06-24T17:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft says Windows 10 home users who want to delay switching to Windows 11 can enroll in the Extended Security Updates (ESU) program at no additional cost using Microsoft Rewards points or enablin..."
  },
  {
    "title": "Trezor’s support platform abused in crypto theft phishing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/trezors-support-platform-abused-in-crypto-theft-phishing-attacks/",
    "date": "2025-06-24T16:54:16.000Z",
    "source": "Bleeping Computer",
    "summary": "Trezor is alerting users about a phishing campaign that abuses its automated support system to send deceptive emails from its official platform. [...]..."
  },
  {
    "title": "New FileFix attack weaponizes Windows File Explorer for stealthy commands",
    "link": "https://www.bleepingcomputer.com/news/security/filefix-attack-weaponizes-windows-file-explorer-for-stealthy-powershell-commands/",
    "date": "2025-06-24T15:00:09.000Z",
    "source": "Bleeping Computer",
    "summary": "A cybersecurity researcher has developed FileFix, a variant of the ClickFix social engineering attack that tricks users into executing malicious commands via the File Explorer address bar in Windows. ..."
  },
  {
    "title": "Researchers Find Way to Shut Down Cryptominer Campaigns Using Bad Shares and XMRogue",
    "link": "https://thehackernews.com/2025/06/researchers-find-way-to-shut-down.html",
    "date": "2025-06-24T14:17:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have detailed two novel methods that can be used to disrupt cryptocurrency mining botnets.\nThe methods take advantage of the design of various common mining topologies in ord..."
  },
  {
    "title": "How Today’s Pentest Models Compare and Why Continuous Wins",
    "link": "https://www.bleepingcomputer.com/news/security/how-todays-pentest-models-compare-and-why-continuous-wins/",
    "date": "2025-06-24T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Legacy pentests give you a snapshot. Attackers see a live stream. Sprocket's Continuous Penetration Testing (CPT) mimics real-world attackers—daily, not annually—so you can fix what matters, faster. L..."
  },
  {
    "title": "How the US Military Is Redefining Zero Trust",
    "link": "https://www.darkreading.com/vulnerabilities-threats/how-us-military-redefining-zero-trust",
    "date": "2025-06-24T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Trust no longer comes from network boundaries alone but from continuously validating and protecting data and identities at every interaction...."
  },
  {
    "title": "US House bans WhatsApp on staff devices over security concerns",
    "link": "https://www.bleepingcomputer.com/news/security/us-house-bans-whatsapp-on-staff-devices-over-security-concerns/",
    "date": "2025-06-24T13:43:53.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. House of Representatives has banned the installation and use of WhatsApp on government-issued devices belonging to congressional staff, citing concerns over how the app encrypts and secures d..."
  },
  {
    "title": "Want a free VPN? How to use ProtonVPN on Android without having to pay",
    "link": "https://www.zdnet.com/article/want-a-free-vpn-how-to-use-protonvpn-on-android-without-having-to-pay/",
    "date": "2025-06-24T13:32:19.000Z",
    "source": "ZDNet Security",
    "summary": "The best part is you don't need to sign in or even create a ProtonVPN account. Here's how...."
  },
  {
    "title": "Hackers Target Over 70 Microsoft Exchange Servers to Steal Credentials via Keyloggers",
    "link": "https://thehackernews.com/2025/06/hackers-target-65-microsoft-exchange.html",
    "date": "2025-06-24T13:26:00.000Z",
    "source": "The Hacker News",
    "summary": "Unidentified threat actors have been observed targeting publicly exposed Microsoft Exchange servers to inject malicious code into the login pages that harvest their credentials.\nPositive Technologies,..."
  },
  {
    "title": "2 clever ways Android 16 guards your security - but you need to enable them",
    "link": "https://www.zdnet.com/article/2-clever-ways-android-16-guards-your-security-but-you-need-to-enable-them/",
    "date": "2025-06-24T12:35:48.000Z",
    "source": "ZDNet Security",
    "summary": "Once you turn on these new Android 16 security features, your information and phone will be better protected against harm...."
  },
  {
    "title": "Oh! Canada Added to List of Nations Targeted in Salt Typhoon Telecom Spree",
    "link": "https://www.darkreading.com/cloud-security/canada-targeted-salt-typhoon-telecom",
    "date": "2025-06-24T12:10:32.000Z",
    "source": "Dark Reading",
    "summary": "The Canadian Center for Cybersecurity has confirmed that the Chinese state-sponsored cyber-threat actor targeted one of its telecommunications companies in February via a Cisco flaw, as part of global..."
  },
  {
    "title": "IBM Pushes for More Collaboration Between Security, Governance",
    "link": "https://www.darkreading.com/cyber-risk/ibm-pushes-more-collaboration-security-governance",
    "date": "2025-06-24T12:05:24.000Z",
    "source": "Dark Reading",
    "summary": "IBM integrates its governance and AI security tools to address the risks associated with the AI adoption boom...."
  },
  {
    "title": "Between Buzz and Reality: The CTEM Conversation We All Need",
    "link": "https://thehackernews.com/2025/06/between-buzz-and-reality-ctem.html",
    "date": "2025-06-24T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "I had the honor of hosting the first episode of the Xposure Podcast live from Xposure Summit 2025. And I couldn’t have asked for a better kickoff panel: three cybersecurity leaders who don’t just talk..."
  },
  {
    "title": "Hackers Exploit Misconfigured Docker APIs to Mine Cryptocurrency via Tor Network",
    "link": "https://thehackernews.com/2025/06/hackers-exploit-misconfigured-docker.html",
    "date": "2025-06-24T09:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Misconfigured Docker instances are the target of a campaign that employs the Tor anonymity network to stealthily mine cryptocurrency in susceptible environments.\n\"Attackers are exploiting misconfigure..."
  },
  {
    "title": "U.S. House Bans WhatsApp on Official Devices Over Security and Data Protection Issues",
    "link": "https://thehackernews.com/2025/06/us-house-bans-whatsapp-on-official.html",
    "date": "2025-06-24T09:16:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. House of Representatives has formally banned congressional staff members from using WhatsApp on government-issued devices, citing security concerns.\nThe development was first reported by Axio..."
  },
  {
    "title": "APT28 Uses Signal Chat to Deploy BEARDSHELL Malware and COVENANT in Ukraine",
    "link": "https://thehackernews.com/2025/06/apt28-uses-signal-chat-to-deploy.html",
    "date": "2025-06-24T09:06:00.000Z",
    "source": "The Hacker News",
    "summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has warned of a new cyber attack campaign by the Russia-linked APT28 (aka UAC-0001) threat actors using Signal chat messages to deliver two ne..."
  },
  {
    "title": "I found a worthy Ring alternative in this video security camera (and it has no subscriptions)",
    "link": "https://www.zdnet.com/article/i-found-a-worthy-ring-alternative-in-this-video-security-camera-and-it-has-no-subscriptions/",
    "date": "2025-06-24T08:30:15.000Z",
    "source": "ZDNet Security",
    "summary": "The Aqara Camera Hub G5 Pro blends AI-driven visual recognition with a robust suite of home security features...."
  },
  {
    "title": "China-linked Salt Typhoon Exploits Critical Cisco Vulnerability to Target Canadian Telecom",
    "link": "https://thehackernews.com/2025/06/china-linked-salt-typhoon-exploits.html",
    "date": "2025-06-24T03:00:00.000Z",
    "source": "The Hacker News",
    "summary": "The Canadian Centre for Cyber Security and the U.S. Federal Bureau of Investigation (FBI) have issued an advisory warning of cyber attacks mounted by the China-linked Salt Typhoon actors to breach maj..."
  },
  {
    "title": "APT28 hackers use Signal chats to launch new malware attacks on Ukraine",
    "link": "https://www.bleepingcomputer.com/news/security/apt28-hackers-use-signal-chats-to-launch-new-malware-attacks-on-ukraine/",
    "date": "2025-06-23T22:14:59.000Z",
    "source": "Bleeping Computer",
    "summary": "The Russian state-sponsored threat group APT28 is using Signal chats to target government targets in Ukraine with two previously undocumented malware families named BeardShell and SlimAgent. [...]..."
  },
  {
    "title": "SparkKitty Swipes Pics From iOS, Android Devices",
    "link": "https://www.darkreading.com/mobile-security/sparkkitty-swipes-pics-ios-android-devices",
    "date": "2025-06-23T21:25:55.000Z",
    "source": "Dark Reading",
    "summary": "Like its predecessor, SparkCat, the new malware appears to be going after sensitive data — such as seed phrases for cryptocurrency wallets — in device photo galleries...."
  },
  {
    "title": "'Echo Chamber' Attack Blows Past AI Guardrails",
    "link": "https://www.darkreading.com/cloud-security/echo-chamber-attack-ai-guardrails",
    "date": "2025-06-23T20:28:08.000Z",
    "source": "Dark Reading",
    "summary": "An AI security researcher has developed a proof of concept that uses subtle, seemingly benign prompts to get GPT and Gemini to generate inappropriate content...."
  },
  {
    "title": "Citrix Patches Critical Vulns in NetScaler ADC and Gateway",
    "link": "https://www.darkreading.com/vulnerabilities-threats/citrix-patches-vulns-netscaler-adc-gateway",
    "date": "2025-06-23T19:04:59.000Z",
    "source": "Dark Reading",
    "summary": "Citrix is recommending its customers upgrade their appliances to mitigate potential exploitation of the vulnerabilities...."
  },
  {
    "title": "5 Chromecast features to make the most of your TV (including a smart home hack)",
    "link": "https://www.zdnet.com/article/5-chromecast-features-to-make-the-most-of-your-tv-including-a-smart-home-hack/",
    "date": "2025-06-23T18:54:00.000Z",
    "source": "ZDNet Security",
    "summary": "Google's popular streaming device has been around for over 10 years - and it's still capable of much more than just playing your favorite shows...."
  },
  {
    "title": "DHS Warns of Rise in Cyberattacks in Light of US-Iran Conflict",
    "link": "https://www.darkreading.com/threat-intelligence/dhs-cyberattacks-iran-conflict",
    "date": "2025-06-23T18:35:40.000Z",
    "source": "Dark Reading",
    "summary": "After President's Trump decision to enter the US into the conflict in the Middle East, the Department of Homeland Security expects there to be an uptick in Iranian hacktivists and state-sponsored acto..."
  },
  {
    "title": "Malware on Google Play, Apple App Store stole your photos—and crypto",
    "link": "https://www.bleepingcomputer.com/news/security/malware-on-google-play-app-store-stole-your-photos-and-crypto/",
    "date": "2025-06-23T16:44:56.000Z",
    "source": "Bleeping Computer",
    "summary": "A new mobile crypto-stealing malware called SparkKitty was found in apps on Google Play and the Apple App Store, targeting Android and iOS devices. [...]..."
  },
  {
    "title": "US Homeland Security warns of escalating Iranian cyberattack risks",
    "link": "https://www.bleepingcomputer.com/news/security/us-homeland-security-warns-of-escalating-iranian-cyberattack-risks/",
    "date": "2025-06-23T16:22:37.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Department of Homeland Security (DHS) warned over the weekend of escalating cyberattack risks by Iran-backed hacking groups and pro-Iranian hacktivists. [...]..."
  }
]