[
  {
    "title": "CISA Flags Critical ASUS Live Update Flaw After Evidence of Active Exploitation",
    "link": "https://thehackernews.com/2025/12/cisa-flags-critical-asus-live-update.html",
    "date": "2025-12-18T05:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a critical flaw impacting ASUS Live Update to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of ..."
  },
  {
    "title": "Cisco Warns of Active Attacks Exploiting Unpatched 0-Day in AsyncOS Email Security Appliances",
    "link": "https://thehackernews.com/2025/12/cisco-warns-of-active-attacks.html",
    "date": "2025-12-18T04:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has alerted users to a maximum-severity zero-day flaw in Cisco AsyncOS software that has been actively exploited by a China-nexus advanced persistent threat (APT) actor codenamed UAT-9686 in att..."
  },
  {
    "title": "Zeroday Cloud hacking event awards $320,0000 for 11 zero days",
    "link": "https://www.bleepingcomputer.com/news/security/zeroday-cloud-hacking-event-awards-320-0000-for-11-zero-days/",
    "date": "2025-12-17T23:09:36.000Z",
    "source": "Bleeping Computer",
    "summary": "The Zeroday Cloud hacking competition in London has awarded researchers $320,000 for demonstrating critical remote code execution vulnerabilities in components used in cloud infrastructure. [...]..."
  },
  {
    "title": "Critical Fortinet Flaws Under Active Attack",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/critical-fortinet-flaws-under-active-attack",
    "date": "2025-12-17T22:44:38.000Z",
    "source": "Dark Reading",
    "summary": "Attackers targeted admin accounts, and once authenticated, exported device configurations including hashed credentials and other sensitive information...."
  },
  {
    "title": "France arrests suspect tied to cyberattack on Interior Ministry",
    "link": "https://www.bleepingcomputer.com/news/security/france-arrests-suspect-tied-to-cyberattack-on-interior-ministry/",
    "date": "2025-12-17T22:20:02.000Z",
    "source": "Bleeping Computer",
    "summary": "French authorities arrested a 22-year-old suspect on Tuesday for a cyberattack that targeted France's Ministry of the Interior earlier this month. [...]..."
  },
  {
    "title": "In Cybersecurity, Claude Leaves Other LLMs in the Dust",
    "link": "https://www.darkreading.com/cybersecurity-analytics/cybersecurity-claude-llms",
    "date": "2025-12-17T22:01:58.000Z",
    "source": "Dark Reading",
    "summary": "Anthropic proves that LLMs can be fairly resistant to abuse. Most developers are either incapable of building safer tools, or unwilling to invest in doing so...."
  },
  {
    "title": "Amazon: Ongoing cryptomining campaign uses hacked AWS accounts",
    "link": "https://www.bleepingcomputer.com/news/security/amazon-ongoing-cryptomining-campaign-uses-hacked-aws-accounts/",
    "date": "2025-12-17T21:48:33.000Z",
    "source": "Bleeping Computer",
    "summary": "Amazon's AWS GuardDuty security team is warning of an ongoing crypto-mining campaign that targets its Elastic Compute Cloud (EC2) and Elastic Container Service (ECS) using compromised credentials for ..."
  },
  {
    "title": "'Cellik' Android RAT Leverages Google Play Store",
    "link": "https://www.darkreading.com/threat-intelligence/cellik-android-rat-leverages-google-play-store",
    "date": "2025-12-17T21:38:50.000Z",
    "source": "Dark Reading",
    "summary": "The remote access Trojan lets an attacker remotely control a victim's phone and can generate malicious apps from inside the Play Store...."
  },
  {
    "title": "WhatsApp device linking abused in account hijacking attacks",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-device-linking-abused-in-account-hijacking-attacks/",
    "date": "2025-12-17T19:14:30.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are abusing the legitimate device-linking feature to hijack WhatsApp accounts via pairing codes in a campaign dubbed GhostPairing. [...]..."
  },
  {
    "title": "Cisco warns of unpatched AsyncOS zero-day exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-unpatched-asyncos-zero-day-exploited-in-attacks/",
    "date": "2025-12-17T18:45:36.000Z",
    "source": "Bleeping Computer",
    "summary": "​Cisco warned customers today of an unpatched, maximum-severity Cisco AsyncOS zero-day actively exploited in attacks targeting Secure Email Gateway (SEG) and Secure Email and Web Manager (SEWM) applia..."
  },
  {
    "title": "SonicWall Fixes Actively Exploited CVE-2025-40602 in SMA 100 Appliances",
    "link": "https://thehackernews.com/2025/12/sonicwall-fixes-actively-exploited-cve.html",
    "date": "2025-12-17T18:17:00.000Z",
    "source": "The Hacker News",
    "summary": "SonicWall has rolled out fixes to address a security flaw in Secure Mobile Access (SMA) 100 series appliances that it said has been actively exploited in the wild.\nThe vulnerability, tracked as CVE-20..."
  },
  {
    "title": "Kimwolf Botnet Hijacks 1.8 Million Android TVs, Launches Large-Scale DDoS Attacks",
    "link": "https://thehackernews.com/2025/12/kimwolf-botnet-hijacks-18-million.html",
    "date": "2025-12-17T18:09:00.000Z",
    "source": "The Hacker News",
    "summary": "A new distributed denial-of-service (DDoS) botnet known as Kimwolf has enlisted a massive army of no less than 1.8 million infected devices comprising Android-based TVs, set-top boxes, and tablets, an..."
  },
  {
    "title": "Sonicwall warns of new SMA1000 zero-day exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-warns-of-new-sma1000-zero-day-exploited-in-attacks/",
    "date": "2025-12-17T17:44:18.000Z",
    "source": "Bleeping Computer",
    "summary": "SonicWall warned customers today to patch a vulnerability in the SonicWall SMA1000 Appliance Management Console (AMC) that was chained in zero-day attacks to escalate privileges. [...]..."
  },
  {
    "title": "Attackers Use Stolen AWS Credentials in Cryptomining Campaign",
    "link": "https://www.darkreading.com/cloud-security/attackers-use-stolen-aws-credentials-cryptomining",
    "date": "2025-12-17T16:33:22.000Z",
    "source": "Dark Reading",
    "summary": "Threat actors wielding stolen AWS Identity and Access Management (IAM) credentials leverage Amazon EC and EC2 infrastructure across multiple customer environments...."
  },
  {
    "title": "Critical React2Shell flaw exploited in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/critical-react2shell-flaw-exploited-in-ransomware-attacks/",
    "date": "2025-12-17T16:09:51.000Z",
    "source": "Bleeping Computer",
    "summary": "A ransomware gang exploited the critical React2Shell vulnerability (CVE-2025-55182) to gain initial access to corporate networks and deployed the file-encrypting malware less than a minute later. [......"
  },
  {
    "title": "APT28 Targets Ukrainian UKR-net Users in Long-Running Credential Phishing Campaign",
    "link": "https://thehackernews.com/2025/12/apt28-targets-ukrainian-ukr-net-users.html",
    "date": "2025-12-17T15:30:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russian state-sponsored threat actor known as APT28 has been attributed to what has been described as a \"sustained\" credential-harvesting campaign targeting users of UKR[.]net, a webmail and news ..."
  },
  {
    "title": "New ForumTroll Phishing Attacks Target Russian Scholars Using Fake eLibrary Emails",
    "link": "https://thehackernews.com/2025/12/new-forumtroll-phishing-attacks-target.html",
    "date": "2025-12-17T14:54:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor linked to Operation ForumTroll has been attributed to a fresh set of phishing attacks targeting individuals within Russia, according to Kaspersky.\nThe Russian cybersecurity vendor sai..."
  },
  {
    "title": "Your MFA Is Costing You Millions. It Doesn't Have To.",
    "link": "https://www.bleepingcomputer.com/news/security/your-mfa-is-costing-you-millions-it-doesnt-have-to/",
    "date": "2025-12-17T14:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Passwords and app-based MFA add hidden costs through lost productivity, frequent resets, and risk of phishing and social engineering attacks. Token explains how wireless biometric, passwordless authen..."
  },
  {
    "title": "Microsoft asks admins to reach out for Windows IIS failures fix",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-asks-it-admins-to-reach-out-for-windows-iis-failures-fix/",
    "date": "2025-12-17T12:30:32.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has asked businesses to reach out for advice on how to temporarily mitigate a Message Queuing (MSMQ) issue causing enterprise apps and Internet Information Services (IIS) sites to fail. [......"
  },
  {
    "title": "Fix SOC Blind Spots: See Threats to Your Industry & Country in Real Time",
    "link": "https://thehackernews.com/2025/12/fix-soc-blind-spots-see-threats-to-your.html",
    "date": "2025-12-17T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Modern security teams often feel like they’re driving through fog with failing headlights. Threats accelerate, alerts multiply, and SOCs struggle to understand which dangers matter right now for their..."
  },
  {
    "title": "China-Linked Ink Dragon Hacks Governments Using ShadowPad and FINALDRAFT Malware",
    "link": "https://thehackernews.com/2025/12/china-linked-ink-dragon-hacks.html",
    "date": "2025-12-17T11:12:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Jewelbug has been increasingly focusing on government targets in Europe since July 2025, even as it continues to attack entities located in Southeast Asia and South America.\n..."
  },
  {
    "title": "GhostPoster Malware Found in 17 Firefox Add-ons with 50,000+ Downloads",
    "link": "https://thehackernews.com/2025/12/ghostposter-malware-found-in-17-firefox.html",
    "date": "2025-12-17T08:14:00.000Z",
    "source": "The Hacker News",
    "summary": "A new campaign named GhostPoster has leveraged logo files associated with 17 Mozilla Firefox browser add-ons to embed malicious JavaScript code designed to hijack affiliate links, inject tracking code..."
  },
  {
    "title": "Afripol Focuses on Regional Cyber Challenges, Deepening Cooperation",
    "link": "https://www.darkreading.com/cybersecurity-operations/afripol-focuses-regional-cyber-challenges-deepening-cooperation",
    "date": "2025-12-17T07:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Rapid digitization, uneven cybersecurity know-how, and growing cybercriminal syndicates in the region have challenged law enforcement and prosecutors...."
  },
  {
    "title": "Cellik Android malware builds malicious versions from Google Play apps",
    "link": "https://www.bleepingcomputer.com/news/security/cellik-android-malware-builds-malicious-versions-from-google-play-apps/",
    "date": "2025-12-16T22:59:35.000Z",
    "source": "Bleeping Computer",
    "summary": "A new Android malware-as-a-service (MaaS) named Cellik is being advertised on underground cybercrime forums offering a robust set of capabilities that include the option to embed it in any app availab..."
  },
  {
    "title": "Why a 17-Year-Old Built an AI Model to Expose Deepfake Maps",
    "link": "https://www.darkreading.com/threat-intelligence/why-17-year-old-built-ai-expose-deepfake-maps",
    "date": "2025-12-16T22:53:00.000Z",
    "source": "Dark Reading",
    "summary": "A high-school student is tackling the overlooked risk of AI-generated satellite imagery that could mislead governments and emergency responders...."
  },
  {
    "title": "Why You Should Train Your SOC Like a Triathlete",
    "link": "https://www.darkreading.com/cybersecurity-operations/why-you-should-train-your-soc-like-triathlete",
    "date": "2025-12-16T22:20:33.000Z",
    "source": "Dark Reading",
    "summary": "The key elements in a security operations center's strategy map very closely to the swim/bike/run events in a triathlon. SOCs, like triathletes, perform well when their \"inputs\" are strong...."
  },
  {
    "title": "GhostPoster attacks hide malicious JavaScript in Firefox addon logos",
    "link": "https://www.bleepingcomputer.com/news/security/ghostposter-attacks-hide-malicious-javascript-in-firefox-addon-logos/",
    "date": "2025-12-16T22:17:46.000Z",
    "source": "Bleeping Computer",
    "summary": "A new campaign dubbed 'GhostPoster' is hiding JavaScript code in the image logo of malicious Firefox extensions counting more than 50,000 downloads, to monitor browser activity and plant a backdoor. [..."
  },
  {
    "title": "Venezuelan Oil Company Downplays Alleged US Cyberattack",
    "link": "https://www.darkreading.com/cyber-risk/venezuela-oil-company-downplays-alleged-us-cyberattack",
    "date": "2025-12-16T20:33:16.000Z",
    "source": "Dark Reading",
    "summary": "But media reports described the attack as causing major disruption to PDVSA, the state-owned oil and natural gas company...."
  },
  {
    "title": "Amazon disrupts Russian GRU hackers attacking edge network devices",
    "link": "https://www.bleepingcomputer.com/news/security/amazon-disrupts-russian-gru-hackers-attacking-edge-network-devices/",
    "date": "2025-12-16T20:13:09.000Z",
    "source": "Bleeping Computer",
    "summary": "The Amazon Threat Intelligence team has disrupted active operations attributed to hackers working for the Russian foreign military intelligence agency, the GRU, who targeted customers' cloud infrastru..."
  },
  {
    "title": "Russia Hits Critical Orgs Via Misconfigured Edge Devices",
    "link": "https://www.darkreading.com/endpoint-security/russian-apt-attacking-critical-orgs-around-world",
    "date": "2025-12-16T20:03:15.000Z",
    "source": "Dark Reading",
    "summary": "Amazon detailed a long-running campaign by Russia against critical infrastructure organizations, particularly in the energy sector...."
  }
]