[
  {
    "title": "[Dark Reading Virtual Event] Know Your Enemy: How cybercriminals and nation-state hackers operate",
    "link": "https://www.darkreading.com/events/-dark-reading-virtual-event-know-your-enemy-how-cybercriminals-and-nation-state-hackers-operate",
    "date": "2025-09-29T12:50:23.774Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "OpenAI is routing GPT-4o to safety models when it detects harmful activities",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-routing-gpt-4o-to-safety-models-when-it-detects-harmful-activities/",
    "date": "2025-09-29T12:04:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Over the weekend, some people noticed that GPT-4o is routing requests to an unknown model out of nowhere. Turns out it's a \"safety\" feature. [...]..."
  },
  {
    "title": "The State of AI in the SOC 2025 - Insights from Recent Study ",
    "link": "https://thehackernews.com/2025/09/the-state-of-ai-in-soc-2025-insights.html",
    "date": "2025-09-29T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Security leaders are embracing AI for triage, detection engineering, and threat hunting as alert volumes and burnout hit breaking points.\nA comprehensive survey of 282 security leaders at companies ac..."
  },
  {
    "title": "Microsoft Flags AI-Driven Phishing: LLM-Crafted SVG Files Outsmart Email Security",
    "link": "https://thehackernews.com/2025/09/microsoft-flags-ai-driven-phishing-llm.html",
    "date": "2025-09-29T08:52:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft is calling attention to a new phishing campaign primarily aimed at U.S.-based organizations that has likely utilized code generated using large language models (LLMs) to obfuscate payloads a..."
  },
  {
    "title": "First Malicious MCP Server Found Stealing Emails in Rogue Postmark-MCP Package",
    "link": "https://thehackernews.com/2025/09/first-malicious-mcp-server-found.html",
    "date": "2025-09-29T08:36:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered what has been described as the first-ever instance of a Model Context Protocol (MCP) server spotted in the wild, raising software supply chain risks.\nAccordin..."
  },
  {
    "title": "Akira ransomware breaching MFA-protected SonicWall VPN accounts",
    "link": "https://www.bleepingcomputer.com/news/security/akira-ransomware-breaching-mfa-protected-sonicwall-vpn-accounts/",
    "date": "2025-09-28T18:49:30.000Z",
    "source": "Bleeping Computer",
    "summary": "Ongoing Akira ransomware attacks targeting SonicWall SSL VPN devices continue to evolve, with the threat actors found to be successfully logging in despite OTP MFA being enabled on accounts. Researche..."
  },
  {
    "title": "EU probes SAP over anti-competitive ERP support practices",
    "link": "https://www.bleepingcomputer.com/news/legal/eu-probes-sap-over-anti-competitive-erp-support-practices/",
    "date": "2025-09-28T14:23:46.000Z",
    "source": "Bleeping Computer",
    "summary": "The European Comission is investigating potential anti-competitive practices in aftermarket services SAP provides for its on-premise ERP software. [...]..."
  },
  {
    "title": "Fake Microsoft Teams installers push Oyster malware via malvertising",
    "link": "https://www.bleepingcomputer.com/news/security/fake-microsoft-teams-installers-push-oyster-malware-via-malvertising/",
    "date": "2025-09-27T19:49:22.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers have been spotted using SEO poisoning and search engine advertisements to promote fake Microsoft Teams installers that infect Windows devices with the Oyster backdoor, providing initial access..."
  },
  {
    "title": "Dutch teens arrested for trying to spy on Europol for Russia",
    "link": "https://www.bleepingcomputer.com/news/security/dutch-teens-arrested-for-trying-to-spy-on-europol-for-russia/",
    "date": "2025-09-27T14:17:44.000Z",
    "source": "Bleeping Computer",
    "summary": "Two Dutch teenage boys aged 17, reportedly used hacking devices to spy for Russia, have been arrested by the Politie on Monday. [...]..."
  },
  {
    "title": "China-Linked PlugX and Bookworm Malware Attacks Target Asian Telecom and ASEAN Networks",
    "link": "https://thehackernews.com/2025/09/china-linked-plugx-and-bookworm-malware.html",
    "date": "2025-09-27T12:06:00.000Z",
    "source": "The Hacker News",
    "summary": "Telecommunications and manufacturing sectors in Central and South Asian countries have emerged as the target of an ongoing campaign distributing a new variant of a known malware called PlugX (aka Korp..."
  },
  {
    "title": "Volvo Employee SSNs Stolen in Supplier Ransomware Attack",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/volvo-employee-ssns-stolen-ransomware-attack",
    "date": "2025-09-26T19:59:54.000Z",
    "source": "Dark Reading",
    "summary": "Three international vehicle manufacturers have fallen to supply chain cyberattacks in the past month alone...."
  },
  {
    "title": "Microsoft’s new AI feature will organize your photos automatically",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsofts-new-ai-feature-will-organize-your-photos-automatically/",
    "date": "2025-09-26T19:41:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has begun testing a new AI-powered feature in Microsoft Photos, designed to categorize photos automatically on Windows 11 systems. [...]..."
  },
  {
    "title": "US investors to take over TikTok operations in the country",
    "link": "https://www.bleepingcomputer.com/news/government/us-investors-to-take-over-tiktok-operations-in-the-country/",
    "date": "2025-09-26T17:01:38.000Z",
    "source": "Bleeping Computer",
    "summary": "U.S. President Donald Trump has signed an executive order approving a plan to restructure TikTok operations in the country to address national security concerns. [...]..."
  },
  {
    "title": "Microsoft shares temp fix for Outlook encrypted email errors",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-shares-temp-fix-for-outlook-encrypted-email-errors/",
    "date": "2025-09-26T16:43:48.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating a known issue that triggers Outlook errors when opening encrypted emails sent from other organizations. [...]..."
  },
  {
    "title": "Researchers Expose Phishing Threats Distributing CountLoader and PureRAT",
    "link": "https://thehackernews.com/2025/09/researchers-expose-svg-and-purerat.html",
    "date": "2025-09-26T16:40:00.000Z",
    "source": "The Hacker News",
    "summary": "A new campaign has been observed impersonating Ukrainian government agencies in phishing attacks to deliver CountLoader, which is then used to drop Amatera Stealer and PureMiner.\n\"The phishing emails ..."
  },
  {
    "title": "Microsoft Edge to block malicious sideloaded extensions",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-edge-to-block-malicious-sideloaded-extensions/",
    "date": "2025-09-26T15:39:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is planning to introduce a new Edge security feature that will protect users against malicious extensions sideloaded into the web browser. [...]..."
  },
  {
    "title": "Iranian State Hackers Use SSL.com Certificates to Sign Malware",
    "link": "https://www.darkreading.com/vulnerabilities-threats/iranian-hackers-ssl-certificates-sign-malware",
    "date": "2025-09-26T15:28:35.000Z",
    "source": "Dark Reading",
    "summary": "Security researchers say multiple threat groups, including Iran's Charming Kitten APT offshoot Subtle Snail, are deploying malware with code-signing certificates from the Houston-based company...."
  },
  {
    "title": "The hidden cyber risks of deploying generative AI",
    "link": "https://www.bleepingcomputer.com/news/security/the-hidden-cyber-risks-of-deploying-generative-ai/",
    "date": "2025-09-26T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Generative AI can boost productivity—but without safeguards, it also opens the door to phishing, fraud & model manipulation. Learn more from Acronis TRU on why AI security must be built in from the st..."
  },
  {
    "title": "Maximum severity GoAnywhere MFT flaw exploited as zero day",
    "link": "https://www.bleepingcomputer.com/news/security/maximum-severity-goanywhere-mft-flaw-exploited-as-zero-day/",
    "date": "2025-09-26T13:50:42.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are actively exploiting a maximum severity vulnerability (CVE-2025-10035) in Fortra's GoAnywhere MFT that allows injecting commands remotely without authentication. [...]..."
  },
  {
    "title": "Prep is Underway, But 2026 FIFA World Cup Poses Significant Cyber Challenges",
    "link": "https://www.darkreading.com/cybersecurity-operations/crowds-drones-world-cup-cyber-challenges",
    "date": "2025-09-26T13:34:04.000Z",
    "source": "Dark Reading",
    "summary": "The world's most-popular sports contest starts in June 2026 across 16 venues in three countries: Securing the event infrastructure from cyber threats will require massive collaboration...."
  },
  {
    "title": "Microsoft releases the final Windows 10 22H2 preview update",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-the-final-windows-10-22h2-preview-update/",
    "date": "2025-09-26T13:32:07.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released the final non-security preview update for Windows 10, version 22H2, which includes fixes for the out-of-box experience and SMBv1 protocol connectivity. [...]..."
  },
  {
    "title": "New COLDRIVER Malware Campaign Joins BO Team and Bearlyfy in Russia-Focused Cyberattacks",
    "link": "https://thehackernews.com/2025/09/new-coldriver-malware-campaign-joins-bo.html",
    "date": "2025-09-26T12:45:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russian advanced persistent threat (APT) group known as COLDRIVER has been attributed to a fresh round of ClickFix-style attacks designed to deliver two new \"lightweight\" malware families tracked ..."
  },
  {
    "title": "Crash Tests for Security: Why BAS Is Proof of Defense, Not Assumptions",
    "link": "https://thehackernews.com/2025/09/crash-tests-for-security-why-bas-is.html",
    "date": "2025-09-26T11:22:00.000Z",
    "source": "The Hacker News",
    "summary": "Car makers don’t trust blueprints. They smash prototypes into walls. Again and again. In controlled conditions.\nBecause design specs don’t prove survival. Crash tests do. They separate theory from rea..."
  },
  {
    "title": "Fortra GoAnywhere CVSS 10 Flaw Exploited as 0-Day a Week Before Public Disclosure",
    "link": "https://thehackernews.com/2025/09/fortra-goanywhere-cvss-10-flaw.html",
    "date": "2025-09-26T09:22:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity company watchTowr Labs has disclosed that it has \"credible evidence\" of active exploitation of the recently disclosed security flaw in Fortra GoAnywhere Managed File Transfer (MFT) softw..."
  },
  {
    "title": "New macOS XCSSET Variant Targets Firefox with Clipper and Persistence Module",
    "link": "https://thehackernews.com/2025/09/new-macos-xcsset-variant-targets.html",
    "date": "2025-09-26T09:09:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered an updated version of a known Apple macOS malware called XCSSET that has been observed in limited attacks.\n\"This new variant of XCSSET brings key changes rela..."
  },
  {
    "title": "Cisco ASA Firewall Zero-Day Exploits Deploy RayInitiator and LINE VIPER Malware",
    "link": "https://thehackernews.com/2025/09/cisco-asa-firewall-zero-day-exploits.html",
    "date": "2025-09-26T05:51:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.K. National Cyber Security Centre (NCSC) has revealed that threat actors have exploited the recently disclosed security flaws impacting Cisco firewalls as part of zero-day attacks to deliver pre..."
  },
  {
    "title": "Cisco's Wave of Actively Exploited Zero-Day Bugs Targets Firewalls, IOS",
    "link": "https://www.darkreading.com/vulnerabilities-threats/cisco-actively-exploited-zero-day-bugs-firewalls-ios",
    "date": "2025-09-25T19:22:15.000Z",
    "source": "Dark Reading",
    "summary": "Patch now: Cisco recently disclosed four actively exploited zero-days affecting millions of devices, including three targeted by a nation-state actor previously discovered to be behind the \"ArcaneDoor..."
  },
  {
    "title": "Chinese APT Drops 'Brickstorm' Backdoors on Edge Devices",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/chinese-apt-brickstorm-backdoors-edge-devices",
    "date": "2025-09-25T19:05:29.000Z",
    "source": "Dark Reading",
    "summary": "The China-linked cyber-espionage group UNC5221 is compromising network appliances that cannot run traditional EDR agents to deploy new versions of the \"Brickstorm\" backdoor...."
  },
  {
    "title": "Urgent: Cisco ASA Zero-Day Duo Under Attack; CISA Triggers Emergency Mitigation Directive",
    "link": "https://thehackernews.com/2025/09/urgent-cisco-asa-zero-day-duo-under.html",
    "date": "2025-09-25T18:17:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco is urging customers to patch two security flaws impacting the VPN web server of Cisco Secure Firewall Adaptive Security Appliance (ASA) Software and Cisco Secure Firewall Threat Defense (FTD) So..."
  },
  {
    "title": "Salesforce AI Agents Forced to Leak Sensitive Data",
    "link": "https://www.darkreading.com/vulnerabilities-threats/salesforce-ai-agents-leak-sensitive-data",
    "date": "2025-09-25T18:04:41.000Z",
    "source": "Dark Reading",
    "summary": "Yet again researchers have uncovered an opportunity (dubbed \"ForcedLeak\" for indirect prompt injection against autonomous agents lacking sufficient security controls — but this time the risk involves ..."
  }
]