[
  {
    "title": "Copilot on Windows can now connect to email, create Office docs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/copilot-on-windows-can-now-connect-to-email-create-office-docs/",
    "date": "2025-10-10T14:49:09.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has upgraded its AI-powered Copilot digital assistant to connect to email accounts and generate Office documents from prompt outputs. [...]..."
  },
  {
    "title": "Deepfake Awareness High at Orgs, But Cyber Defenses Badly Lag",
    "link": "https://www.darkreading.com/cybersecurity-operations/deepfake-awareness-high-cyber-defenses-lag",
    "date": "2025-10-10T14:30:00.000Z",
    "source": "Dark Reading",
    "summary": "The vast majority of organizations are encountering AI-augmented threats, but remain confident in their defenses, despite inadequate detection investment and more than half falling to successful attac..."
  },
  {
    "title": "Stealit Malware Abuses Node.js Single Executable Feature via Game and VPN Installers",
    "link": "https://thehackernews.com/2025/10/stealit-malware-abuses-nodejs-single.html",
    "date": "2025-10-10T14:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of an active malware campaign called Stealit that has leveraged Node.js' Single Executable Application (SEA) feature as a way to distribute its payload..."
  },
  {
    "title": "From Lab to Leadership: How VMware Certification Transformed My Career",
    "link": "https://www.bleepingcomputer.com/news/security/from-lab-to-leadership-how-vmware-certification-transformed-my-career/",
    "date": "2025-10-10T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "From lab work to leadership — VMware certification can transform your IT career. Learn from VMware User Group (VMUG) how the VMUG Advantage can help you build real skills, gain confidence, and join a ..."
  },
  {
    "title": "Commentary Section Launches New, More Opinionated Era",
    "link": "https://www.darkreading.com/cybersecurity-analytics/commentary-section-launches-new-more-opinionated-era",
    "date": "2025-10-10T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading is looking for leading industry experts with a point of view they want to share with the rest of the cybersecurity community for our new Commentary section...."
  },
  {
    "title": "Microsoft Warns of ‘Payroll Pirates’ Hijacking HR SaaS Accounts to Steal Employee Salaries",
    "link": "https://thehackernews.com/2025/10/microsoft-warns-of-payroll-pirates.html",
    "date": "2025-10-10T13:31:00.000Z",
    "source": "The Hacker News",
    "summary": "A threat actor known as Storm-2657 has been observed hijacking employee accounts with the end goal of diverting salary payments to attacker-controlled accounts.\n\"Storm-2657 is actively targeting a ran..."
  },
  {
    "title": "From Detection to Patch: Fortra Reveals Full Timeline of CVE-2025-10035 Exploitation",
    "link": "https://thehackernews.com/2025/10/from-detection-to-patch-fortra-reveals.html",
    "date": "2025-10-10T11:42:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortra on Thursday revealed the results of its investigation into CVE-2025-10035, a critical security flaw in GoAnywhere Managed File Transfer (MFT) that's assessed to have come under active exploitat..."
  },
  {
    "title": "The AI SOC Stack of 2026: What Sets Top-Tier Platforms Apart?",
    "link": "https://thehackernews.com/2025/10/the-ai-soc-stack-of-2026-what-sets-top.html",
    "date": "2025-10-10T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "The SOC of 2026 will no longer be a human-only battlefield. As organizations scale and threats evolve in sophistication and velocity, a new generation of AI-powered agents is reshaping how Security Op..."
  },
  {
    "title": "175 Malicious npm Packages with 26,000 Downloads Used in Credential Phishing Campaign",
    "link": "https://thehackernews.com/2025/10/175-malicious-npm-packages-with-26000.html",
    "date": "2025-10-10T10:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have flagged a new set of 175 malicious packages on the npm registry that have been used to facilitate credential harvesting attacks as part of an unusual campaign.\nThe packa..."
  },
  {
    "title": "From LFI to RCE: Active Exploitation Detected in Gladinet and TrioFox Vulnerability",
    "link": "https://thehackernews.com/2025/10/from-lfi-to-rce-active-exploitation.html",
    "date": "2025-10-10T09:34:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity company Huntress said it has observed active in-the-wild exploitation of an unpatched security flaw impacting Gladinet CentreStack and TrioFox products.\nThe zero-day vulnerability, track..."
  },
  {
    "title": "FBI takes down BreachForums portal used for Salesforce extortion",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-takes-down-breachforums-portal-used-for-salesforce-extortion/",
    "date": "2025-10-10T08:24:16.000Z",
    "source": "Bleeping Computer",
    "summary": "The FBI has seized last night all domains for the BreachForums hacking forum operated by the ShinyHunters group mostly as a portal for leaking corporate data stolen in attacks from ransomware and exto..."
  },
  {
    "title": "CL0P-Linked Hackers Breach Dozens of Organizations Through Oracle Software Flaw",
    "link": "https://thehackernews.com/2025/10/cl0p-linked-hackers-breach-dozens-of.html",
    "date": "2025-10-10T06:41:00.000Z",
    "source": "The Hacker News",
    "summary": "Dozens of organizations may have been impacted following the zero-day exploitation of a security flaw in Oracle's E-Business Suite (EBS) software since August 9, 2025, Google Threat Intelligence Group..."
  },
  {
    "title": "New Android spyware ClayRat imitates WhatsApp, TikTok, YouTube",
    "link": "https://www.bleepingcomputer.com/news/security/new-android-spyware-clayrat-imitates-whatsapp-tiktok-youtube/",
    "date": "2025-10-09T21:06:31.000Z",
    "source": "Bleeping Computer",
    "summary": "A new Android spyware called ClayRat is luring potential victims by posing as popular apps and services like WhatsApp, Google Photos, TikTok, and YouTube. [...]..."
  },
  {
    "title": "GitHub Copilot 'CamoLeak' AI Attack Exfiltrates Data",
    "link": "https://www.darkreading.com/application-security/github-copilot-camoleak-ai-attack-exfils-data",
    "date": "2025-10-09T19:56:30.000Z",
    "source": "Dark Reading",
    "summary": "While GitHub has advanced protections for its built-in AI agent, a researcher came up with a creative proof-of-concept (PoC) attack for exfiltrating code and secrets via Copilot...."
  },
  {
    "title": "Microsoft: Hackers target universities in “payroll pirate” attacks",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-target-university-hr-employees-in-payroll-pirate-attacks/",
    "date": "2025-10-09T19:38:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A cybercrime gang tracked as Storm-2657 has been targeting university employees in the United States to hijack salary payments in \"pirate payroll\" attacks since March 2025. [...]..."
  },
  {
    "title": "Hackers now use Velociraptor DFIR tool in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-now-use-velociraptor-dfir-tool-in-ransomware-attacks/",
    "date": "2025-10-09T19:31:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors have started to use the Velociraptor digital forensics and incident response (DFIR) tool in attacks that deploy LockBit and Babuk ransomware. [...]..."
  },
  {
    "title": "SonicWall: 100% of Firewall Backups Possibly Breached",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/sonicwall-100-firewall-backups-breached",
    "date": "2025-10-09T19:10:13.000Z",
    "source": "Dark Reading",
    "summary": "SonicWall said a breach it disclosed last month affected firewall configuration files for all customers who have used SonicWall’s cloud backup service — up from its previous 5% estimate...."
  },
  {
    "title": "Microsoft Defender mistakenly flags SQL Server as end-of-life",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-defender-mistakenly-flags-sql-server-as-end-of-life/",
    "date": "2025-10-09T18:09:26.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft is working to resolve a known issue that causes its Defender for Endpoint enterprise endpoint security platform to incorrectly tag SQL Server software as end-of-life. [...]..."
  },
  {
    "title": "From HealthKick to GOVERSHELL: The Evolution of UTA0388's Espionage Malware",
    "link": "https://thehackernews.com/2025/10/from-healthkick-to-govershell-evolution.html",
    "date": "2025-10-09T17:19:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-aligned threat actor codenamed UTA0388 has been attributed to a series of spear-phishing campaigns targeting North America, Asia, and Europe that are designed to deliver a Go-based implant kno..."
  },
  {
    "title": "RondoDox botnet targets 56 n-day flaws in worldwide attacks",
    "link": "https://www.bleepingcomputer.com/news/security/rondodox-botnet-targets-56-n-day-flaws-in-worldwide-attacks/",
    "date": "2025-10-09T17:17:28.000Z",
    "source": "Bleeping Computer",
    "summary": "A new large-scale botnet called RondoDox is targeting 56 vulnerabilities in more than 30 distinct devices, including flaws first disclosed during Pwn2Own hacking competitions. [...]..."
  },
  {
    "title": "Fastly CISO: Using Major Incidents as Career Catalysts",
    "link": "https://www.darkreading.com/cybersecurity-operations/fastly-ciso-major-incidents-career-catalysts",
    "date": "2025-10-09T15:33:49.000Z",
    "source": "Dark Reading",
    "summary": "Marshall Erwin shares how crisis leadership shaped his path from CIA analyst to the US Congress to protecting global Web traffic at Fastly...."
  },
  {
    "title": "New ClayRat Spyware Targets Android Users via Fake WhatsApp and TikTok Apps",
    "link": "https://thehackernews.com/2025/10/new-clayrat-spyware-targets-android.html",
    "date": "2025-10-09T15:30:00.000Z",
    "source": "The Hacker News",
    "summary": "A rapidly evolving Android spyware campaign called ClayRat has targeted users in Russia using a mix of Telegram channels and lookalike phishing websites by impersonating popular apps like WhatsApp, Go..."
  },
  {
    "title": "Microsoft: Windows Backup now available for enterprise users",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-backup-now-available-for-enterprise-users/",
    "date": "2025-10-09T14:56:57.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced this week the general availability of Windows Backup for Organizations, a new enterprise-grade backup tool that helps simplify backups and makes the transition to Windows 11 easier..."
  },
  {
    "title": "SonicWall: Firewall configs stolen for all cloud backup customers",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-firewall-configs-stolen-for-all-cloud-backup-customers/",
    "date": "2025-10-09T14:13:04.000Z",
    "source": "Bleeping Computer",
    "summary": "SonicWall has confirmed that all customers that used the company's cloud backup service are affected by the security breach last month. [...]..."
  },
  {
    "title": "From infostealer to full RAT: dissecting the PureRAT attack chain",
    "link": "https://www.bleepingcomputer.com/news/security/from-infostealer-to-full-rat-dissecting-the-purerat-attack-chain/",
    "date": "2025-10-09T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Researchers map a campaign that escalated from a Python infostealer to a full PureRAT backdoor — loaders, evasions, and TLS-pinned C2. Join Huntress Labs' Tradecraft Tuesday for deep technical walkthr..."
  },
  {
    "title": "Take Note: Cyber-Risks With AI Notetakers",
    "link": "https://www.darkreading.com/cyber-risk/take-note-cyber-risks-with-ai-notetakers",
    "date": "2025-10-09T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Transcription applications are joining your online meetings. Here's how to create policies for ensuring compliance and security of your information...."
  },
  {
    "title": "Hackers Access SonicWall Cloud Firewall Backups, Spark Urgent Security Checks",
    "link": "https://thehackernews.com/2025/10/hackers-access-sonicwall-cloud-firewall.html",
    "date": "2025-10-09T13:48:00.000Z",
    "source": "The Hacker News",
    "summary": "SonicWall on Wednesday disclosed that an unauthorized party accessed firewall configuration backup files for all customers who have used the cloud backup service.\n\"The files contain encrypted credenti..."
  },
  {
    "title": "Azure outage blocks access to Microsoft 365 services, admin portals",
    "link": "https://www.bleepingcomputer.com/news/microsoft/azure-outage-blocks-access-to-microsoft-365-services-admin-portals/",
    "date": "2025-10-09T12:38:27.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is working to resolve an outage affecting its Azure Front Door content delivery network (CDN), which is preventing customers from accessing some Microsoft 365 services. [...]..."
  },
  {
    "title": "ThreatsDay Bulletin: MS Teams Hack, MFA Hijacking, $2B Crypto Heist, Apple Siri Probe & More",
    "link": "https://thehackernews.com/2025/10/threatsday-bulletin-ms-teams-hack-mfa.html",
    "date": "2025-10-09T12:16:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyber threats are evolving faster than ever. Attackers now combine social engineering, AI-driven manipulation, and cloud exploitation to breach targets once considered secure. From communication platf..."
  },
  {
    "title": "SaaS Breaches Start with Tokens - What Security Teams Must Watch",
    "link": "https://thehackernews.com/2025/10/saas-breaches-start-with-tokens-what.html",
    "date": "2025-10-09T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Token theft is a leading cause of SaaS breaches. Discover why OAuth and API tokens are often overlooked and how security teams can strengthen token hygiene to prevent attacks.\nMost companies in 2025 r..."
  }
]