[
  {
    "title": "Hackers Leverage Microsoft Teams to Spread Matanbuchus 3.0 Malware to Targeted Firms",
    "link": "https://thehackernews.com/2025/07/hackers-leverage-microsoft-teams-to.html",
    "date": "2025-07-16T17:48:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have flagged a new variant of a known malware loader called Matanbuchus that packs in significant features to enhance its stealth and evade detection.\nMatanbuchus is the name..."
  },
  {
    "title": "Cognida.ai Launches Codien: An AI Agent to Modernize Legacy Test Automation and Fast-Track Test Creation",
    "link": "https://www.darkreading.com/application-security/cognida-ai-launches-codien",
    "date": "2025-07-16T17:34:00.000Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Fully Patched SonicWall Gear Under Likely Zero-Day Attack",
    "link": "https://www.darkreading.com/remote-workforce/fully-patched-sonicwall-gear-zero-day-attack",
    "date": "2025-07-16T17:33:46.000Z",
    "source": "Dark Reading",
    "summary": "A threat actor with likely links to the Abyss ransomware group is leveraging an apparent zero-day vulnerability to deploy the \"Overstep\" backdoor on fully up-to-date appliances...."
  },
  {
    "title": "6 ways to protect your passport and other travel docs from cybercriminals - before it's too late",
    "link": "https://www.zdnet.com/article/6-ways-to-protect-your-passport-and-other-travel-docs-from-cybercriminals-before-its-too-late/",
    "date": "2025-07-16T17:07:41.000Z",
    "source": "ZDNet Security",
    "summary": "Electronic copies of travel documents are hot commodities on the dark web. Here's how to safeguard yours...."
  },
  {
    "title": "Cloudflare says 1.1.1.1 outage not caused by attack or BGP hijack",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-says-1111-outage-not-caused-by-attack-or-bgp-hijack/",
    "date": "2025-07-16T16:49:29.000Z",
    "source": "Bleeping Computer",
    "summary": "To quash speculation of a cyberattack or BGP hijack incident causing the recent 1.1.1.1 Resolver service outage, Cloudflare explains in a post mortem that the incident was caused by an internal miscon..."
  },
  {
    "title": "How to turn off Gemini in your Gmail, Docs, Photos, and more - it's easy to opt out",
    "link": "https://www.zdnet.com/article/how-to-turn-off-gemini-in-your-gmail-docs-photos-and-more-its-easy-to-opt-out/",
    "date": "2025-07-16T16:06:56.000Z",
    "source": "ZDNet Security",
    "summary": "It's a little hidden, but there is a way to remove Gemini from your favorite Google services...."
  },
  {
    "title": "SonicWall SMA devices hacked with OVERSTEP rootkit tied to ransomware",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-sma-devices-hacked-with-overstep-rootkit-tied-to-ransomware/",
    "date": "2025-07-16T15:33:15.000Z",
    "source": "Bleeping Computer",
    "summary": "A threat actor has been deploying a previously unseen malware called OVERSTEP that modifies the boot process of fully-patched but no longer supported SonicWall Secure Mobile Access appliances. [...]..."
  },
  {
    "title": "New Fortinet FortiWeb hacks likely linked to public RCE exploits",
    "link": "https://www.bleepingcomputer.com/news/security/new-fortinet-fortiweb-hacks-likely-linked-to-public-rce-exploits/",
    "date": "2025-07-16T14:58:52.000Z",
    "source": "Bleeping Computer",
    "summary": "Multiple Fortinet FortiWeb instances recently infected with web shells are believed to have been compromised using public exploits for a recently patched remote code execution (RCE) flaw tracked as CV..."
  },
  {
    "title": "The best free VPNs of 2025: Secure, safe, and fast VPNs",
    "link": "https://www.zdnet.com/article/best-free-vpn/",
    "date": "2025-07-16T14:32:00.000Z",
    "source": "ZDNet Security",
    "summary": "I tested and ranked the best free VPNs that offer secure services without selling off your browsing data...."
  },
  {
    "title": "Europol disrupts pro-Russian NoName057(16) DDoS hacktivist group",
    "link": "https://www.bleepingcomputer.com/news/security/europol-disrupts-pro-russian-noname05716-ddos-hacktivist-group/",
    "date": "2025-07-16T14:07:30.000Z",
    "source": "Bleeping Computer",
    "summary": "An international law enforcement operation dubbed \"Operation Eastwood\" has targeted the infrastructure of the pro-Russian hacktivist group NoName057(16), responsible for distributed denial-of-service ..."
  },
  {
    "title": "UNC6148 Backdoors Fully-Patched SonicWall SMA 100 Series Devices with OVERSTEP Rootkit",
    "link": "https://thehackernews.com/2025/07/unc6148-backdoors-fully-patched.html",
    "date": "2025-07-16T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A threat activity cluster has been observed targeting fully-patched end-of-life SonicWall Secure Mobile Access (SMA) 100 series appliances as part of a campaign designed to drop a backdoor called OVER..."
  },
  {
    "title": "Securing the Budget: Demonstrating Cybersecurity's Return",
    "link": "https://www.darkreading.com/vulnerabilities-threats/securing-budget-cybersecurity-return",
    "date": "2025-07-16T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "By tying security investments to measurable outcomes — like reduced breach likelihood and financial impact — CISOs can align internal stakeholders and justify spending based on real-world risk...."
  },
  {
    "title": "Critical Golden dMSA Attack in Windows Server 2025 Enables Cross-Domain Attacks and Persistent Access",
    "link": "https://thehackernews.com/2025/07/critical-golden-dmsa-attack-in-windows.html",
    "date": "2025-07-16T11:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed what they say is a \"critical design flaw\" in delegated Managed Service Accounts (dMSAs) introduced in Windows Server 2025.\n\"The flaw can result in high-impact ..."
  },
  {
    "title": "AI Agents Act Like Employees With Root Access—Here's How to Regain Control",
    "link": "https://thehackernews.com/2025/07/ai-agents-act-like-employees-with-root.html",
    "date": "2025-07-16T11:25:00.000Z",
    "source": "The Hacker News",
    "summary": "The AI gold rush is on. But without identity-first security, every deployment becomes an open door. Most organizations secure native AI like a web app, but it behaves more like a junior employee with ..."
  },
  {
    "title": "Grok 4 benchmark results: Tops math, ranks second in coding",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/grok-4-benchmark-results-tops-math-ranks-second-in-coding/",
    "date": "2025-07-16T10:35:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Grok 4 is a huge leap from Grok 3, but how good is it compared to other models in the market, such as Gemini 2.5 Pro? We now have answers, thanks to new independent benchmarks. [...]..."
  },
  {
    "title": "Google fixes actively exploited sandbox escape zero day in Chrome",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-actively-exploited-sandbox-escape-zero-day-in-chrome/",
    "date": "2025-07-16T09:47:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has released a security update for Chrome to address half a dozen vulnerabilities, one of them actively exploited by attackers to escape the browser's sandbox protection. [...]..."
  },
  {
    "title": "New Konfety Malware Variant Evades Detection by Manipulating APKs and Dynamic Code",
    "link": "https://thehackernews.com/2025/07/new-konfety-malware-variant-evades.html",
    "date": "2025-07-16T09:13:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new, sophisticated variant of a known Android malware referred to as Konfety that leverages the evil twin technique to enable ad fraud.\nThe sneaky approach ..."
  },
  {
    "title": "Deepfakes. Fake Recruiters. Cloned CFOs — Learn How to Stop AI-Driven Attacks in Real Time",
    "link": "https://thehackernews.com/2025/07/deepfakes-fake-recruiters-cloned-cfos.html",
    "date": "2025-07-16T09:13:00.000Z",
    "source": "The Hacker News",
    "summary": "Social engineering attacks have entered a new era—and they’re coming fast, smart, and deeply personalized.\nIt’s no longer just suspicious emails in your spam folder. Today’s attackers use generative A..."
  },
  {
    "title": "Urgent: Google Releases Critical Chrome Update for CVE-2025-6558 Exploit Active in the Wild",
    "link": "https://thehackernews.com/2025/07/urgent-google-releases-critical-chrome.html",
    "date": "2025-07-16T09:13:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Tuesday rolled out fixes for six security issues in its Chrome web browser, including one that it said has been exploited in the wild.\nThe high-severity vulnerability in question is CVE-2025..."
  },
  {
    "title": "Google AI \"Big Sleep\" Stops Exploitation of Critical SQLite Vulnerability Before Hackers Act",
    "link": "https://thehackernews.com/2025/07/google-ai-big-sleep-stops-exploitation.html",
    "date": "2025-07-16T07:44:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Tuesday revealed that its large language model (LLM)-assisted vulnerability discovery framework discovered a security flaw in the SQLite open-source database engine before it could have been..."
  },
  {
    "title": "Altered Telegram App Steals Chinese Users' Android Data",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/telegram-app-chinese-users-android-data",
    "date": "2025-07-16T01:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Using more than 600 domains, attackers entice Chinese-speaking victims to download a vulnerable Telegram app that is nearly undetectable on older versions of Android...."
  },
  {
    "title": "Lessons Learned From McDonald's Big AI Flub",
    "link": "https://www.darkreading.com/application-security/lessons-learned-mcdonalds-ai-flub",
    "date": "2025-07-15T20:24:38.000Z",
    "source": "Dark Reading",
    "summary": "McDonald's hiring platform was using its original default credentials and inadvertently exposed information belonging to possibly millions of job applicants...."
  },
  {
    "title": "AI Is Reshaping How Attorneys Practice Law",
    "link": "https://www.darkreading.com/cyber-risk/ai-is-reshaping-how-attorneys-practice-law",
    "date": "2025-07-15T20:14:13.000Z",
    "source": "Dark Reading",
    "summary": "Experts recommend enhanced AI literacy, training around the ethics of using AI, and verification protocols to maintain credibility in an increasingly AI-influenced courtroom...."
  },
  {
    "title": "OpenAI's image model gets built-in style feature on ChatGPT",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-image-model-gets-built-in-style-feature-on-chatgpt/",
    "date": "2025-07-15T20:12:59.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI's image gen model, which is available via ChatGPT for free, now lets you easily create AI images even if you're not familiar with trends or prompt engineering. [...]..."
  },
  {
    "title": "Abacus dark web drug market goes offline in suspected exit scam",
    "link": "https://www.bleepingcomputer.com/news/security/abacus-dark-web-drug-market-goes-offline-in-suspected-exit-scam/",
    "date": "2025-07-15T19:58:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Abacus Market, the largest Western darknet marketplace supporting Bitcoin payments, has shut down its public infrastructure in a move suspected to be an exit scam. [...]..."
  },
  {
    "title": "AsyncRAT Spawns Concerning Labyrinth of Forks",
    "link": "https://www.darkreading.com/remote-workforce/async-rat-labyrinth-forks",
    "date": "2025-07-15T19:40:18.000Z",
    "source": "Dark Reading",
    "summary": "Since surfacing on GitHub in 2019, AsyncRAT has become a poster child for how open source malware can democratize cybercrime, with a mazelike footprint of variants available across the spectrum of fun..."
  },
  {
    "title": "Windows KB5064489 emergency update fixes Azure VM launch issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-kb5064489-emergency-update-fixes-azure-vm-launch-issues/",
    "date": "2025-07-15T18:47:07.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released an emergency update to fix a bug that prevents Azure virtual machines from launching when the Trusted Launch setting is disabled and Virtualization-Based Security (VBS) is enabl..."
  },
  {
    "title": "North Korean XORIndex malware hidden in 67 malicious npm packages",
    "link": "https://www.bleepingcomputer.com/news/security/north-korean-xorindex-malware-hidden-in-67-malicious-npm-packages/",
    "date": "2025-07-15T17:47:09.000Z",
    "source": "Bleeping Computer",
    "summary": "North Korean threat actors planted 67 malicious packages in the Node Package Manager (npm) online repository to deliver a new malware loader called XORIndex to developer systems. [...]..."
  },
  {
    "title": "Police disrupt “Diskstation” ransomware gang attacking NAS devices",
    "link": "https://www.bleepingcomputer.com/news/security/police-disrupt-diskstation-ransomware-gang-attacking-nas-devices/",
    "date": "2025-07-15T16:53:08.000Z",
    "source": "Bleeping Computer",
    "summary": "An international law enforcement action dismantled a Romanian ransomware gang known as 'Diskstation,' which encrypted the systems of several companies in the Lombardy region, paralyzing their business..."
  },
  {
    "title": "Attackers Abuse AWS Cloud to Target Southeast Asian Governments",
    "link": "https://www.darkreading.com/cloud-security/attackers-abuse-aws-southeast-asian-governments-novel-rat",
    "date": "2025-07-15T16:48:24.000Z",
    "source": "Dark Reading",
    "summary": "The intelligence-gathering cyber campaign introduces the novel HazyBeacon backdoor and uses legitimate cloud communication channels for command-and-control (C2) and exfiltration to hide its malicious ..."
  }
]