[
  {
    "title": "ServiceNow Flaw CVE-2025-3648 Could Lead to Data Exposure via Misconfigured ACLs",
    "link": "https://thehackernews.com/2025/07/servicenow-flaw-cve-2025-3648-could.html",
    "date": "2025-07-10T07:24:00.000Z",
    "source": "The Hacker News",
    "summary": "A high-severity security flaw has been disclosed in ServiceNow's platform that, if successfully exploited, could result in data exposure and exfiltration.\nThe vulnerability, tracked as CVE-2025-3648 (..."
  },
  {
    "title": "How passkeys work: Do your favorite sites even support passkeys?",
    "link": "https://www.zdnet.com/article/how-passkeys-work-do-your-favorite-sites-even-support-passkeys/",
    "date": "2025-07-10T02:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "Join us on a typical passkey journey from discovery to registration to authentication to deletion...."
  },
  {
    "title": "North American APT Uses Exchange Zero-Day to Attack China",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/north-american-apt-exchange-zero-day-attacks-china",
    "date": "2025-07-10T01:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Stories about Chinese APTs attacking the US and Canada are plentiful. In a turnabout, researchers found what they believe is a North American entity attacking a Chinese entity, thanks to a mysterious ..."
  },
  {
    "title": "Microsoft Authenticator on iOS moves backups fully to iCloud",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-authenticator-on-ios-moves-backups-fully-to-icloud/",
    "date": "2025-07-09T22:37:27.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is rolling out a new backup system in September for its Authenticator app on iOS, removing the requirement to use a Microsoft personal account to back up TOTP secrets and account names. [......"
  },
  {
    "title": "Microsoft confirms Windows Server Update Services (WSUS) sync is broken",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-windows-server-update-services-wsus-sync-is-broken/",
    "date": "2025-07-09T20:58:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed a widespread issue in Windows Server Update Services (WSUS) that prevents organizations from syncing with Microsoft Update and deploying the latest Windows updates. [...]..."
  },
  {
    "title": "Qantas confirms data breach impacts 5.7 million customers",
    "link": "https://www.bleepingcomputer.com/news/security/qantas-confirms-data-breach-impacts-57-million-customers/",
    "date": "2025-07-09T20:14:28.000Z",
    "source": "Bleeping Computer",
    "summary": "Australian airline Qantas has confirmed that 5.7 million people have been impacted by a recent data breach, in which threat actors stole customers' data. [...]..."
  },
  {
    "title": "Google reveals details on Android’s Advanced Protection for Chrome",
    "link": "https://www.bleepingcomputer.com/news/security/google-reveals-details-on-androids-advanced-protection-for-chrome/",
    "date": "2025-07-09T19:31:41.000Z",
    "source": "Bleeping Computer",
    "summary": "Google is sharing more information on how Chrome operates when Android mobile users enable Advanced Protection, highlighting strong security improvements. [...]..."
  },
  {
    "title": "An NVIDIA Container Bug &amp; Chance to Harden Kubernetes",
    "link": "https://www.darkreading.com/cloud-security/nvidia-container-bug-harden-kubernetes",
    "date": "2025-07-09T19:07:39.000Z",
    "source": "Dark Reading",
    "summary": "A container escape flaw involving the NVIDIA Container Toolkit could have enabled a threat actor to access AI datasets across tenants...."
  },
  {
    "title": "New AI Malware PoC Reliably Evades Microsoft Defender",
    "link": "https://www.darkreading.com/endpoint-security/ai-malware-poc-evades-microsoft-defender",
    "date": "2025-07-09T18:40:03.000Z",
    "source": "Dark Reading",
    "summary": "Worried about hackers employing LLMs to write powerful malware? Using targeted reinforcement learning (RL) to train open source models in specific tasks has yielded the capability to do just that...."
  },
  {
    "title": "Someone used AI to impersonate a secretary of state - how to make sure you're not next",
    "link": "https://www.zdnet.com/article/someone-used-ai-to-impersonate-a-secretary-of-state-how-to-make-sure-youre-not-next/",
    "date": "2025-07-09T18:27:00.000Z",
    "source": "ZDNet Security",
    "summary": "An identity protection expert shares tips on protecting yourself from AI scams...."
  },
  {
    "title": "Bitcoin Depot breach exposes data of nearly 27,000 crypto users",
    "link": "https://www.bleepingcomputer.com/news/security/bitcoin-depot-breach-exposes-data-of-nearly-27-000-crypto-users/",
    "date": "2025-07-09T17:33:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Bitcoin Depot, an operator of Bitcoin ATMs, is notifying customers of a data breach incident that has exposed their sensitive information. [...]..."
  },
  {
    "title": "Gold Melody IAB Exploits Exposed ASP.NET Machine Keys for Unauthorized Access to Targets",
    "link": "https://thehackernews.com/2025/07/gold-melody-iab-exploits-exposed-aspnet.html",
    "date": "2025-07-09T16:26:00.000Z",
    "source": "The Hacker News",
    "summary": "The Initial Access Broker (IAB) known as Gold Melody has been attributed to a campaign that exploits leaked ASP.NET machine keys to obtain unauthorized access to organizations and peddle that access t..."
  },
  {
    "title": "This open-source bot blocker shields your site from pesky AI scrapers - here's how",
    "link": "https://www.zdnet.com/article/this-open-source-bot-blocker-shields-your-site-from-pesky-ai-scrapers-heres-how/",
    "date": "2025-07-09T16:15:08.000Z",
    "source": "ZDNet Security",
    "summary": "Fed up with AI companies scraping your site's content? Meet Anubis, the self-hosted, proof-of-work firewall that's stopping AI bots in their tracks...."
  },
  {
    "title": "Ruckus Networks leaves severe flaws unpatched in management devices",
    "link": "https://www.bleepingcomputer.com/news/security/ruckus-networks-leaves-severe-flaws-unpatched-in-management-devices/",
    "date": "2025-07-09T15:42:07.000Z",
    "source": "Bleeping Computer",
    "summary": "Multiple vulnerabilities that remain unpatched in Ruckus Wireless management products could be exploited to fully compromise the network environment they serve. [...]..."
  },
  {
    "title": "Ingram Micro starts restoring systems after ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/ingram-micro-starts-restoring-systems-after-ransomware-attack/",
    "date": "2025-07-09T15:13:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Ingram Micro has begun restoring systems and business services after suffering a massive SafePay ransomware attack right before the July 4th holiday. [...]..."
  },
  {
    "title": "Rubio Impersonator Signals Growing Security Threat From Deepfakes",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/rubio-impersonator-growing-security-threat-deepfakes",
    "date": "2025-07-09T15:13:21.000Z",
    "source": "Dark Reading",
    "summary": "An impostor who posed as the secretary of state in text and voice communications with diplomats and politicians demonstrates the increased sophistication of and national security threat posed by the A..."
  },
  {
    "title": "Treasury sanctions North Korean over IT worker malware scheme",
    "link": "https://www.bleepingcomputer.com/news/legal/treasury-sanctions-north-korean-over-it-worker-malware-scheme/",
    "date": "2025-07-09T14:43:11.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Department of the Treasury sanctioned cyber actor Song Kum Hyok for his association with North Korea's hacking group Andariel and for facilitating IT worker schemes that generated revenue for..."
  },
  {
    "title": "The MFA You Trust Is Lying to You – and Here's How Attackers Exploit It",
    "link": "https://www.bleepingcomputer.com/news/security/the-mfa-you-trust-is-lying-to-you-and-heres-how-attackers-exploit-it/",
    "date": "2025-07-09T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "MFA Authenticator apps aren't cutting it anymore. Attackers are bypassing legacy MFA with fake sites and real-time phishing. Token Ring and BioStick stop them cold—with fingerprint-bound hardware. Lea..."
  },
  {
    "title": "Know Your Enemy: Understanding Dark Market Dynamics",
    "link": "https://www.darkreading.com/vulnerabilities-threats/understanding-dark-market-dynamics",
    "date": "2025-07-09T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "To help counter crime, today's organizations require a cyber-defense strategy that incorporates the mindset of the cybercriminal...."
  },
  {
    "title": "DoNot APT Expands Operations, Targets European Foreign Ministries with LoptikMod Malware",
    "link": "https://thehackernews.com/2025/07/donot-apt-expands-operations-targets.html",
    "date": "2025-07-09T13:28:00.000Z",
    "source": "The Hacker News",
    "summary": "A threat actor with suspected ties to India has been observed targeting a European foreign affairs ministry with malware capable of harvesting sensitive data from compromised hosts.\nThe activity has b..."
  },
  {
    "title": "SatanLock Next in Line for Ransomware Group Shutdowns",
    "link": "https://www.darkreading.com/threat-intelligence/satanlock-ransomware-group-shutdowns",
    "date": "2025-07-09T13:15:05.000Z",
    "source": "Dark Reading",
    "summary": "Though the victims list on its site has since been taken down, the group plans on leaking the rest of the files stolen from its victims...."
  },
  {
    "title": "New ServiceNow flaw lets attackers enumerate restricted data",
    "link": "https://www.bleepingcomputer.com/news/security/new-servicenow-flaw-lets-attackers-enumerate-restricted-data/",
    "date": "2025-07-09T13:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A new vulnerability in ServiceNow, dubbed Count(er) Strike, allows low-privileged users to extract sensitive data from tables to which they should not have access. [...]..."
  },
  {
    "title": "Can't quit Windows 10? Here's how to keep getting security updates after October 2025",
    "link": "https://www.zdnet.com/article/cant-quit-windows-10-heres-how-to-keep-getting-security-updates-after-october-2025/",
    "date": "2025-07-09T12:50:00.000Z",
    "source": "ZDNet Security",
    "summary": "Businesses can expect to pay a premium for Windows 10 Extended Security Updates, while educators will pay next to nothing. And for the first time, consumers can sign up, with some options that are com..."
  },
  {
    "title": "U.S. Sanctions North Korean Andariel Hacker Behind Fraudulent IT Worker Scheme",
    "link": "https://thehackernews.com/2025/07/us-sanctions-north-korean-andariel.html",
    "date": "2025-07-09T11:25:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday sanctioned a member of a North Korean hacking group called Andariel for their role in the infamous remote infor..."
  },
  {
    "title": "How To Automate Ticket Creation, Device Identification and Threat Triage With Tines",
    "link": "https://thehackernews.com/2025/07/how-to-automate-ticket-creation-device.html",
    "date": "2025-07-09T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features over 1,000 pre-built workflows shared by security practitioners from across the community - all free to impo..."
  },
  {
    "title": "Chinese Hacker Xu Zewei Arrested for Ties to Silk Typhoon Group and U.S. Cyber Attacks",
    "link": "https://thehackernews.com/2025/07/chinese-hacker-xu-zewei-arrested-for.html",
    "date": "2025-07-09T08:40:00.000Z",
    "source": "The Hacker News",
    "summary": "A Chinese national has been arrested in Milan, Italy, for his alleged links to a state-sponsored hacking group known as Silk Typhoon and for carrying out cyber attacks against American organizations a..."
  },
  {
    "title": "Microsoft Patches 130 Vulnerabilities, Including Critical Flaws in SPNEGO and SQL Server",
    "link": "https://thehackernews.com/2025/07/microsoft-patches-130-vulnerabilities.html",
    "date": "2025-07-09T07:10:00.000Z",
    "source": "The Hacker News",
    "summary": "For the first time in 2025, Microsoft's Patch Tuesday updates did not bundle fixes for exploited security vulnerabilities, but the company acknowledged one of the addressed flaws had been publicly kno..."
  },
  {
    "title": "How passkeys work: The complete guide to your inevitable passwordless future",
    "link": "https://www.zdnet.com/article/how-passkeys-work-the-complete-guide-to-your-inevitable-passwordless-future/",
    "date": "2025-07-09T02:00:14.000Z",
    "source": "ZDNet Security",
    "summary": "Why are passkeys so much safer than passwords? And how exactly does this sorcery work? We go behind the scenes of this still-evolving authentication process...."
  },
  {
    "title": "How to get free Windows 10 security updates through October 2026: Two ways",
    "link": "https://www.zdnet.com/article/how-to-get-free-windows-10-security-updates-through-october-2026-two-ways/",
    "date": "2025-07-09T01:50:00.000Z",
    "source": "ZDNet Security",
    "summary": "Don't want to fork over $30 for a one-year subscription to Windows 10 Extended Security Updates? Microsoft is offering a couple of ways to avoid the fee. But there is a catch...."
  },
  {
    "title": "South Korean Government Imposes Penalties on SK Telecom for Breach",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/south-korea-imposes-penalties-sk-telecom-breach",
    "date": "2025-07-09T01:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Following a breach at the country's top mobile provider that exposed 27 million records, the South Korean government imposed a small monetary penalty but stiff regulatory requirements...."
  }
]