[
  {
    "title": "Campaign: Financially Motivated Threat Actor Gaining Access via Drive-By Downloads of FAKEUPDATES",
    "link": "https://www.virustotal.com/gui/collection/campaign--13abb7ca-237a-5ae9-8841-ef90e2f460e5",
    "date": "2025-09-23T00:00:00.000Z",
    "source": "VirusTotal TI",
    "summary": "Date: 2025-09-23 • Beginning in December 2023, UNC2165 resumed their intrusion operations after a period of dormancy dating back to April 2023. Consistent with previous campaigns, the threat cluster leveraged UNC1543 distribution channels, involving search engine optimization (SEO) poisoning and FAKEUPDATES, to deliver the COLORFAKE.V2 in-memory dropper and MYTHIC payloads. Additional UNC2165 campaigns were observed starting in late March and continuing into April. In all but one instance, UNC1543 FAKEUPDATES infections were confirmed leading to UNC2165 activity.  In almost all cases, the actors established persistence by creating a scheduled task, which executes a Python script to establish a remote connection to a C&C. Shortly following compromise, actors used Windows built-in operating system utilities to perform network reconnaissance activities. In at least one incident, the actors were observed using RDP to move laterally and install additional payloads such as COLORFAKE.V2. In several cases, UNC2165 enumerated the local Chrome and Microsoft Edge login data alongside the encryption keys from the state files. This allows the actors to decrypt passwords stored in Chrome and Microsoft Edge. In some of the incidents, the group leveraged FAKEUPDATES to execute PowerShell commands to replace HTML body tags within victims' Outlook signatures with a link to a remote resource used to harvest NT LAN Manager (NTLM) login information. In at least one case, PowerShell commands were used to create .LNK files, which, when executed, download a remote payload via the file’s icon. While no significant follow-on activity was observed, the incidents are believed to be financially motivated based on previous UNC2165 activity.",
    "_vt_fallback_link": "https://www.virustotal.com/gui/search/campaign%3AFinancially%20Motivated%20Threat%20Actor%20Gaining%20Access%20via%20Drive-By%20Downloads%20of%20FAKEUPDATES"
  },
  {
    "title": "Campaign: Financially Motivated Threat Actor Distributes Several Payloads via Drive-By Downloads of Fake Browser Updates",
    "link": "https://www.virustotal.com/gui/collection/campaign--cea8e459-d40b-5543-ba41-ecb7996ca989",
    "date": "2025-09-18T00:00:00.000Z",
    "source": "VirusTotal TI",
    "summary": "Date: 2025-09-18 • Since April 2024, UNC5518 has been distributing FAKETREFF, a JavaScript downloader that displays a fake error message urging users to take action. UNC5518 has evolved their techniques over time, including the introduction of obfuscation, multi-stage scripts leading to FAKETREFF, and the use of the ClickFix social engineering technique. UNC5518 FAKETREFF campaigns throughout 2024 and 2025 have led to a variety of additional malware, including QUICKBIND, NETSUPPORT, BANANACOOKIE, CLEANBOOST, CORNFLAKE, DARKGATE, and VOLTMARKER. UNC5518 campaigns appear to be fairly opportunistic, impacting a wide range of industry verticals and geographic regions.",
    "_vt_fallback_link": "https://www.virustotal.com/gui/search/campaign%3AFinancially%20Motivated%20Threat%20Actor%20Distributes%20Several%20Payloads%20via%20Drive-By%20Downloads%20of%20Fake%20Browser%20Updates"
  },
  {
    "title": "Campaign: FIN6 Targeting Multiple Organizations via Legitimate Job Postings",
    "link": "https://www.virustotal.com/gui/collection/campaign--183a3a9d-fbe6-54b1-9ec7-a807687ba94c",
    "date": "2025-09-17T00:00:00.000Z",
    "source": "VirusTotal TI",
    "summary": "Date: 2025-09-17 • Mandiant has tracked an ongoing FIN6 campaign active since at least December 21, 2022 involving the use of spoofed personal websites to distribute BULLZLINK and SQUIDSLEEP payloads. FIN6 has targeted corporate recruiters using job sites including LinkedIn and Indeed, directing victims to download an archive containing a BULLZLINK downloader hosted on actor-controlled domains. Domains and the file names of BULLZLINK samples associated with this activity have both incorporated common first and last names, presumably related to the personas being used to contact their targets. Other campaign elements such as website URLs and zip file names have also been tailored in a way to suggest customization to the specific jobs roles they may be using as a pretense for engagement.\\n\\n \\n\\nHistorical FIN6 campaigns have shared numerous technical and operational overlaps with this most recent activity, and have commonly leveraged job-themed files hosted on domains that appear to be fake personal websites or fake job boards. Malicious files delivered through these sites have consistently been BULLZLINK leading to SQUIDSLEEP and SQUIDGATE.",
    "_vt_fallback_link": "https://www.virustotal.com/gui/search/campaign%3AFIN6%20Targeting%20Multiple%20Organizations%20via%20Legitimate%20Job%20Postings"
  },
  {
    "title": "[Dark Reading Virtual Event] Know Your Enemy: How cybercriminals and nation-state hackers operate",
    "link": "https://www.darkreading.com/events/-dark-reading-virtual-event-know-your-enemy-how-cybercriminals-and-nation-state-hackers-operate",
    "date": "2025-09-25T18:10:38.610Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Co-op says it lost $107 million after Scattered Spider attack",
    "link": "https://www.bleepingcomputer.com/news/security/co-op-says-it-lost-107-million-after-scattered-spider-attack/",
    "date": "2025-09-25T18:05:14.000Z",
    "source": "Bleeping Computer",
    "summary": "The Co-operative Group in the U.K. released its interim financial results report for the first half of 2025 with a massive loss in operating profit of £80 million ($107 million) due to the cyberattack..."
  },
  {
    "title": "CISA orders agencies to patch Cisco flaws exploited in zero-day attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-agencies-to-patch-cisco-flaws-exploited-in-zero-day-attacks/",
    "date": "2025-09-25T17:52:55.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA has issued a new emergency directive ordering U.S. federal agencies to secure their Cisco firewall devices against two flaws that have been exploited in zero-day attacks. [...]..."
  },
  {
    "title": "Cisco warns of ASA firewall zero-days exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-asa-firewall-zero-days-exploited-in-attacks/",
    "date": "2025-09-25T16:49:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco warned customers today to patch two zero-day vulnerabilities that are actively being exploited in attacks and impact the company's firewall software. [...]..."
  },
  {
    "title": "Amazon pays $2.5 billion to settle Prime memberships lawsuit",
    "link": "https://www.bleepingcomputer.com/news/technology/amazon-pays-25-billion-to-settle-prime-memberships-lawsuit/",
    "date": "2025-09-25T16:21:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Amazon will pay $2.5 billion to settle claims by the U.S. Federal Trade Commission (FTC) that it used dark patterns to trick millions of users into enrolling in its Prime program and made it as diffic..."
  },
  {
    "title": "Malicious Rust packages on Crates.io steal crypto wallet keys",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-rust-packages-on-cratesio-steal-crypto-wallet-keys/",
    "date": "2025-09-25T15:43:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Two malicious packages with nearly 8,500 downloads in Rust's official crate repository scanned developers' systems to steal cryptocurrency private keys and other secrets. [...]..."
  },
  {
    "title": "Salesforce Patches Critical ForcedLeak Bug Exposing CRM Data via AI Prompt Injection",
    "link": "https://thehackernews.com/2025/09/salesforce-patches-critical-forcedleak.html",
    "date": "2025-09-25T15:17:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a critical flaw impacting Salesforce Agentforce, a platform for building artificial intelligence (AI) agents, that could allow attackers to potentially exfiltr..."
  },
  {
    "title": "How secure are passkeys, really? Here's what you need to know",
    "link": "https://www.bleepingcomputer.com/news/security/how-secure-are-passkeys-really-heres-what-you-need-to-know/",
    "date": "2025-09-25T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Passwords are weak links—88% of breaches involve stolen creds. Learn more from Specops Software about how passkeys deliver phishing resistance, simpler logins & lower support costs (with some hurdles ..."
  },
  {
    "title": "How Cloud Service Disruptions Are Making Resilience Critical for Developers",
    "link": "https://www.darkreading.com/application-security/cloud-service-disruptions-make-resilience-critical-developers",
    "date": "2025-09-25T13:39:22.000Z",
    "source": "Dark Reading",
    "summary": "Outages affecting DevOps tools threaten to leave developers coding like it's 1999. How serious is the threat and what can companies do?..."
  },
  {
    "title": "North Korean Hackers Use New AkdoorTea Backdoor to Target Global Crypto Developers",
    "link": "https://thehackernews.com/2025/09/north-korean-hackers-use-new-akdoortea.html",
    "date": "2025-09-25T13:14:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korea-linked threat actors associated with the Contagious Interview campaign have been attributed to a previously undocumented backdoor called AkdoorTea, along with tools like TsunamiKit and..."
  },
  {
    "title": "Teen suspected of Vegas casino cyberattacks released to parents",
    "link": "https://www.bleepingcomputer.com/news/security/teen-suspected-of-vegas-casino-cyberattacks-released-to-parents/",
    "date": "2025-09-25T12:51:18.000Z",
    "source": "Bleeping Computer",
    "summary": "A 17-year-old hacker who surrendered to face charges over cyberattacks targeting Vegas casinos in 2023 has been released into the custody of his parents, a family court judge ruled. [...]..."
  },
  {
    "title": "Microsoft will offer free Windows 10 security updates in Europe",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-will-offer-free-windows-10-security-updates-in-europe/",
    "date": "2025-09-25T12:45:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft will offer free extended security updates for Windows 10 users in the European Economic Area (EEA), which includes Iceland, Liechtenstein, Norway, and all 27 European Union member states. [...."
  },
  {
    "title": "CTEM's Core: Prioritization and Validation",
    "link": "https://thehackernews.com/2025/09/ctems-core-prioritization-and-validation.html",
    "date": "2025-09-25T11:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Despite a coordinated investment of time, effort, planning, and resources, even the most up-to-date cybersecurity systems continue to fail. Every day. Why? \nIt’s not because security teams can't see e..."
  },
  {
    "title": "Threatsday Bulletin: Rootkit Patch, Federal Breach, OnePlus SMS Leak, TikTok Scandal & More",
    "link": "https://thehackernews.com/2025/09/threatsday-bulletin-rootkit-patch.html",
    "date": "2025-09-25T11:48:00.000Z",
    "source": "The Hacker News",
    "summary": "/* ===== Container ===== */\n.td-wrap {}\n\n/* ===== Section ===== */\n.td-section {\n}\n.td-title { margin: 16px 0 4px; font-size: 32px; line-height: 1.2; font-weight: 800; }\n.td-subtitle { margin: 0 0 24p..."
  },
  {
    "title": "Tech Overtakes Gaming as Top DDoS Attack Target, New Gcore Radar Report Finds",
    "link": "https://thehackernews.com/2025/09/tech-overtakes-gaming-as-top-ddos.html",
    "date": "2025-09-25T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "The latest Gcore Radar report analyzing attack data from Q1–Q2 2025, reveals a 41% year-on-year increase in total attack volume. The largest attack peaked at 2.2 Tbps, surpassing the 2 Tbps record in ..."
  },
  {
    "title": "Malicious Rust Crates Steal Solana and Ethereum Keys — 8,424 Downloads Confirmed",
    "link": "https://thehackernews.com/2025/09/malicious-rust-crates-steal-solana-and.html",
    "date": "2025-09-25T07:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered two malicious Rust crates impersonating a legitimate library called fast_log to steal Solana and Ethereum wallet keys from source code.\nThe crates, named fast..."
  },
  {
    "title": "Cisco Warns of Actively Exploited SNMP Vulnerability Allowing RCE or DoS in IOS Software",
    "link": "https://thehackernews.com/2025/09/cisco-warns-of-actively-exploited-snmp.html",
    "date": "2025-09-25T06:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has warned of a high-severity security flaw in IOS Software and IOS XE Software that could allow a remote attacker to execute arbitrary code or trigger a denial-of-service (DoS) condition under ..."
  },
  {
    "title": "CISA: Attackers Breach Federal Agency via Critical GeoServer Flaw",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/cisa-attackers-breach-federal-agency-critical-geoserver-flaw",
    "date": "2025-09-24T21:20:37.000Z",
    "source": "Dark Reading",
    "summary": "Threat actors exploited CVE-2024-36401 less than two weeks after it was initially disclosed and used it to gain access to a large federal civilian executive branch (FCEB) agency that uses the geospati..."
  },
  {
    "title": "The Fall of Scattered Spider? Teen Member Surrenders Amid Group's Shutdown Claims",
    "link": "https://www.darkreading.com/cybersecurity-operations/scattered-spider-surrenders-shutdown",
    "date": "2025-09-24T20:21:31.000Z",
    "source": "Dark Reading",
    "summary": "The cybercrime group continues to gain attention despite its apparent shutdown last week...."
  },
  {
    "title": "New Supermicro BMC flaws can create persistent backdoors",
    "link": "https://www.bleepingcomputer.com/news/security/new-supermicro-bmc-flaws-can-create-persistent-backdoors/",
    "date": "2025-09-24T20:13:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Two vulnerabilities affecting the firmware of Supermicro hardware, including Baseboard Management Controller (BMC) allow attackers to update systems with maliciously crafted images. [...]..."
  },
  {
    "title": "OpenAI is testing a new GPT-5-based AI agent \"GPT-Alpha\"",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-testing-a-new-gpt-5-based-ai-agent-gpt-alpha/",
    "date": "2025-09-24T20:09:25.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is internally testing a new version of its AI agent, which uses a special version of GPT-5 dubbed \"GPT-Alpha.\" [...]..."
  },
  {
    "title": "Russia Targets Moldovan Election in Disinformation Play",
    "link": "https://www.darkreading.com/cybersecurity-operations/russia-moldovan-election-disinformation",
    "date": "2025-09-24T20:01:47.000Z",
    "source": "Dark Reading",
    "summary": "Researchers have tracked a Russian disinformation campaign against upcoming Moldovan elections, linking it to a previous campaign that began in 2022...."
  },
  {
    "title": "Kali Linux 2025.3 released with 10 new tools, Wi-Fi enhancements",
    "link": "https://www.bleepingcomputer.com/news/security/kali-linux-20253-released-with-10-new-tools-wifi-enhancements/",
    "date": "2025-09-24T18:30:02.000Z",
    "source": "Bleeping Computer",
    "summary": "Kali Linux has released version 2025.3, the third version of 2025, featuring ten new tools, Nexmon support, and NetHunter improvements. [...]..."
  },
  {
    "title": "Cisco warns of IOS zero-day vulnerability exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-ios-zero-day-vulnerability-exploited-in-attacks/",
    "date": "2025-09-24T16:52:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco has released security updates to address a high-severity zero-day vulnerability in Cisco IOS and IOS XE Software that is currently being exploited in attacks. [...]..."
  },
  {
    "title": "Chinese Hackers RedNovember Target Global Governments Using Pantegana and Cobalt Strike",
    "link": "https://thehackernews.com/2025/09/chinese-hackers-rednovember-target.html",
    "date": "2025-09-24T16:36:00.000Z",
    "source": "The Hacker News",
    "summary": "A suspected cyber espionage activity cluster that was previously found targeting global government and private sector organizations spanning Africa, Asia, North America, South America, and Oceania has..."
  },
  {
    "title": "Unpatched flaw in OnePlus phones lets rogue apps text messages",
    "link": "https://www.bleepingcomputer.com/news/security/unpatched-flaw-in-oneplus-phones-lets-rogue-apps-text-messages/",
    "date": "2025-09-24T15:48:40.000Z",
    "source": "Bleeping Computer",
    "summary": "A vulnerability in multiple OnePlus OxygenOS versions allows any installed app to access SMS data and metadata without requiring permission or user interaction. [...]..."
  },
  {
    "title": "UNC5221 Uses BRICKSTORM Backdoor to Infiltrate U.S. Legal and Technology Sectors",
    "link": "https://thehackernews.com/2025/09/unc5221-uses-brickstorm-backdoor-to.html",
    "date": "2025-09-24T14:33:00.000Z",
    "source": "The Hacker News",
    "summary": "Companies in the legal services, software-as-a-service (SaaS) providers, Business Process Outsourcers (BPOs), and technology sectors in the U.S. have been targeted by a suspected China-nexus cyber esp..."
  }
]