[
  {
    "title": "Third Parties and Machine Credentials: The Silent Drivers Behind 2025's Worst Breaches",
    "link": "https://thehackernews.com/2025/05/third-parties-and-machine-credentials.html",
    "date": "2025-05-06T11:25:00.000Z",
    "source": "The Hacker News",
    "summary": "It wasn't ransomware headlines or zero-day exploits that stood out most in this year's Verizon 2025 Data Breach Investigations Report (DBIR) — it was what fueled them. Quietly, yet consistently, two u..."
  },
  {
    "title": "Microsoft Warns Default Helm Charts Could Leave Kubernetes Apps Exposed to Data Leaks",
    "link": "https://thehackernews.com/2025/05/microsoft-warns-default-helm-charts-for.html",
    "date": "2025-05-06T11:05:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has warned that using pre-made templates, such as out-of-the-box Helm charts, during Kubernetes deployments could open the door to misconfigurations and leak valuable data.\n\"While these 'plu..."
  },
  {
    "title": "Entra ID Data Protection: Essential or Overkill?",
    "link": "https://thehackernews.com/2025/05/entra-id-data-protectionessential-or.html",
    "date": "2025-05-06T10:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft Entra ID (formerly Azure Active Directory) is the backbone of modern identity management, enabling secure access to the applications, data, and services your business relies on. As hybrid wo..."
  },
  {
    "title": "Linux wiper malware hidden in malicious Go modules on GitHub",
    "link": "https://www.bleepingcomputer.com/news/security/linux-wiper-malware-hidden-in-malicious-go-modules-on-github/",
    "date": "2025-05-06T09:13:16.000Z",
    "source": "Bleeping Computer",
    "summary": "A supply-chain attack targets Linux servers with disk-wiping malware hidden in Golang modules published on GitHub. [...]..."
  },
  {
    "title": "Microsoft pushes fix for Windows 11 24H2 update failures",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-pushes-fix-for-windows-11-update-0x80240069-errors/",
    "date": "2025-05-06T08:17:40.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft has fixed a known issue preventing Windows 11 24H2 feature updates from being delivered via Windows Server Update Services (WSUS) after installing the April 2025 security updates. [...]..."
  },
  {
    "title": "Update ASAP: Google Fixes Android Flaw (CVE-2025-27363) Exploited by Attackers",
    "link": "https://thehackernews.com/2025/05/google-fixes-actively-exploited-android.html",
    "date": "2025-05-06T05:46:00.000Z",
    "source": "The Hacker News",
    "summary": "Google has released its monthly security updates for Android with fixes for 46 security flaws, including one vulnerability that it said has been exploited in the wild.\nThe vulnerability in question is..."
  },
  {
    "title": "Critical Langflow Flaw Added to CISA KEV List Amid Ongoing Exploitation Evidence",
    "link": "https://thehackernews.com/2025/05/critical-langflow-flaw-added-to-cisa.html",
    "date": "2025-05-06T04:24:00.000Z",
    "source": "The Hacker News",
    "summary": "A recently disclosed critical security flaw impacting the open-source Langflow platform has been added to the Known Exploited Vulnerabilities (KEV) catalog by the U.S. Cybersecurity and Infrastructure..."
  },
  {
    "title": "Luna Moth extortion hackers pose as IT help desks to breach US firms",
    "link": "https://www.bleepingcomputer.com/news/security/luna-moth-extortion-hackers-pose-as-it-help-desks-to-breach-us-firms/",
    "date": "2025-05-05T22:19:42.000Z",
    "source": "Bleeping Computer",
    "summary": "The data-theft extortion group known as Luna Moth, aka Silent Ransom Group, has ramped up callback phishing campaigns in attacks on legal and financial institutions in the United States. [...]..."
  },
  {
    "title": "AI Domination: RSAC 2025 Social Media Roundup",
    "link": "https://www.darkreading.com/cloud-security/ai-rsac-2025-social-media-roundup",
    "date": "2025-05-05T21:14:45.000Z",
    "source": "Dark Reading",
    "summary": "Documented in a series of social media posts, cybersecurity experts shared with Dark Reading their insights on RSAC 2025 throughout the week...."
  },
  {
    "title": "'Venom Spider' Targets Hiring Managers in Phishing Scheme",
    "link": "https://www.darkreading.com/cyber-risk/venom-spider-phishing-scheme",
    "date": "2025-05-05T21:00:20.000Z",
    "source": "Dark Reading",
    "summary": "Researchers from Arctic Wolf Labs detailed a new spear-phishing campaign that targets hiring managers and recruiters by posing as a job seeker...."
  },
  {
    "title": "New \"Bring Your Own Installer\" EDR bypass used in ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/new-bring-your-own-installer-edr-bypass-used-in-ransomware-attack/",
    "date": "2025-05-05T20:28:34.000Z",
    "source": "Bleeping Computer",
    "summary": "A new \"Bring Your Own Installer\" EDR bypass technique is exploited in attacks to bypass SentinelOne's tamper protection feature, allowing threat actors to disable endpoint detection and response (EDR)..."
  },
  {
    "title": "Ongoing Passkey Usability Challenges Require 'Problem Solving'",
    "link": "https://www.darkreading.com/identity-access-management-security/passkey-usability-challenges-require-problem-solving",
    "date": "2025-05-05T20:02:02.000Z",
    "source": "Dark Reading",
    "summary": "While passkeys offer enhanced security against phishing and credential theft, implementation hurdles, cross-platform inconsistencies, and user experience challenges pose significant barriers to widesp..."
  },
  {
    "title": "The Dark Side of Digital: Breaking The Silence on Youth Mental Health",
    "link": "https://www.darkreading.com/data-privacy/dark-side-digital-breaking-silence-youth-mental-health",
    "date": "2025-05-05T19:39:38.000Z",
    "source": "Dark Reading",
    "summary": "Industry experts at RSAC 2025 call for urgent accountability in addressing technology's negative impact on youth, highlighting concerns about internet anonymity, mental health, and the growing disconn..."
  },
  {
    "title": "Phony Hacktivist Pleads Guilty to Disney Data Leak",
    "link": "https://www.darkreading.com/threat-intelligence/phony-hacktivist-pleads-guilty-disney-leak",
    "date": "2025-05-05T19:20:14.000Z",
    "source": "Dark Reading",
    "summary": "After stealing sensitive data from Disney, Ryan Mitchell Kramer claimed to be part of a Russian hacktivist group protecting artists' rights and ensuring they receive fair compensation for their work...."
  },
  {
    "title": "Microsoft finds default Kubernetes Helm charts can expose data",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-finds-default-kubernetes-helm-charts-can-expose-data/",
    "date": "2025-05-05T19:17:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft warns about the security risks posed by default configurations in Kubernetes deployments, particularly those using out-of-the-box Helm charts, which could publicly expose sensitive data. [....."
  },
  {
    "title": "Unofficial Signal app used by Trump officials investigates hack",
    "link": "https://www.bleepingcomputer.com/news/security/unofficial-signal-app-used-by-trump-officials-investigates-hack/",
    "date": "2025-05-05T19:11:17.000Z",
    "source": "Bleeping Computer",
    "summary": "TeleMessage, an Israeli company that sells an unofficial Signal message archiving tool used by some U.S. government officials, has suspended all services after reportedly being hacked. [...]..."
  },
  {
    "title": "Darcula PhaaS steals 884,000 credit cards via phishing texts",
    "link": "https://www.bleepingcomputer.com/news/security/darcula-phaas-steals-884-000-credit-cards-via-phishing-texts/",
    "date": "2025-05-05T17:31:32.000Z",
    "source": "Bleeping Computer",
    "summary": "The Darcula phishing-as-a-service (PhaaS) platform stole 884,000 credit cards from 13 million clicks on malicious links sent via text messages to targets worldwide. [...]..."
  },
  {
    "title": "Wormable AirPlay Flaws Enable Zero-Click RCE on Apple Devices via Public Wi-Fi",
    "link": "https://thehackernews.com/2025/05/wormable-airplay-flaws-enable-zero.html",
    "date": "2025-05-05T17:06:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a series of now-patched security vulnerabilities in Apple's AirPlay protocol that, if successfully exploited, could enable an attacker to take over susceptible..."
  },
  {
    "title": "A whopping 94% of leaked passwords are not unique - will you people ever learn?",
    "link": "https://www.zdnet.com/article/a-whopping-94-of-leaked-passwords-are-not-unique-will-you-people-ever-learn/",
    "date": "2025-05-05T16:12:10.000Z",
    "source": "ZDNet Security",
    "summary": "Your lazy passwords are putting you and your company at risk...."
  },
  {
    "title": "Microsoft is killing Skype today, pushes users to Teams",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-killing-skype-today-pushes-users-to-teams/",
    "date": "2025-05-05T16:12:07.000Z",
    "source": "Bleeping Computer",
    "summary": "The Skype video call and messaging service is shutting down today, 14 years after replacing Microsoft's Windows Live Messenger. [...]..."
  },
  {
    "title": "Commvault CVE-2025-34028 Added to CISA KEV After Active Exploitation Confirmed",
    "link": "https://thehackernews.com/2025/05/commvault-cve-2025-34028-added-to-cisa.html",
    "date": "2025-05-05T16:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a maximum-severity security flaw impacting Commvault Command Center to its Known Exploited Vulnerabilities (KEV) catalog, a l..."
  },
  {
    "title": "UK shares security tips after major retail cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/uk-shares-security-tips-after-major-retail-cyberattacks/",
    "date": "2025-05-05T15:19:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Following three high-profile cyberattacks impacting major UK retailers, the country's National Cyber Security Centre (NCSC) has published guidance that all companies are advised to follow to strengthe..."
  },
  {
    "title": "How to Prevent AI Agents From Becoming the Bad Guys",
    "link": "https://www.darkreading.com/vulnerabilities-threats/prevent-ai-agents-becoming-bad-guys",
    "date": "2025-05-05T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "When designed with strong governance principles, AI can drive innovation while maintaining the people's trust and security...."
  },
  {
    "title": "10 passkey survival tips: Prepare for your passwordless future now",
    "link": "https://www.zdnet.com/article/10-passkey-survival-tips-prepare-for-your-passwordless-future-now/",
    "date": "2025-05-05T12:58:00.000Z",
    "source": "ZDNet Security",
    "summary": "Although passkeys remain an evolving ecosystem, we'd be wise to embrace tomorrow's authentication standard today. Here are ZDNET's 10 recommendations for reaching passkey paradise...."
  },
  {
    "title": "7 ways to lock down your phone's security - before it's too late",
    "link": "https://www.zdnet.com/article/7-ways-to-lock-down-your-phones-security-before-its-too-late/",
    "date": "2025-05-05T12:44:00.000Z",
    "source": "ZDNet Security",
    "summary": "From border crossings to data breaches, there are more reasons than ever to protect your smartphone. Here's a practical guide to securing your device and your digital life...."
  },
  {
    "title": "Microsoft silently fixes Start menu bug affecting Windows 10 PCs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-silently-fixes-start-menu-bug-affecting-windows-10-pcs/",
    "date": "2025-05-05T11:48:57.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has silently fixed an issue that broke Start Menu jump lists for all apps on systems running Windows 10, version 22H2. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Nation-State Hacks, Spyware Alerts, Deepfake Malware, Supply Chain Backdoors",
    "link": "https://thehackernews.com/2025/05/weekly-recap-nation-state-hacks-spyware.html",
    "date": "2025-05-05T11:29:00.000Z",
    "source": "The Hacker News",
    "summary": "What if attackers aren't breaking in—they're already inside, watching, and adapting?\nThis week showed a sharp rise in stealth tactics built for long-term access and silent control. AI is being used to..."
  },
  {
    "title": "Perfection is a Myth. Leverage Isn't: How Small Teams Can Secure Their Google Workspace",
    "link": "https://thehackernews.com/2025/05/perfection-is-myth-leverage-isnt-how.html",
    "date": "2025-05-05T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Let’s be honest: if you're one of the first (or the first) security hires at a small or midsize business, chances are you're also the unofficial CISO, SOC, IT Help Desk, and whatever additional roles ..."
  },
  {
    "title": "Microsoft: Windows 11 24H2 now ready to rollout to everyone",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-24h2-now-ready-to-rollout-to-everyone/",
    "date": "2025-05-05T10:53:38.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft announced over the weekend that the Windows 11 24H2 update is ready to roll out to all compatible PCs, excluding those with safeguard holds. [...]..."
  },
  {
    "title": "Golden Chickens Deploy TerraStealerV2 to Steal Browser Credentials and Crypto Wallet Data",
    "link": "https://thehackernews.com/2025/05/golden-chickens-deploy-terrastealerv2.html",
    "date": "2025-05-05T05:39:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actors known as Golden Chickens have been attributed to two new malware families dubbed TerraStealerV2 and TerraLogger, suggesting continued development efforts to fine-tune and diversify t..."
  }
]