[
  {
    "title": "I still prefer my Google Pixel 9 Pro over the expensive flagships - and it's not even close",
    "link": "https://www.zdnet.com/article/i-still-prefer-my-google-pixel-9-pro-over-the-expensive-flagships-and-its-not-even-close/",
    "date": "2025-07-21T06:45:13.000Z",
    "source": "ZDNet Security",
    "summary": "Google's Pixel 9 Pro is still the Android I keep coming back to for its combination of price, features, and performance...."
  },
  {
    "title": "PoisonSeed Hackers Bypass FIDO Keys Using QR Phishing and Cross-Device Sign-In Abuse",
    "link": "https://thehackernews.com/2025/07/poisonseed-hackers-bypass-fido-keys.html",
    "date": "2025-07-21T06:13:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a novel attack technique that allows threat actors to bypass Fast IDentity Online (FIDO) key protections by deceiving users into approving authentication reque..."
  },
  {
    "title": "Microsoft releases emergency patches for SharePoint RCE flaws exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-emergency-patches-for-sharepoint-rce-flaws-exploited-in-attacks/",
    "date": "2025-07-21T04:41:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released emergency SharePoint security updates for two zero-day vulnerabilities tracked as CVE-2025-53770 and CVE-2025-53771 that have compromised services worldwide in \"ToolShell\" attac..."
  },
  {
    "title": "Microsoft Releases Urgent Patch for SharePoint RCE Flaw Exploited in Ongoing Cyber Attacks",
    "link": "https://thehackernews.com/2025/07/microsoft-releases-urgent-patch-for.html",
    "date": "2025-07-21T03:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Sunday released security patches for an actively exploited security flaw in SharePoint and also disclosed details of another vulnerability that it said has been addressed with \"more robus..."
  },
  {
    "title": "Hard-Coded Credentials Found in HPE Instant On Devices Allow Admin Access",
    "link": "https://thehackernews.com/2025/07/hard-coded-credentials-found-in-hpe.html",
    "date": "2025-07-21T03:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Hewlett-Packard Enterprise (HPE) has released security updates to address a critical security flaw affecting Instant On Access Points that could allow an attacker to bypass authentication and gain adm..."
  },
  {
    "title": "3,500 Websites Hijacked to Secretly Mine Crypto Using Stealth JavaScript and WebSocket Tactics",
    "link": "https://thehackernews.com/2025/07/3500-websites-hijacked-to-secretly-mine.html",
    "date": "2025-07-21T03:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A new attack campaign has compromised more than 3,500 websites worldwide with JavaScript cryptocurrency miners, marking the return of browser-based cryptojacking attacks once popularized by the likes ..."
  },
  {
    "title": "5 tips for building foundation models for AI",
    "link": "https://www.zdnet.com/article/5-crucial-things-to-consider-when-you-build-foundation-models-for-ai/",
    "date": "2025-07-21T02:00:18.000Z",
    "source": "ZDNet Security",
    "summary": "While some business leaders buy large language models, others build their own. Here are five things you need to know...."
  },
  {
    "title": "EncryptHub Targets Web3 Developers Using Fake AI Platforms to Deploy Fickle Stealer Malware",
    "link": "https://thehackernews.com/2025/07/encrypthub-targets-web3-developers.html",
    "date": "2025-07-20T16:13:00.000Z",
    "source": "The Hacker News",
    "summary": "The financially motivated threat actor known as EncryptHub (aka LARVA-208 and Water Gamayun) has been attributed to a new campaign that's targeting Web3 developers to infect them with information stea..."
  },
  {
    "title": "Microsoft SharePoint zero-day exploited in RCE attacks, no patch available",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-sharepoint-zero-day-exploited-in-rce-attacks-no-patch-available/",
    "date": "2025-07-20T15:40:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Critical zero-day vulnerabilities in Microsoft SharePoint, tracked as CVE-2025-53770 and CVE-2025-53771, have been actively exploited since at least July 18th, with no patch available and at least 85 ..."
  },
  {
    "title": "HPE warns of hardcoded passwords in Aruba access points",
    "link": "https://www.bleepingcomputer.com/news/security/hpe-warns-of-hardcoded-passwords-in-aruba-access-points/",
    "date": "2025-07-20T14:09:19.000Z",
    "source": "Bleeping Computer",
    "summary": "Hewlett-Packard Enterprise (HPE) is warning of hardcoded credentials in Aruba Instant On Access Points that allow attackers to bypass normal device authentication and access the web interface. [...]..."
  },
  {
    "title": "Critical Unpatched SharePoint Zero-Day Actively Exploited, Breaches 75+ Company Servers",
    "link": "https://thehackernews.com/2025/07/critical-microsoft-sharepoint-flaw.html",
    "date": "2025-07-20T09:52:00.000Z",
    "source": "The Hacker News",
    "summary": "A critical security vulnerability in Microsoft SharePoint Server has been weaponized as part of an \"active, large-scale\" exploitation campaign.\nThe zero-day flaw, tracked as CVE-2025-53770 (CVSS score..."
  },
  {
    "title": "Malware Injected into 5 npm Packages After Maintainer Tokens Stolen in Phishing Attack",
    "link": "https://thehackernews.com/2025/07/malware-injected-into-6-npm-packages.html",
    "date": "2025-07-20T09:40:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have alerted to a supply chain attack that has targeted popular npm packages via a phishing campaign designed to steal the project maintainers' npm tokens.\nThe captured token..."
  },
  {
    "title": "This Apple Watch model is my favorite and I use it daily - right now, it's over 30% off",
    "link": "https://www.zdnet.com/article/this-apple-watch-model-is-my-favorite-and-i-use-it-daily-right-now-its-over-30-off/",
    "date": "2025-07-20T08:30:16.000Z",
    "source": "ZDNet Security",
    "summary": "I love the Apple Watch SE (2nd Gen) for its basic features and fair price, and it's currently on sale at Walmart...."
  },
  {
    "title": "Hackers Exploit Critical CrushFTP Flaw to Gain Admin Access on Unpatched Servers",
    "link": "https://thehackernews.com/2025/07/hackers-exploit-critical-crushftp-flaw.html",
    "date": "2025-07-20T07:35:00.000Z",
    "source": "The Hacker News",
    "summary": "A newly disclosed critical security flaw in CrushFTP has come under active exploitation in the wild. Assigned the CVE identifier CVE-2025-54309, the vulnerability carries a CVSS score of 9.0.\n\"CrushFT..."
  },
  {
    "title": "Apple's latest iPad hit a new low price at Walmart - and it's available in every color",
    "link": "https://www.zdnet.com/article/apples-latest-ipad-hit-a-new-low-price-at-walmart-and-its-available-in-every-color/",
    "date": "2025-07-20T07:00:15.000Z",
    "source": "ZDNet Security",
    "summary": "Apple's 11th-generation iPad is available for $50 off. This deal applies to every color and storage size option...."
  },
  {
    "title": "Threat actors downgrade FIDO2 MFA auth in PoisonSeed phishing attack",
    "link": "https://www.bleepingcomputer.com/news/security/threat-actors-downgrade-fido2-mfa-auth-in-poisonseed-phishing-attack/",
    "date": "2025-07-19T17:41:49.000Z",
    "source": "Bleeping Computer",
    "summary": "A PoisonSeed phishing campaign is bypassing FIDO2 security key protections by abusing the cross-device sign-in feature in WebAuthn to trick users into approving login authentication requests from fake..."
  },
  {
    "title": "Popular npm linter packages hijacked via phishing to drop malware",
    "link": "https://www.bleepingcomputer.com/news/security/popular-npm-linter-packages-hijacked-via-phishing-to-drop-malware/",
    "date": "2025-07-19T12:51:22.000Z",
    "source": "Bleeping Computer",
    "summary": "Popular JavaScript libraries eslint-config-prettier and eslint-plugin-prettier were hijacked this week and turned into malware droppers, in a supply chain attack achieved via targeted phishing and cre..."
  },
  {
    "title": "ChatGPT\"s GPT-5-reasoning-alpha model spotted ahead of launch",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-gpt-5-reasoning-alpha-model-spotted-ahead-of-launch/",
    "date": "2025-07-19T12:07:22.000Z",
    "source": "Bleeping Computer",
    "summary": "GPT-5 might be just a few days or weeks away, as we've spotted references to a new model called gpt-5-reasoning-alpha-2025-07-13. [...]..."
  },
  {
    "title": "The best Samsung TVs of 2025: Expert tested for streaming, gaming, and more",
    "link": "https://www.zdnet.com/article/best-samsung-tv/",
    "date": "2025-07-19T12:00:15.000Z",
    "source": "ZDNet Security",
    "summary": "We've tested and researched the best TVs you can get from Samsung--from high-end OLED models to budget-friendly smart TVs--to help you find the right fit for your home...."
  },
  {
    "title": "I took a walk with Meta's new Oakley smart glasses - they beat my Ray-Bans in every way",
    "link": "https://www.zdnet.com/article/i-took-a-walk-with-metas-new-oakley-smart-glasses-they-beat-my-ray-bans-in-every-way/",
    "date": "2025-07-19T08:45:12.000Z",
    "source": "ZDNet Security",
    "summary": "Meta's new Oakley smart glasses feature eight hours of battery life, capture 3K video, and most importantly, look great...."
  },
  {
    "title": "Apple's latest AirPods models are still at their lowest price ever - get them while the deal lasts",
    "link": "https://www.zdnet.com/article/apples-latest-airpods-models-are-still-at-their-lowest-price-ever-get-them-while-the-deal-lasts/",
    "date": "2025-07-19T08:30:15.000Z",
    "source": "ZDNet Security",
    "summary": "The AirPods 4 lineup is a solid option for iOS fans who don't need the pro-level features of the AirPods Pro 2. Get them now while they're 33% off...."
  },
  {
    "title": "I found a compact power station with solar charging, and it's a new off-grid essential",
    "link": "https://www.zdnet.com/article/i-found-a-compact-power-station-with-solar-charging-and-its-a-new-off-grid-essential/",
    "date": "2025-07-19T08:15:12.000Z",
    "source": "ZDNet Security",
    "summary": "EcoFlow's Delta 3 Plus has capacity for an expandable battery - a rare but valuable feature in compact power stations...."
  },
  {
    "title": "I spoke with an AI version of myself, thanks to Hume's free tool - how to try it",
    "link": "https://www.zdnet.com/article/i-spoke-with-an-ai-version-of-myself-thanks-to-humes-free-tool-how-to-try-it/",
    "date": "2025-07-19T08:00:20.000Z",
    "source": "ZDNet Security",
    "summary": "EVI 3's voice cloning feature has its shortcomings. But those are significantly overshadowed by its remarkable qualities...."
  },
  {
    "title": "This TCL mini LED TV hits above its price point (and it's $900 off)",
    "link": "https://www.zdnet.com/article/this-tcl-mini-led-tv-hits-above-its-price-point-and-its-900-off/",
    "date": "2025-07-19T08:00:16.000Z",
    "source": "ZDNet Security",
    "summary": "The flagship QM8K takes a bold aim at OLED-level picture quality. Over at Best Buy, the 65-inch TV is available at 36%...."
  },
  {
    "title": "This $269 Chromebook couldn't be more portable - here's why it's my pick for students",
    "link": "https://www.zdnet.com/article/this-269-chromebook-couldnt-be-more-portable-heres-why-its-my-pick-for-students/",
    "date": "2025-07-19T07:45:12.000Z",
    "source": "ZDNet Security",
    "summary": "Lenovo's 11-inch Chromebook Duet is both like a tablet and a laptop, and it's portable enough to carry around long days on campus...."
  },
  {
    "title": "This split keyboard offers deep customization - if you're willing to go all in",
    "link": "https://www.zdnet.com/article/this-split-keyboard-offers-deep-customization-if-youre-willing-to-go-all-in/",
    "date": "2025-07-19T07:00:22.000Z",
    "source": "ZDNet Security",
    "summary": "The Naya Create keyboard shatters the mold of how you use a keyboard, with per-key customization options and some impressive modules...."
  },
  {
    "title": "This HP EliteBook I tested is one of the most versatile work laptops of 2025 - and it's on sale",
    "link": "https://www.zdnet.com/article/this-hp-elitebook-i-tested-is-one-of-the-most-versatile-work-laptops-of-2025-and-its-on-sale/",
    "date": "2025-07-19T07:00:15.000Z",
    "source": "ZDNet Security",
    "summary": "HP's EliteBook Ultra G1i is impressively lightweight, reliably powerful, and built to last on battery life. But there's more to it...."
  },
  {
    "title": "I ditched my Bluetooth speakers for this slick turntable - and it's more practical than I thought",
    "link": "https://www.zdnet.com/article/i-ditched-my-bluetooth-speakers-for-this-slick-turntable-and-its-more-practical-than-i-thought/",
    "date": "2025-07-19T07:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "Victrola's Harmony turntable system blends classic design elements with modern digital features, perfect for beginners early into their vinyl collection journey...."
  },
  {
    "title": "OpenAI, Anthropic, Google may disrupt education market with new AI tools",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-anthropic-google-may-disrupt-education-market-with-new-ai-tools/",
    "date": "2025-07-19T06:30:27.000Z",
    "source": "Bleeping Computer",
    "summary": "AI companies could soon disrupt the education market with their new AI-based learning tools for students. [...]..."
  },
  {
    "title": "Could OpenAI's rumored browser be a Chrome-killer? Here's what I'm expecting",
    "link": "https://www.zdnet.com/article/could-openais-rumored-browser-be-a-chrome-killer-heres-what-im-expecting/",
    "date": "2025-07-19T01:00:17.000Z",
    "source": "ZDNet Security",
    "summary": "Real soon now, OpenAI will be shipping its initial AI-first web browser. Here's what we know so far about it and its AI browser rivals...."
  }
]