[
  {
    "title": "New n8n Vulnerability (9.9 CVSS) Lets Authenticated Users Execute System Commands",
    "link": "https://thehackernews.com/2026/01/new-n8n-vulnerability-99-cvss-lets.html",
    "date": "2026-01-06T05:08:00.000Z",
    "source": "The Hacker News",
    "summary": "A new critical security vulnerability has been disclosed in n8n, an open-source workflow automation platform, that could enable an authenticated attacker to execute arbitrary system commands on the un..."
  },
  {
    "title": "Cloud file-sharing sites targeted for corporate data theft attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cloud-file-sharing-sites-targeted-for-corporate-data-theft-attacks/",
    "date": "2026-01-05T22:52:16.000Z",
    "source": "Bleeping Computer",
    "summary": "A threat actor known as Zestix has been offering to corporate data stolen from dozens of companies likely after breaching their ShareFile, Nextcloud, and OwnCloud instances. [...]..."
  },
  {
    "title": "ClickFix attack uses fake Windows BSOD screens to push malware",
    "link": "https://www.bleepingcomputer.com/news/security/clickfix-attack-uses-fake-windows-bsod-screens-to-push-malware/",
    "date": "2026-01-05T21:16:35.000Z",
    "source": "Bleeping Computer",
    "summary": "A new ClickFix social engineering campaign is targeting the hospitality sector in Europe, using fake Windows Blue Screen of Death (BSOD) screens to trick users into manually compiling and executing ma..."
  },
  {
    "title": "Critical 'MongoBleed' Bug Under Active Attack, Patch Now",
    "link": "https://www.darkreading.com/cloud-security/mongobleed-bug-active-attack-patch",
    "date": "2026-01-05T20:52:04.000Z",
    "source": "Dark Reading",
    "summary": "A memory leak security vulnerability allows unauthenticated attackers to extract passwords and tokens from MongoDB servers...."
  },
  {
    "title": "US broadband provider Brightspeed investigates breach claims",
    "link": "https://www.bleepingcomputer.com/news/security/us-broadband-provider-brightspeed-investigates-breach-claims/",
    "date": "2026-01-05T20:01:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Brightspeed, one of the largest fiber broadband companies in the United States, is investigating security breach and data theft claims made by the Crimson Collective extortion gang. [...]..."
  },
  {
    "title": "US Cyber Pros Plead Guilty Over BlackCat Ransomware Activity",
    "link": "https://www.darkreading.com/cyber-risk/us-cyber-pros-plead-guilty-over-ransomware-activity",
    "date": "2026-01-05T18:52:21.000Z",
    "source": "Dark Reading",
    "summary": "Two US citizens pleaded guilty to working as ALPHV/BlackCat ransomware affiliates in 2023, and both were previously employed by prominent security firms...."
  },
  {
    "title": "Russia-Aligned Hackers Abuse Viber to Target Ukrainian Military and Government",
    "link": "https://thehackernews.com/2026/01/russia-aligned-hackers-abuse-viber-to.html",
    "date": "2026-01-05T17:56:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russia-aligned threat actor known as UAC-0184 has been observed targeting Ukrainian military and government entities by leveraging the Viber messaging platform to deliver malicious ZIP archives.\n\"..."
  },
  {
    "title": "VSCode IDE forks expose users to \"recommended extension\" attacks",
    "link": "https://www.bleepingcomputer.com/news/security/vscode-ide-forks-expose-users-to-recommended-extension-attacks/",
    "date": "2026-01-05T16:41:38.000Z",
    "source": "Bleeping Computer",
    "summary": "Popular AI-powered integrated development environment solutions, such as Cursor, Windsurf, Google Antigravity, and Trae, recommend extensions that are non-existent in the OpenVSX registry, allowing th..."
  },
  {
    "title": "Kimwolf Android Botnet Infects Over 2 Million Devices via Exposed ADB and Proxy Networks",
    "link": "https://thehackernews.com/2026/01/kimwolf-android-botnet-infects-over-2.html",
    "date": "2026-01-05T16:41:00.000Z",
    "source": "The Hacker News",
    "summary": "The botnet known as Kimwolf has infected more than 2 million Android devices by tunneling through residential proxy networks, according to findings from Synthient.\n\"Key actors involved in the Kimwolf ..."
  },
  {
    "title": "Ledger customers impacted by third-party Global-e data breach",
    "link": "https://www.bleepingcomputer.com/news/security/ledger-customers-impacted-by-third-party-global-e-data-breach/",
    "date": "2026-01-05T15:14:04.000Z",
    "source": "Bleeping Computer",
    "summary": "Ledger is informing some customers that their personal data has been exposed after hackers breached the systems of third-party payment processor Global-e. [...]..."
  },
  {
    "title": "RondoDox Botnet Expands Scope With React2Shell Exploitation",
    "link": "https://www.darkreading.com/vulnerabilities-threats/rondodox-botnet-scope-react2shell-exploitation",
    "date": "2026-01-05T15:11:55.000Z",
    "source": "Dark Reading",
    "summary": "Recent attacks are targeting Next.js servers and pose a significant threat of cryptomining, botnet payloads, and other malicious activity to IoT networks and enterprises...."
  },
  {
    "title": "Agentic AI Is an Identity Problem and CISOs Will Be Accountable for the Outcome",
    "link": "https://www.bleepingcomputer.com/news/security/agentic-ai-is-an-identity-problem-and-cisos-will-be-accountable-for-the-outcome/",
    "date": "2026-01-05T15:05:15.000Z",
    "source": "Bleeping Computer",
    "summary": "As agentic AI adoption accelerates, identity is emerging as the primary security challenge. Token Security explains why AI agents behave like a new class of identity and why CISOs must manage their ac..."
  },
  {
    "title": "NordVPN denies breach claims, says attackers have \"dummy data\"",
    "link": "https://www.bleepingcomputer.com/news/security/nordvpn-denies-breach-claims-says-attackers-have-dummy-data/",
    "date": "2026-01-05T14:48:46.000Z",
    "source": "Bleeping Computer",
    "summary": "NordVPN denied allegations that its internal Salesforce development servers were breached, saying that cybercriminals obtained \"dummy data\" from a trial account on a third-party automated testing plat..."
  },
  {
    "title": "⚡ Weekly Recap: IoT Exploits, Wallet Breaches, Rogue Extensions, AI Abuse & More",
    "link": "https://thehackernews.com/2026/01/weekly-recap-iot-exploits-wallet.html",
    "date": "2026-01-05T12:53:00.000Z",
    "source": "The Hacker News",
    "summary": "The year opened without a reset. The same pressure carried over, and in some places it tightened. Systems people assume are boring or stable are showing up in the wrong places. Attacks moved quietly, ..."
  },
  {
    "title": "The State of Cybersecurity in 2025: Key Segments, Insights, and Innovations ",
    "link": "https://thehackernews.com/2026/01/the-state-of-cybersecurity-in-2025key.html",
    "date": "2026-01-05T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Featuring:\n\nCybersecurity is being reshaped by forces that extend beyond individual threats or tools. As organizations operate across cloud infrastructure, distributed endpoints, and complex supply ch..."
  },
  {
    "title": "Bitfinex Hack Convict Ilya Lichtenstein Released Early Under U.S. First Step Act",
    "link": "https://thehackernews.com/2026/01/bitfinex-hack-convict-ilya-lichtenstein.html",
    "date": "2026-01-05T09:42:00.000Z",
    "source": "The Hacker News",
    "summary": "Ilya Lichtenstein, who was sentenced to prison last year for money laundering charges in connection with his role in the massive hack of cryptocurrency exchange Bitfinex in 2016, said he has been rele..."
  },
  {
    "title": "New VVS Stealer Malware Targets Discord Accounts via Obfuscated Python Code",
    "link": "https://thehackernews.com/2026/01/new-vvs-stealer-malware-targets-discord.html",
    "date": "2026-01-05T07:48:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new Python-based information stealer called VVS Stealer (also styled as VVS $tealer) that's capable of harvesting Discord credentials and tokens.\n..."
  },
  {
    "title": "Hackers claim to hack Resecurity, firm says it was a honeypot",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-claim-resecurity-hack-firm-says-it-was-a-honeypot/",
    "date": "2026-01-03T20:34:22.000Z",
    "source": "Bleeping Computer",
    "summary": "The ShinyHunters hacking group claims it breached the systems of cybersecurity firm Resecurity and stole internal data, while Resecurity says the attackers only accessed a deliberately deployed honeyp..."
  },
  {
    "title": "Covenant Health says May data breach impacted nearly 478,000 patients",
    "link": "https://www.bleepingcomputer.com/news/security/covenant-health-says-may-data-breach-impacted-nearly-478-000-patients/",
    "date": "2026-01-02T19:00:42.000Z",
    "source": "Bleeping Computer",
    "summary": "The Covenant Health organization has revised to nearly 500,000 the number of individuals affected by a data breach discovered last May. [...]..."
  },
  {
    "title": "Cryptocurrency theft attacks traced to 2022 LastPass breach",
    "link": "https://www.bleepingcomputer.com/news/security/cryptocurrency-theft-attacks-traced-to-2022-lastpass-breach/",
    "date": "2026-01-02T17:28:01.000Z",
    "source": "Bleeping Computer",
    "summary": "Blockchain investigation firm TRM Labs says ongoing cryptocurrency thefts have been traced to the 2022 LastPass breach, with attackers draining wallets years after encrypted vaults were stolen and lau..."
  },
  {
    "title": "Over 10K Fortinet firewalls exposed to actively exploited 2FA bypass",
    "link": "https://www.bleepingcomputer.com/news/security/over-10-000-fortinet-firewalls-exposed-to-ongoing-2fa-bypass-attacks/",
    "date": "2026-01-02T16:01:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Over 10,000 Internet-exposed Fortinet firewalls are still vulnerable to attacks exploiting a five-year-old two-factor authentication (2FA) bypass vulnerability. [...]..."
  },
  {
    "title": "Google is testing a new image AI and it's going to be its fastest model",
    "link": "https://www.bleepingcomputer.com/news/google/google-is-testing-a-new-image-ai-and-its-going-to-be-its-fastest-model/",
    "date": "2026-01-02T15:19:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Google is testing a new image AI model called \"Nano Banana 2 Flash,\" and it's going to be as good as the Gemini 3 Pro Nano Banana, but it'll be cheaper. [...]..."
  },
  {
    "title": "The Kimwolf Botnet is Stalking Your Local Network",
    "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
    "date": "2026-01-02T14:20:10.000Z",
    "source": "Krebs on Security",
    "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a ..."
  },
  {
    "title": "Cybersecurity Predictions for 2026: Navigating the Future of Digital Threats",
    "link": "https://www.darkreading.com/threat-intelligence/cybersecurity-predictions-for-2026-navigating-the-future-of-digital-threats",
    "date": "2026-01-02T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Cybersecurity experts discuss 2026 predictions, highlighting the rise of AI-driven threats, the shift to resilience over prevention, and the urgent need for advanced security measures to combat evolvi..."
  },
  {
    "title": "CTO New Year's Resolutions for a More Secure 2026",
    "link": "https://www.darkreading.com/cyber-risk/cto-new-year-resolutions-for-a-more-secure-2026",
    "date": "2026-01-02T13:55:02.000Z",
    "source": "Dark Reading",
    "summary": "From securing supply chain defenses and MCPs across AI workflows to formal AI and quantum governance, experts share their wish lists for cyber safety in 2026...."
  },
  {
    "title": "Transparent Tribe Launches New RAT Attacks Against Indian Government and Academia",
    "link": "https://thehackernews.com/2026/01/transparent-tribe-launches-new-rat.html",
    "date": "2026-01-02T13:52:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Transparent Tribe has been attributed to a fresh set of attacks targeting Indian governmental, academic, and strategic entities with a remote access trojan (RAT) that grants ..."
  },
  {
    "title": "The ROI Problem in Attack Surface Management",
    "link": "https://thehackernews.com/2026/01/the-roi-problem-in-attack-surface.html",
    "date": "2026-01-02T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Attack Surface Management (ASM) tools promise reduced risk. What they usually deliver is more information. \nSecurity teams deploy ASM, asset inventories grow, alerts start flowing, and dashboards fill..."
  },
  {
    "title": "Cybercriminals Abuse Google Cloud Email Feature in Multi-Stage Phishing Campaign",
    "link": "https://thehackernews.com/2026/01/cybercriminals-abuse-google-cloud-email.html",
    "date": "2026-01-02T09:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a phishing campaign that involves the attackers impersonating legitimate Google-generated messages by abusing Google Cloud's Application Integration..."
  },
  {
    "title": "ThreatsDay Bulletin: GhostAd Drain, macOS Attacks, Proxy Botnets, Cloud Exploits, and 12+ Stories",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-ghostad-drain-macos.html",
    "date": "2026-01-01T15:52:00.000Z",
    "source": "The Hacker News",
    "summary": "The first ThreatsDay Bulletin of 2026 lands on a day that already feels symbolic — new year, new breaches, new tricks. If the past twelve months taught defenders anything, it’s that threat actors don’..."
  },
  {
    "title": "RondoDox Botnet Exploits Critical React2Shell Flaw to Hijack IoT Devices and Web Servers",
    "link": "https://thehackernews.com/2026/01/rondodox-botnet-exploits-critical.html",
    "date": "2026-01-01T09:19:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a persistent nine-month-long campaign that has targeted Internet of Things (IoT) devices and web applications to enroll them into a botnet known as ..."
  }
]