[
  {
    "title": "Faster Qi2 wireless charging coming to iPhones and some Android phones",
    "link": "https://www.zdnet.com/article/faster-qi2-wireless-charging-coming-to-iphones-and-some-android-phones/",
    "date": "2025-07-24T18:00:26.000Z",
    "source": "ZDNet Security",
    "summary": "The new Qi2 25 W standard is especially good news for Android users. Here's why...."
  },
  {
    "title": "Phishers Target Aviation Execs to Scam Customers",
    "link": "https://krebsonsecurity.com/2025/07/phishers-target-aviation-execs-to-scam-customers/",
    "date": "2025-07-24T17:57:06.000Z",
    "source": "Krebs on Security",
    "summary": "KrebsOnSecurity recently heard from a reader whose boss's email account got phished and was used to trick one of the company's customers into sending a large payment to scammers. An investigation into..."
  },
  {
    "title": "How to clear your iPhone cache (and why you should do it before installing iOS 26 public beta)",
    "link": "https://www.zdnet.com/article/how-to-clear-your-iphone-cache-and-why-you-should-do-it-before-installing-ios-26-public-beta/",
    "date": "2025-07-24T17:52:00.000Z",
    "source": "ZDNet Security",
    "summary": "A full cache can slow down your iPhone, but clearing it is a fast and easy way to improve performance and free up space...."
  },
  {
    "title": "You can get an iPhone 16 Pro from T-Mobile for free - with no trade-in required",
    "link": "https://www.zdnet.com/article/you-can-get-an-iphone-16-pro-from-t-mobile-for-free-with-no-trade-in-required/",
    "date": "2025-07-24T17:51:24.000Z",
    "source": "ZDNet Security",
    "summary": "When you sign up for T-Mobile's Experience Beyond Plan, you'll receive an iPhone 16 Pro without a trade-in...."
  },
  {
    "title": "I finally found a wall charger than can replace my AirTag when I travel - and it works in 150 countries",
    "link": "https://www.zdnet.com/article/i-finally-found-a-wall-charger-than-can-replace-my-airtag-when-i-travel-and-it-works-in-150-countries/",
    "date": "2025-07-24T17:49:03.000Z",
    "source": "ZDNet Security",
    "summary": "The Twelve South PlugBug is a four-port wall charger that can be used in 150 countries and tracked using the Find My app...."
  },
  {
    "title": "The MacOS 26 public beta is finally here - 5 features I'm trying first",
    "link": "https://www.zdnet.com/article/the-macos-26-public-beta-is-finally-here-5-features-im-trying-first/",
    "date": "2025-07-24T17:45:00.000Z",
    "source": "ZDNet Security",
    "summary": "The MacOS Tahoe beta just went live to the public. Here's how to tell if your Mac can run it, and five of the most-anticipated features to test out...."
  },
  {
    "title": "WatchOS 26 is live: Every Apple Watch that will get the new software update",
    "link": "https://www.zdnet.com/article/watchos-26-is-live-every-apple-watch-that-will-get-the-software-update/",
    "date": "2025-07-24T17:39:44.000Z",
    "source": "ZDNet Security",
    "summary": "Want to test run Apple's latest WatchOS software? The public beta is live for everyone to try - as long as you have one of these Apple Watch models...."
  },
  {
    "title": "Brave browser will block Microsoft Recall from tracking your online activity",
    "link": "https://www.zdnet.com/article/brave-browser-will-block-microsoft-recall-from-tracking-your-online-activity/",
    "date": "2025-07-24T17:27:53.000Z",
    "source": "ZDNet Security",
    "summary": "The privacy-minded Brave browser doesn't want Recall snooping on your online activities, though you can turn the option back on if you wish...."
  },
  {
    "title": "Apple's iOS 26 and iPadOS 26 public betas are here: How to access and why you'll want to",
    "link": "https://www.zdnet.com/article/apples-ios-26-and-ipados-26-public-betas-are-here-how-to-access-and-why-youll-want-to/",
    "date": "2025-07-24T17:26:00.000Z",
    "source": "ZDNet Security",
    "summary": "Were you waiting to try Apple's public betas for the iPhone, iPad, Apple Watch, and more? Now you can. We've got all the details - eligibility and how to get them - right here...."
  },
  {
    "title": "You can turn your Google Photos into video clips now - here's how",
    "link": "https://www.zdnet.com/article/you-can-turn-your-google-photos-into-video-clips-now-heres-how/",
    "date": "2025-07-24T17:20:00.000Z",
    "source": "ZDNet Security",
    "summary": "Watch your pictures come to life in six-second clips, or let Google's AI edit your photos into an entirely different style like anime. Try it for free...."
  },
  {
    "title": "WatchOS 26 public beta is out right now - 8 new Apple Watch features you can try",
    "link": "https://www.zdnet.com/article/watchos-26-public-beta-is-out-right-now-8-new-apple-watch-features-you-can-try/",
    "date": "2025-07-24T17:20:00.000Z",
    "source": "ZDNet Security",
    "summary": "Major updates are now available on your Apple Watch for free. Here are the standout features arriving with the latest version of WatchOS...."
  },
  {
    "title": "My favorite Kindle tablet just got a kids model, and it makes so much sense",
    "link": "https://www.zdnet.com/article/my-favorite-kindle-tablet-just-got-a-kids-model-and-it-makes-so-much-sense/",
    "date": "2025-07-24T17:15:00.000Z",
    "source": "ZDNet Security",
    "summary": "The new Kindle Colorsoft Kids offers a more engaging and focused e-reading experience for children...."
  },
  {
    "title": "Critical Mitel Flaw Lets Hackers Bypass Login, Gain Full Access to MiVoice MX-ONE Systems",
    "link": "https://thehackernews.com/2025/07/critical-mitel-flaw-lets-hackers-bypass.html",
    "date": "2025-07-24T17:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Mitel has released security updates to address a critical security flaw in MiVoice MX-ONE that could allow an attacker to bypass authentication protections.\n\"An authentication bypass vulnerability has..."
  },
  {
    "title": "7 ways Linux can save you money",
    "link": "https://www.zdnet.com/article/7-ways-linux-can-save-you-money/",
    "date": "2025-07-24T17:14:00.000Z",
    "source": "ZDNet Security",
    "summary": "I've watched many people spend huge amounts of money keeping their computers running or up to speed. But they don't have to with Linux. Here's why...."
  },
  {
    "title": "EcoFlow's new portable battery stations are lighter and more powerful (DC plug included)",
    "link": "https://www.zdnet.com/article/ecoflows-new-portable-battery-stations-are-lighter-and-more-powerful-dc-plug-included/",
    "date": "2025-07-24T17:11:00.000Z",
    "source": "ZDNet Security",
    "summary": "The EcoFlow Trail Series prioritizes ease of use, making it a suitable portable battery for camping or travel...."
  },
  {
    "title": "Fire Ant Exploits VMware Flaws to Compromise ESXi Hosts and vCenter Environments",
    "link": "https://thehackernews.com/2025/07/fire-ant-exploits-vmware-flaw-to.html",
    "date": "2025-07-24T17:05:00.000Z",
    "source": "The Hacker News",
    "summary": "Virtualization and networking infrastructure have been targeted by a threat actor codenamed Fire Ant as part of a prolonged cyber espionage campaign.\nThe activity, observed this year, is primarily des..."
  },
  {
    "title": "I switched to a $280 Chromebook from my Windows laptop for a week - and didn't regret it",
    "link": "https://www.zdnet.com/article/i-switched-to-a-280-chromebook-from-my-windows-laptop-for-a-week-and-didnt-regret-it/",
    "date": "2025-07-24T17:03:00.000Z",
    "source": "ZDNet Security",
    "summary": "Lenovo's 11-inch Chromebook Duet is a hybrid device that's portable enough to lug around for work or school...."
  },
  {
    "title": "Hacker sneaks infostealer malware into early access Steam game",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-sneaks-infostealer-malware-into-early-access-steam-game/",
    "date": "2025-07-24T16:49:47.000Z",
    "source": "Bleeping Computer",
    "summary": "A threat actor called EncryptHub has compromised a game on Steam to distribute info-stealing malware to unsuspecting users downloading the title. [...]..."
  },
  {
    "title": "Why I recommend this Asus laptop over the MacBook Pro to creators and professionals",
    "link": "https://www.zdnet.com/article/why-i-recommend-this-asus-laptop-over-the-macbook-pro-to-creators-and-professionals/",
    "date": "2025-07-24T16:49:00.000Z",
    "source": "ZDNet Security",
    "summary": "The Asus ProArt P16 offers strong performance initially, with its customization options providing additional benefits for users...."
  },
  {
    "title": "1 in 3 Americans ask ChatGPT to help them find a new job, study finds",
    "link": "https://www.zdnet.com/article/1-in-3-americans-ask-chatgpt-to-help-them-find-a-new-job-study-finds/",
    "date": "2025-07-24T16:44:01.000Z",
    "source": "ZDNet Security",
    "summary": "Of workers surveyed, 18% said AI suggested an entirely new career path that they hadn't previously considered...."
  },
  {
    "title": "My cat Norbert gives this automatic wet food feeder two paws up, and it's on sale",
    "link": "https://www.zdnet.com/article/my-cat-norbert-gives-this-automatic-wet-food-feeder-two-paws-up-and-its-on-sale/",
    "date": "2025-07-24T16:35:00.000Z",
    "source": "ZDNet Security",
    "summary": "The Petlibro Polar Wet Food Automatic Feeder helps keep your cat's eating schedule on time, even if you're away from home. Plus, you can get 10% off on Amazon...."
  },
  {
    "title": "Microsoft fixes SharePoint zero-day exploits used in cyberattacks and ransomware - how to patch them",
    "link": "https://www.zdnet.com/article/microsoft-fixes-sharepoint-zero-day-exploits-used-in-cyberattacks-and-ransomware-how-to-patch-them/",
    "date": "2025-07-24T16:32:00.000Z",
    "source": "ZDNet Security",
    "summary": "Microsoft has pointed the finger at three Chinese nation-state actors for exploiting the SharePoint vulnerabilities. Here's what we know about the security flaws and how to guard against future attack..."
  },
  {
    "title": "You can buy Lenovo's 'rollable' laptop now - not cheap, but packed with killer specs",
    "link": "https://www.zdnet.com/article/you-can-buy-lenovos-rollable-laptop-now-not-cheap-but-packed-with-killer-specs/",
    "date": "2025-07-24T16:19:05.000Z",
    "source": "ZDNet Security",
    "summary": "The buzzworthy ThinkBook with an extendable display first debuted at CES as a proof of concept, but now it's finally available to consumers...."
  },
  {
    "title": "The best reading tablets of 2025 for poolside reading and more",
    "link": "https://www.zdnet.com/article/best-reading-tablet/",
    "date": "2025-07-24T16:19:00.000Z",
    "source": "ZDNet Security",
    "summary": "We rounded up the best reading tablets of the year for sunny beach days, poolside lounging, and late-nights on the patio...."
  },
  {
    "title": "Mitel warns of critical MiVoice MX-ONE authentication bypass flaw",
    "link": "https://www.bleepingcomputer.com/news/security/mitel-warns-of-critical-mivoice-mx-one-authentication-bypass-flaw/",
    "date": "2025-07-24T15:17:40.000Z",
    "source": "Bleeping Computer",
    "summary": "Mitel Networks has released security updates to patch a critical-severity authentication bypass vulnerability impacting its MiVoice MX-ONE enterprise communications platform. [...]..."
  },
  {
    "title": "CastleLoader Malware Infects 469 Devices Using Fake GitHub Repos and ClickFix Phishing",
    "link": "https://thehackernews.com/2025/07/castleloader-malware-infects-469.html",
    "date": "2025-07-24T15:13:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have shed light on a new versatile malware loader called CastleLoader that has been put to use in campaigns distributing various information stealers and remote access trojan..."
  },
  {
    "title": "Sophos and SonicWall Patch Critical RCE Flaws Affecting Firewalls and SMA 100 Devices",
    "link": "https://thehackernews.com/2025/07/sophos-and-sonicwall-patch-critical-rce.html",
    "date": "2025-07-24T14:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Sophos and SonicWall have alerted users of critical security flaws in Sophos Firewall and Secure Mobile Access (SMA) 100 Series appliances that could be exploited to achieve remote code execution. \nTh..."
  },
  {
    "title": "Translating Cyber-Risk for the Boardroom",
    "link": "https://www.darkreading.com/cyber-risk/translating-cyber-risk-boardroom",
    "date": "2025-07-24T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "When security leaders embrace this truth and learn to speak in the language of leadership, they don't just protect the enterprise, they help lead it forward...."
  },
  {
    "title": "Hackers breach Toptal GitHub account, publish malicious npm packages",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-breach-toptal-github-account-publish-malicious-npm-packages/",
    "date": "2025-07-24T13:26:04.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers compromised Toptal's GitHub organization account and used their access to publish ten malicious packages on the Node Package Manager (NPM) index. [...]..."
  },
  {
    "title": "Watch This Webinar to Uncover Hidden Flaws in Login, AI, and Digital Trust — and Fix Them",
    "link": "https://thehackernews.com/2025/07/watch-this-webinar-to-uncover-hidden.html",
    "date": "2025-07-24T11:36:00.000Z",
    "source": "The Hacker News",
    "summary": "Is Managing Customer Logins and Data Giving You Headaches? You're Not Alone!\nToday, we all expect super-fast, secure, and personalized online experiences. But let's be honest, we're also more careful ..."
  }
]