[
  {
    "title": "Malicious extensions in Chrome Web store steal user credentials",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-extensions-in-chrome-web-store-steal-user-credentials/",
    "date": "2025-12-23T13:31:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Two Chrome extensions in the Web Store named 'Phantom Shuttle' are posing as plugins for a proxy service to hijack user traffic and steal sensitive data. [...]..."
  },
  {
    "title": "Microsoft Teams strengthens messaging security by default in January",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-strengthens-messaging-security-by-default-in-january/",
    "date": "2025-12-23T13:23:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft Teams will automatically enable messaging safety features by default in January to strengthen defenses against content tagged as malicious. [...]..."
  },
  {
    "title": "Cyberattack knocks offline France's postal, banking services",
    "link": "https://www.bleepingcomputer.com/news/security/cyberattack-knocks-offline-frances-postal-banking-services/",
    "date": "2025-12-23T12:26:44.000Z",
    "source": "Bleeping Computer",
    "summary": "The French national postal service's online services were knocked offline by \"a major network incident\" on Monday, disrupting digital banking and other services for millions. [...]..."
  },
  {
    "title": "INTERPOL Arrests 574 in Africa; Ukrainian Ransomware Affiliate Pleads Guilty",
    "link": "https://thehackernews.com/2025/12/interpol-arrests-574-in-africa.html",
    "date": "2025-12-23T11:35:00.000Z",
    "source": "The Hacker News",
    "summary": "A law enforcement operation coordinated by INTERPOL has led to the recovery of $3 million and the arrest of 574 suspects by authorities from 19 countries, amidst a continued crackdown on cybercrime ne..."
  },
  {
    "title": "Passwd: A walkthrough of the Google Workspace Password Manager",
    "link": "https://thehackernews.com/2025/12/passwd-walkthrough-of-google-workspace.html",
    "date": "2025-12-23T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Passwd is designed specifically for organizations operating within Google Workspace. Rather than competing as a general consumer password manager, its purpose is narrow, and business-focused: secure c..."
  },
  {
    "title": "Italy fines Apple $116 million over App Store privacy policy issues",
    "link": "https://www.bleepingcomputer.com/news/security/italy-fines-apple-116-million-over-app-store-tracking-privacy-practices/",
    "date": "2025-12-23T11:06:22.000Z",
    "source": "Bleeping Computer",
    "summary": "Italy's competition authority (AGCM) has fined Apple €98.6 million ($116 million) for using the App Tracking Transparency (ATT) privacy framework to abuse its dominant market position in mobile app ad..."
  },
  {
    "title": "Baker University says 2024 data breach impacts 53,000 people",
    "link": "https://www.bleepingcomputer.com/news/security/baker-university-data-breach-impacts-over-53-000-individuals/",
    "date": "2025-12-23T09:50:08.000Z",
    "source": "Bleeping Computer",
    "summary": "Baker University has disclosed a data breach after attackers gained access to its network one year ago and stole the personal, health, and financial information of over 53,000 individuals. [...]..."
  },
  {
    "title": "U.S. DoJ Seizes Fraud Domain Behind $14.6 Million Bank Account Takeover Scheme",
    "link": "https://thehackernews.com/2025/12/us-doj-seizes-fraud-domain-behind-146.html",
    "date": "2025-12-23T08:15:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Justice Department (DoJ) on Monday announced the seizure of a web domain and database that it said was used to further a criminal scheme designed to target and defraud Americans by means of b..."
  },
  {
    "title": "Critical n8n Flaw (CVSS 9.9) Enables Arbitrary Code Execution Across Thousands of Instances",
    "link": "https://thehackernews.com/2025/12/critical-n8n-flaw-cvss-99-enables.html",
    "date": "2025-12-23T07:34:00.000Z",
    "source": "The Hacker News",
    "summary": "A critical security vulnerability has been disclosed in the n8n workflow automation platform that, if successfully exploited, could result in arbitrary code execution under certain circumstances.\nThe ..."
  },
  {
    "title": "FCC Bans Foreign-Made Drones and Key Parts Over U.S. National Security Risks",
    "link": "https://thehackernews.com/2025/12/fcc-bans-foreign-made-drones-and-key.html",
    "date": "2025-12-23T06:58:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Federal Communications Commission (FCC) on Monday announced a ban on all drones and critical components made in a foreign country, citing national security concerns.\nTo that end, the agency h..."
  },
  {
    "title": "Nissan says thousands of customers exposed in Red Hat breach",
    "link": "https://www.bleepingcomputer.com/news/security/nissan-says-thousands-of-customers-exposed-in-red-hat-breach/",
    "date": "2025-12-22T21:32:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Nissan Motor Co. Ltd. (Nissan) has confirmed that information of thousands of its customers has been compromised after the data breach at Red Hat in September. [...]..."
  },
  {
    "title": "New MacSync malware dropper evades macOS Gatekeeper checks",
    "link": "https://www.bleepingcomputer.com/news/security/new-macsync-malware-dropper-evades-macos-gatekeeper-checks/",
    "date": "2025-12-22T20:43:38.000Z",
    "source": "Bleeping Computer",
    "summary": "The latest variant of the MacSync information stealer targeting macOS systems is delivered through a digitally signed, notarized Swift application. [...]..."
  },
  {
    "title": "Threat Actors Exploit Zero-Day in WatchGuard Firebox Devices",
    "link": "https://www.darkreading.com/vulnerabilities-threats/threat-actors-zero-day-watchguard-firebox",
    "date": "2025-12-22T20:29:34.000Z",
    "source": "Dark Reading",
    "summary": "With attacks on the critical firewall vulnerability, WatchGuard joins a list of edge device vendors whose products have been targeted in recent weeks...."
  },
  {
    "title": "Interpol-led action decrypts 6 ransomware strains, arrests hundreds",
    "link": "https://www.bleepingcomputer.com/news/security/interpol-led-action-decrypts-6-ransomware-strains-arrests-hundreds/",
    "date": "2025-12-22T18:38:08.000Z",
    "source": "Bleeping Computer",
    "summary": "An Interpol-coordinated initiative called Operation Sentinel led to the arrest of 574 individuals and the recovery of $3 million linked to business email compromise, extortion, and ransomware incident..."
  },
  {
    "title": "Uzbek Users Under Attack by Android SMS-Stealers",
    "link": "https://www.darkreading.com/cyber-risk/uzbek-users-android-sms-stealers",
    "date": "2025-12-22T17:07:10.000Z",
    "source": "Dark Reading",
    "summary": "Telegram users in Uzbekistan are being targeted with Android SMS-stealer malware, and what's worse, the attackers are improving their methods...."
  },
  {
    "title": "Fake WhatsApp API Package on npm Steals Messages, Contacts, and Login Tokens",
    "link": "https://thehackernews.com/2025/12/fake-whatsapp-api-package-on-npm-steals.html",
    "date": "2025-12-22T16:28:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new malicious package on the npm repository that works as a fully functional WhatsApp API, but also contains the ability to intercept every messag..."
  },
  {
    "title": "Malicious npm package steals WhatsApp accounts and messages",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-npm-package-steals-whatsapp-accounts-and-messages/",
    "date": "2025-12-22T16:08:46.000Z",
    "source": "Bleeping Computer",
    "summary": "A malicious package in the Node Package Manager (NPM) registry poses as a legitimate WhatsApp Web API library to steal WhatsApp messages, collect contacts, and gain access to the account. [...]..."
  },
  {
    "title": "Romanian water authority hit by ransomware attack over weekend",
    "link": "https://www.bleepingcomputer.com/news/security/romanian-water-authority-hit-by-ransomware-attack-over-weekend/",
    "date": "2025-12-22T15:25:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Romanian Waters (Administrația Națională Apele Române), the country's water management authority, was hit by a ransomware attack over the weekend. [...]..."
  },
  {
    "title": "University of Phoenix data breach impacts nearly 3.5 million individuals",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-phoenix-data-breach-impacts-nearly-35-million-individuals/",
    "date": "2025-12-22T14:18:55.000Z",
    "source": "Bleeping Computer",
    "summary": "The Clop ransomware gang has stolen the data of nearly 3.5 million University of Phoenix (UoPX) students, staff, and suppliers after breaching the university's network in August. [...]..."
  },
  {
    "title": "Coupang breach affecting 33.7 million users raises data protection questions",
    "link": "https://www.bleepingcomputer.com/news/security/coupang-breach-affecting-337-million-users-raises-data-protection-questions/",
    "date": "2025-12-22T14:00:09.000Z",
    "source": "Bleeping Computer",
    "summary": "Coupang disclosed a data breach affecting 33.7 million customers after unauthorized access to personal data went undetected for nearly five months. Penta Security explains how the incident highlights ..."
  },
  {
    "title": "⚡ Weekly Recap: Firewall Exploits, AI Data Theft, Android Hacks, APT Attacks, Insider Leaks & More",
    "link": "https://thehackernews.com/2025/12/weekly-recap-firewall-exploits-ai-data.html",
    "date": "2025-12-22T12:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyber threats last week showed how attackers no longer need big hacks to cause big damage. They’re going after the everyday tools we trust most — firewalls, browser add-ons, and even smart TVs — turni..."
  },
  {
    "title": "How to Browse the Web More Sustainably With a Green Browser",
    "link": "https://thehackernews.com/2025/12/how-to-browse-sustainably-with-a-green-browser.html",
    "date": "2025-12-22T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "As the internet becomes an essential part of daily life, its environmental footprint continues to grow. \nData centers, constant connectivity, and resource-heavy browsing habits all contribute to energ..."
  },
  {
    "title": "CISA flags ASUS Live Update CVE, but the attack is years old",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-flags-asus-live-update-cve-but-the-attack-is-years-old/",
    "date": "2025-12-22T11:09:17.000Z",
    "source": "Bleeping Computer",
    "summary": "An ASUS Live Update vulnerability tracked as CVE-2025-59374 has been making the rounds in infosec feeds, with some headlines implying recent or ongoing exploitation. A closer look, however, shows the ..."
  },
  {
    "title": "Android Malware Operations Merge Droppers, SMS Theft, and RAT Capabilities at Scale",
    "link": "https://thehackernews.com/2025/12/android-malware-operations-merge.html",
    "date": "2025-12-22T06:11:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed leveraging malicious dropper apps masquerading as legitimate applications to deliver an Android SMS stealer dubbed Wonderland in mobile attacks targeting users in Uzbe..."
  },
  {
    "title": "Iranian Infy APT Resurfaces with New Malware Activity After Years of Silence",
    "link": "https://thehackernews.com/2025/12/iranian-infy-apt-resurfaces-with-new.html",
    "date": "2025-12-21T04:22:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters have discerned new activity associated with an Iranian threat actor known as Infy (aka Prince of Persia), nearly five years after the hacking group was observed targeting victims in Swe..."
  },
  {
    "title": "U.S. DOJ Charges 54 in ATM Jackpotting Scheme Using Ploutus Malware",
    "link": "https://thehackernews.com/2025/12/us-doj-charges-54-in-atm-jackpotting.html",
    "date": "2025-12-20T13:48:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of Justice (DoJ) this week announced the indictment of 54 individuals in connection with a multi-million dollar ATM jackpotting scheme.\nThe large-scale conspiracy involved deployin..."
  },
  {
    "title": "Cisco VPNs, Email Services Hit in Separate Threat Campaigns",
    "link": "https://www.darkreading.com/endpoint-security/cisco-vpns-email-services-threat-campaigns",
    "date": "2025-12-19T20:05:38.000Z",
    "source": "Dark Reading",
    "summary": "The company suffered one sophisticated five-alarm campaign and one messy spray-and-pray attack, mere days apart...."
  },
  {
    "title": "Russia-Linked Hackers Use Microsoft 365 Device Code Phishing for Account Takeovers",
    "link": "https://thehackernews.com/2025/12/russia-linked-hackers-use-microsoft-365.html",
    "date": "2025-12-19T17:54:00.000Z",
    "source": "The Hacker News",
    "summary": "A suspected Russia-aligned group has been attributed to a phishing campaign that employs device code authentication workflows to steal victims' Microsoft 365 credentials and conduct account takeover a..."
  },
  {
    "title": "LongNosedGoblin Caught Snooping on Asian Governments",
    "link": "https://www.darkreading.com/threat-intelligence/longnosedgoblin-caught-snooping-on-asian-governments",
    "date": "2025-12-19T16:38:48.000Z",
    "source": "Dark Reading",
    "summary": "New China-aligned APT group is deploying Group Policy to sniff through government networks across Southeast Asia and Japan...."
  },
  {
    "title": "Cracked Software and YouTube Videos Spread CountLoader and GachiLoader Malware",
    "link": "https://thehackernews.com/2025/12/cracked-software-and-youtube-videos.html",
    "date": "2025-12-19T15:34:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign that has used cracked software distribution sites as a distribution vector for a new version of a modular and stealthy loader known a..."
  }
]