[
  {
    "title": "Google fixes high severity Chrome flaw with public exploit",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-high-severity-chrome-flaw-with-public-exploit/",
    "date": "2025-05-15T08:25:44.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has released emergency security updates to patch a high-severity Chrome vulnerability that has a public exploit and can let attackers hijack accounts. [...]..."
  },
  {
    "title": "New Chrome Vulnerability Enables Cross-Origin Data Leak via Loader Referrer Policy",
    "link": "https://thehackernews.com/2025/05/new-chrome-vulnerability-enables-cross.html",
    "date": "2025-05-15T06:15:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Wednesday released updates to address four security issues in its Chrome web browser, including one for which it said there exists an exploit in the wild.\nThe high-severity vulnerability, tr..."
  },
  {
    "title": "Infosec Layoffs Aren't the Bargain That Boards May Think",
    "link": "https://www.darkreading.com/cyber-risk/infosec-layoffs-arent-bargain-boards-may-think",
    "date": "2025-05-14T21:23:55.000Z",
    "source": "Dark Reading",
    "summary": "Salary savings come with hidden costs, including insider threats and depleted cybersecurity defenses, conveying advantages to skilled adversaries, experts argue...."
  },
  {
    "title": "AI Agents May Have a Memory Problem",
    "link": "https://www.darkreading.com/cyber-risk/ai-agents-memory-problem",
    "date": "2025-05-14T21:23:30.000Z",
    "source": "Dark Reading",
    "summary": "A new study by researchers at Princeton University and Sentient shows it's surprisingly easy to trigger malicious behavior from AI agents by implanting fake \"memories\" into the data they rely on for m..."
  },
  {
    "title": "Ivanti EPMM Zero-Day Flaws Exploited in Chained Attack",
    "link": "https://www.darkreading.com/endpoint-security/ivanti-epmm-zero-day-flaws-exploited",
    "date": "2025-05-14T20:34:30.000Z",
    "source": "Dark Reading",
    "summary": "The security software maker said the vulnerabilities in Endpoint Manager Mobile have been exploited in the wild against \"a very limited number of customers\" — for now — and stem from open source libra..."
  },
  {
    "title": "Google Chrome to block admin-level browser launches for better security",
    "link": "https://www.bleepingcomputer.com/news/google/google-chrome-to-block-admin-level-browser-launches-for-better-security/",
    "date": "2025-05-14T20:25:39.000Z",
    "source": "Bleeping Computer",
    "summary": "Google is rolling out a change to Chromium that \"de-elevates\" Google Chrome so it does not run as an administrator to increase security in Windows. [...]..."
  },
  {
    "title": "Hackers behind UK retail attacks now targeting US companies",
    "link": "https://www.bleepingcomputer.com/news/security/google-scattered-spider-switches-targets-to-us-retail-chains/",
    "date": "2025-05-14T19:38:53.000Z",
    "source": "Bleeping Computer",
    "summary": "Google warned today that hackers using Scattered Spider tactics against retail chains in the United Kingdom have also started targeting retailers in the United States. [...]..."
  },
  {
    "title": "Samsung Patches CVE-2025-4632 Used to Deploy Mirai Botnet via MagicINFO 9 Exploit",
    "link": "https://thehackernews.com/2025/05/samsung-patches-cve-2025-4632-used-to.html",
    "date": "2025-05-14T17:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Samsung has released software updates to address a critical security flaw in MagicINFO 9 Server that has been actively exploited in the wild.\nThe vulnerability, tracked as CVE-2025-4632 (CVSS score: 9..."
  },
  {
    "title": "BianLian and RansomExx Exploit SAP NetWeaver Flaw to Deploy PipeMagic Trojan",
    "link": "https://thehackernews.com/2025/05/bianlian-and-ransomexx-exploit-sap.html",
    "date": "2025-05-14T17:50:00.000Z",
    "source": "The Hacker News",
    "summary": "At least two different cybercrime groups BianLian and RansomExx are said to have exploited a recently disclosed security flaw in SAP NetWeaver tracked as CVE-2025-31324, indicating that multiple threa..."
  },
  {
    "title": "Ransomware gangs join ongoing SAP NetWeaver attacks",
    "link": "https://www.bleepingcomputer.com/news/security/ransomware-gangs-join-ongoing-sap-netweaver-attacks/",
    "date": "2025-05-14T17:39:41.000Z",
    "source": "Bleeping Computer",
    "summary": "Ransomware gangs have joined ongoing SAP NetWeaver attacks, exploiting a maximum-severity vulnerability that allows threat actors to gain remote code execution on vulnerable servers. [...]..."
  },
  {
    "title": "Australian Human Rights Commission leaks docs to search engines",
    "link": "https://www.bleepingcomputer.com/news/security/australian-human-rights-commission-leaks-docs-to-search-engines/",
    "date": "2025-05-14T16:28:31.000Z",
    "source": "Bleeping Computer",
    "summary": "The Australian Human Rights Commission (AHRC) disclosed a data breach incident where private documents leaked online and were indexed by major search engines. [...]..."
  },
  {
    "title": "Xinbi Telegram Market Tied to $8.4B in Crypto Crime, Romance Scams, North Korea Laundering",
    "link": "https://thehackernews.com/2025/05/xinbi-telegram-market-tied-to-84b-in.html",
    "date": "2025-05-14T15:27:00.000Z",
    "source": "The Hacker News",
    "summary": "A Chinese-language, Telegram-based marketplace called Xinbi Guarantee has facilitated no less than $8.4 billion in transactions since 2022, making it the second major black market to be exposed after ..."
  },
  {
    "title": "Microsoft fixes Linux boot issues on dual-boot Windows systems",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-linux-boot-issues-on-dual-boot-windows-systems/",
    "date": "2025-05-14T14:50:45.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft has fixed a known issue preventing Linux from booting on dual-boot systems with Secure Boot enabled after installing the August 2024 Windows security updates. [...]..."
  },
  {
    "title": "Steel giant Nucor Corporation facing disruptions after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/steel-giant-nucor-corporation-facing-disruptions-after-cyberattack/",
    "date": "2025-05-14T14:39:20.000Z",
    "source": "Bleeping Computer",
    "summary": "A cybersecurity incident on Nucor Corporation's systems forced the company to take offline parts of its networks and implement containment measures. [...]..."
  },
  {
    "title": "Marks &amp; Spencer Confirms Customer Data Stolen in Cyberattack",
    "link": "https://www.darkreading.com/threat-intelligence/marks-spencer-confirms-customer-data-stolen",
    "date": "2025-05-14T14:33:49.000Z",
    "source": "Dark Reading",
    "summary": "The British retailer said no account passwords were compromised in last month's cyberattack, but the company will require customers to reset passwords \"for extra peace of mind.\"..."
  },
  {
    "title": "Windows 10 and Microsoft 365 support deadlines didn't change - why this story just won't die",
    "link": "https://www.zdnet.com/article/windows-10-and-microsoft-365-support-deadlines-didnt-change-why-this-story-just-wont-die/",
    "date": "2025-05-14T14:24:00.000Z",
    "source": "ZDNet Security",
    "summary": "No, Microsoft has not changed Windows 10 or Microsoft 365 support deadlines. Here's what actually happened...."
  },
  {
    "title": "LastPass can now monitor employees' rogue reliance on shadow SaaS - including AI tools",
    "link": "https://www.zdnet.com/article/lastpass-can-now-monitor-employees-rogue-reliance-on-shadow-saas-including-ai-tools/",
    "date": "2025-05-14T14:14:00.000Z",
    "source": "ZDNet Security",
    "summary": "The password manager's new SaaS monitoring feature offers your business an affordable way to contain the risks of shadow IT and its latest variant - shadow AI...."
  },
  {
    "title": "CTM360 Identifies Surge in Phishing Attacks Targeting Meta Business Users",
    "link": "https://thehackernews.com/2025/05/ctm360-identifies-surge-in-phishing.html",
    "date": "2025-05-14T14:05:00.000Z",
    "source": "The Hacker News",
    "summary": "A new global phishing threat called \"Meta Mirage\" has been uncovered, targeting businesses using Meta's Business Suite. This campaign specifically aims at hijacking high-value accounts, including thos..."
  },
  {
    "title": "Focused Phishing: Attack Targets Victims With Trusted Sites and Live Validation",
    "link": "https://www.bleepingcomputer.com/news/security/focused-phishing-attack-targets-victims-with-trusted-sites-and-live-validation/",
    "date": "2025-05-14T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "New phishing tactics are abusing trusted domains, real CAPTCHAs, and server-side email validation to selectively target victims with customized fake login pages. Keep Aware's latest research breaks do..."
  },
  {
    "title": "Congress Should Tackle Cyber Threats, Not Competition",
    "link": "https://www.darkreading.com/vulnerabilities-threats/congress-cyber-threats-competition",
    "date": "2025-05-14T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Some members of Congress seem more intent on grabbing headlines than actually working to make America more cyber secure...."
  },
  {
    "title": "Fashion giant Dior discloses cyberattack, warns of data breach",
    "link": "https://www.bleepingcomputer.com/news/security/fashion-giant-dior-discloses-cyberattack-warns-of-data-breach/",
    "date": "2025-05-14T13:37:35.000Z",
    "source": "Bleeping Computer",
    "summary": "House of Dior, the French luxury fashion brand commonly referred to as Dior, has disclosed a cybersecurity incident that has exposed customer information. [...]..."
  },
  {
    "title": "Kosovo extradites BlackDB admin to face US cybercrime charges",
    "link": "https://www.bleepingcomputer.com/news/security/kosovo-extradites-blackdb-admin-to-face-us-cybercrime-charges/",
    "date": "2025-05-14T13:22:06.000Z",
    "source": "Bleeping Computer",
    "summary": "A Kosovo national has been extradited to the United States to face charges of running an online cybercrime marketplace active since 2018. [...]..."
  },
  {
    "title": "Orca Security Gets AI-Powered Remediation From Opus Deal",
    "link": "https://www.darkreading.com/cloud-security/orca-security-ai-powered-remediation-opus",
    "date": "2025-05-14T12:38:22.000Z",
    "source": "Dark Reading",
    "summary": "The acquisition will enhance Orca's CNAPP offering with autonomous vulnerability remediation and prevention technologies from Opus...."
  },
  {
    "title": "Patch Tuesday, May 2025 Edition",
    "link": "https://krebsonsecurity.com/2025/05/patch-tuesday-may-2025-edition/",
    "date": "2025-05-14T11:57:48.000Z",
    "source": "Krebs on Security",
    "summary": "Microsoft on Tuesday released software updates to fix at least 70 vulnerabilities in Windows and related products, including five zero-day flaws that are already seeing active exploitation. Adding to ..."
  },
  {
    "title": "Earth Ammit Breached Drone Supply Chains via ERP in VENOM, TIDRONE Campaigns",
    "link": "https://thehackernews.com/2025/05/earth-ammit-breached-drone-supply.html",
    "date": "2025-05-14T11:11:00.000Z",
    "source": "The Hacker News",
    "summary": "A cyber espionage group known as Earth Ammit has been linked to two related but distinct campaigns from 2023 to 2024 targeting various entities in Taiwan and South Korea, including military, satellite..."
  },
  {
    "title": "Learning How to Hack: Why Offensive Security Training Benefits Your Entire Security Team",
    "link": "https://thehackernews.com/2025/05/learning-how-to-hack-why-offensive.html",
    "date": "2025-05-14T10:54:00.000Z",
    "source": "The Hacker News",
    "summary": "Organizations across industries are experiencing significant escalations in cyberattacks, particularly targeting critical infrastructure providers and cloud-based enterprises. Verizon’s recently relea..."
  },
  {
    "title": "Horabot Malware Targets 6 Latin American Nations Using Invoice-Themed Phishing Emails",
    "link": "https://thehackernews.com/2025/05/horabot-malware-targets-6-latin.html",
    "date": "2025-05-14T10:40:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new phishing campaign that's being used to distribute malware called Horabot targeting Windows users in Latin American countries like Mexico, Guatemala, Col..."
  },
  {
    "title": "Rebooting your phone daily is your best defense against zero-click attacks - here's why",
    "link": "https://www.zdnet.com/article/rebooting-your-phone-daily-is-your-best-defense-against-zero-click-attacks-heres-why/",
    "date": "2025-05-14T09:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "Phone hacking technologies are getting stealthier. It's time to treat your phone like a computer, says this cybersecurity expert...."
  },
  {
    "title": "Microsoft Fixes 78 Flaws, 5 Zero-Days Exploited; CVSS 10 Bug Impacts Azure DevOps Server",
    "link": "https://thehackernews.com/2025/05/microsoft-fixes-78-flaws-5-zero-days.html",
    "date": "2025-05-14T08:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Tuesday shipped fixes to address a total of 78 security flaws across its software lineup, including a set of five zero-days that have come under active exploitation in the wild.\nOf the 78..."
  },
  {
    "title": "Fortinet Patches CVE-2025-32756 Zero-Day RCE Flaw Exploited in FortiVoice Systems",
    "link": "https://thehackernews.com/2025/05/fortinet-patches-cve-2025-32756-zero.html",
    "date": "2025-05-14T04:21:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortinet has patched a critical security flaw that it said has been exploited as a zero-day in attacks targeting FortiVoice enterprise phone systems.\nThe vulnerability, tracked as CVE-2025-32756, carr..."
  }
]