[
  {
    "title": "Six for 2026: The cyber threats you can’t ignore",
    "link": "https://www.bleepingcomputer.com/news/security/six-for-2026-the-cyber-threats-you-cant-ignore/",
    "date": "2026-01-08T15:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Cybersecurity threats in 2026 are accelerating, driven by AI, automation, and more effective social engineering. Corelight outlines six emerging attack trends and explains how network visibility can h..."
  },
  {
    "title": "ThreatsDay Bulletin: RustFS Flaw, Iranian Ops, WebUI RCE, Cloud Leaks, and 12 More Stories",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-rustfs-flaw-iranian.html",
    "date": "2026-01-08T12:49:00.000Z",
    "source": "The Hacker News",
    "summary": "The internet never stays quiet. Every week, new hacks, scams, and security problems show up somewhere.\nThis week’s stories show how fast attackers change their tricks, how small mistakes turn into big..."
  },
  {
    "title": "Microsoft Exchange Online outage blocks access to mailboxes via IMAP4",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-online-outage-blocks-access-to-mailboxes-via-imap4/",
    "date": "2026-01-08T12:45:35.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is working to fix an Exchange Online service outage that intermittently prevents users from accessing their mailboxes via the Internet Mailbox Access Protocol 4 (IMAP4). [...]..."
  },
  {
    "title": "Microsoft to enforce MFA for Microsoft 365 admin center sign-ins",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-enforce-mfa-for-microsoft-365-admin-center-sign-ins/",
    "date": "2026-01-08T12:10:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft will start enforcing multi-factor authentication (MFA) for all users accessing the Microsoft 365 admin center starting next month. [...]..."
  },
  {
    "title": "The State of Trusted Open Source",
    "link": "https://thehackernews.com/2026/01/the-state-of-trusted-open-source.html",
    "date": "2026-01-08T11:50:00.000Z",
    "source": "The Hacker News",
    "summary": "Chainguard, the trusted source for open source, has a unique view into how modern organizations actually consume open source software and where they run into risk and operational burdens. Across a gro..."
  },
  {
    "title": "Cisco Patches ISE Security Vulnerability After Public PoC Exploit Release",
    "link": "https://thehackernews.com/2026/01/cisco-patches-ise-security.html",
    "date": "2026-01-08T10:44:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has released updates to address a medium-severity security flaw in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) with a public proof-of-concept (PoC) exploit.\nThe v..."
  },
  {
    "title": "Researchers Uncover NodeCordRAT Hidden in npm Bitcoin-Themed Packages",
    "link": "https://thehackernews.com/2026/01/researchers-uncover-nodecordrat-hidden.html",
    "date": "2026-01-08T10:31:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered three malicious npm packages that are designed to deliver a previously undocumented malware called NodeCordRAT.\nThe names of the packages, all of which were t..."
  },
  {
    "title": "Coolify Discloses 11 Critical Flaws Enabling Full Server Compromise on Self-Hosted Instances",
    "link": "https://thehackernews.com/2026/01/coolify-discloses-11-critical-flaws.html",
    "date": "2026-01-08T09:53:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of multiple critical-severity security flaws affecting Coolify, an open-source, self-hosting platform, that could result in authentication bypass and r..."
  },
  {
    "title": "Cisco warns of Identity Service Engine flaw with exploit code",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-identity-service-engine-flaw-with-exploit-code/",
    "date": "2026-01-08T09:13:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco has patched an ISE vulnerability with public proof-of-concept exploit code that can be abused by attackers with admin privileges. [...]..."
  },
  {
    "title": "CISA tags max severity HPE OneView flaw as actively exploited",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-tags-max-severity-hpe-oneview-flaw-as-actively-exploited/",
    "date": "2026-01-08T07:45:25.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has flagged a maximum-severity HPE OneView vulnerability as actively exploited in attacks. [...]..."
  },
  {
    "title": "OpenAI Launches ChatGPT Health with Isolated, Encrypted Health Data Controls",
    "link": "https://thehackernews.com/2026/01/openai-launches-chatgpt-health-with.html",
    "date": "2026-01-08T06:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence (AI) company OpenAI on Wednesday announced the launch of ChatGPT Health, a dedicated space that allows users to have conversations with the chatbot about their health.\nTo that ..."
  },
  {
    "title": "CISA Flags Microsoft Office and HPE OneView Bugs as Actively Exploited",
    "link": "https://thehackernews.com/2026/01/cisa-flags-microsoft-office-and-hpe.html",
    "date": "2026-01-08T04:52:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added two security flaws impacting Microsoft Office and Hewlett Packard Enterprise (HPE) OneView to its Known Exploited Vu..."
  },
  {
    "title": "OpenAI says ChatGPT won't use your health information to train its models",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-says-chatgpt-wont-use-your-health-information-to-train-its-models/",
    "date": "2026-01-07T23:28:45.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is rolling out ChatGPT Health, which is a dedicated space for health conversations. Amidst privacy concerns, OpenAI said it won't use your health data. [...]..."
  },
  {
    "title": "New GoBruteforcer attack wave targets crypto, blockchain projects",
    "link": "https://www.bleepingcomputer.com/news/security/new-gobruteforcer-attack-wave-targets-crypto-blockchain-projects/",
    "date": "2026-01-07T23:18:14.000Z",
    "source": "Bleeping Computer",
    "summary": "A new wave of GoBruteforcer botnet malware attacks is targeting databases of cryptocurrency and blockchain projects on exposed servers believed to be configured using AI-generated examples. [...]..."
  },
  {
    "title": "Attackers Exploit Zero-Day in End-of-Life D-Link Routers",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/attackers-exploit-zero-day-end-of-life-d-link-routers",
    "date": "2026-01-07T22:19:57.000Z",
    "source": "Dark Reading",
    "summary": "Hackers are attacking a critical zero-day flaw in unsupported D-Link DSL routers to run arbitrary commands...."
  },
  {
    "title": "Critical jsPDF flaw lets hackers steal secrets via generated PDFs",
    "link": "https://www.bleepingcomputer.com/news/security/critical-jspdf-flaw-lets-hackers-steal-secrets-via-generated-pdfs/",
    "date": "2026-01-07T21:46:29.000Z",
    "source": "Bleeping Computer",
    "summary": "The jsPDF library for generating PDF documents in JavaScript applications is vulnerable to a critical vulnerability that allows an attacker to steal sensitive data from the local filesystem by includi..."
  },
  {
    "title": "Phishers Exploit Office 365 Users Who Let Their Guard Down",
    "link": "https://www.darkreading.com/cloud-security/phishers-exploit-office-365-users-guard-down",
    "date": "2026-01-07T21:42:21.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft said that Office 365 tenants with weak configurations and who don't have strict anti-spoofing protection enabled are especially vulnerable...."
  },
  {
    "title": "ChatGPT is losing market share as Google Gemini gains ground",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-is-losing-market-share-as-google-gemini-gains-ground/",
    "date": "2026-01-07T20:58:02.000Z",
    "source": "Bleeping Computer",
    "summary": "New data suggests that ChatGPT is losing its market share to Gemini on the web. It's unclear if Gemini is also gaining ground in the mobile space. [...]..."
  },
  {
    "title": "Logitech Options+, G HUB macOS apps break after certificate expires",
    "link": "https://www.bleepingcomputer.com/news/hardware/logitech-options-plus-g-hub-macos-apps-break-after-certificate-expires/",
    "date": "2026-01-07T18:05:42.000Z",
    "source": "Bleeping Computer",
    "summary": "Logitech's Options+ and G Hub apps on macOS stopped working after their code-signing certificate expired, leaving users unable to launch them on Apple systems. [...]..."
  },
  {
    "title": "Max severity Ni8mare flaw lets hackers hijack n8n servers",
    "link": "https://www.bleepingcomputer.com/news/security/max-severity-ni8mare-flaw-lets-hackers-hijack-n8n-servers/",
    "date": "2026-01-07T17:41:10.000Z",
    "source": "Bleeping Computer",
    "summary": "A maximum severity vulnerability dubbed \"Ni8mare\" allows remote, unauthenticated attackers to take control over locally deployed instances of the N8N workflow automation platform. [...]..."
  },
  {
    "title": "Webinar: Learn How AI-Powered Zero Trust Detects Attacks with No Files or Indicators",
    "link": "https://thehackernews.com/2026/01/webinar-learn-how-ai-powered-zero-trust.html",
    "date": "2026-01-07T17:19:00.000Z",
    "source": "The Hacker News",
    "summary": "Security teams are still catching malware. The problem is what they're not catching.\nMore attacks today don't arrive as files. They don't drop binaries. They don't trigger classic alerts. Instead, the..."
  },
  {
    "title": "Black Cat Behind SEO Poisoning Malware Campaign Targeting Popular Software Searches",
    "link": "https://thehackernews.com/2026/01/black-cat-behind-seo-poisoning-malware.html",
    "date": "2026-01-07T17:09:00.000Z",
    "source": "The Hacker News",
    "summary": "A cybercrime gang known as Black Cat has been attributed to a search engine optimization (SEO) poisoning campaign that employs fraudulent sites advertising popular software to trick users into downloa..."
  },
  {
    "title": "Microsoft: Classic Outlook bug prevents opening encrypted emails",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-classic-outlook-bug-prevents-opening-encrypted-emails/",
    "date": "2026-01-07T16:30:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed a known issue that prevents recipients from opening encrypted emails in classic Outlook. [...]..."
  },
  {
    "title": "In 2026, Hackers Want AI: Threat Intel on Vibe Hacking & HackGPT",
    "link": "https://www.bleepingcomputer.com/news/security/in-2026-hackers-want-ai-threat-intel-on-vibe-hacking-and-hackgpt/",
    "date": "2026-01-07T15:00:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Cybercriminals are increasingly using AI to lower the barrier to entry for fraud and hacking, shifting from skill-based to AI-assisted attacks known as \"vibe hacking.\" Flare examines how underground f..."
  },
  {
    "title": "Cyberattacks Likely Part of Military Operation in Venezuela",
    "link": "https://www.darkreading.com/cybersecurity-operations/cyberattacks-part-military-operation-venezuela",
    "date": "2026-01-07T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Cyber's role in the US raid on Venezuela remains a question, though President Trump alluded to \"certain expertise\" in shutting down the power grid in Caracas...."
  },
  {
    "title": "DDoSia Powers Affiliate-Driven Hacktivist Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/ddosia-powers-volunteer-driven-hacktivist-attacks",
    "date": "2026-01-07T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Pro-Russian group NoName057(16) uses a custom denial-of-service tool to mobilize volunteers and disrupt government, media, and institutional sites tied to Ukraine and the West...."
  },
  {
    "title": "Critical n8n Vulnerability (CVSS 10.0) Allows Unauthenticated Attackers to Take Full Control",
    "link": "https://thehackernews.com/2026/01/critical-n8n-vulnerability-cvss-100.html",
    "date": "2026-01-07T13:48:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of yet another maximum-severity security flaw in n8n, a popular workflow automation platform, that allows an unauthenticated remote attacker to gain co..."
  },
  {
    "title": "Lack of MFA Is Common Thread in Vast Cloud Credential Heist",
    "link": "https://www.darkreading.com/cloud-security/lack-mfa-common-thread-vast-cloud-credential-heist",
    "date": "2026-01-07T12:35:46.000Z",
    "source": "Dark Reading",
    "summary": "An emerging threat actor that goes by \"Zestix\" used an assortment of infostealers to obtain credentials and breach file-sharing instances of approximately 50 enterprises...."
  },
  {
    "title": "n8n Warns of CVSS 10.0 RCE Vulnerability Affecting Self-Hosted and Cloud Versions",
    "link": "https://thehackernews.com/2026/01/n8n-warns-of-cvss-100-rce-vulnerability.html",
    "date": "2026-01-07T11:26:00.000Z",
    "source": "The Hacker News",
    "summary": "Open-source workflow automation platform n8n has warned of a maximum-severity security flaw that, if successfully exploited, could result in authenticated remote code execution (RCE).\nThe vulnerabilit..."
  },
  {
    "title": "The Future of Cybersecurity Includes Non-Human Employees",
    "link": "https://thehackernews.com/2026/01/the-future-of-cybersecurity-includes.html",
    "date": "2026-01-07T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Non-human employees are becoming the future of cybersecurity, and enterprises need to prepare accordingly. As organizations scale Artificial Intelligence (AI) and cloud automation, there is exponentia..."
  }
]