[
  {
    "title": "New Chrome Zero-Day Actively Exploited; Google Issues Emergency Out-of-Band Patch",
    "link": "https://thehackernews.com/2025/06/new-chrome-zero-day-actively-exploited.html",
    "date": "2025-06-03T04:22:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Monday released out-of-band fixes to address three security issues in its Chrome browser, including one that it said has come under active exploitation in the wild.\nThe high-severity flaw is..."
  },
  {
    "title": "Cartier discloses data breach amid fashion brand cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/cartier-discloses-data-breach-amid-fashion-brand-cyberattacks/",
    "date": "2025-06-02T22:31:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Luxury fashion brand Cartier is warning customers it suffered a data breach that exposed customers' personal information after its systems were compromised. [...]..."
  },
  {
    "title": "EMR-ISAC Shuts Down: What Happens Now?",
    "link": "https://www.darkreading.com/threat-intelligence/emr-isac-shuts-down-what-now",
    "date": "2025-06-02T21:28:37.000Z",
    "source": "Dark Reading",
    "summary": "The Emergency Management and Response - Information Sharing and Analysis Center provided essential information to the emergency services sector on physical and cyber threats and its closure leaves an ..."
  },
  {
    "title": "Exploitation Risk Grows for Critical Cisco Bug",
    "link": "https://www.darkreading.com/vulnerabilities-threats/exploitation-risk-grows-critical-cisco-bug",
    "date": "2025-06-02T21:20:59.000Z",
    "source": "Dark Reading",
    "summary": "New details on the Cisco IOS XE vulnerability could help attackers develop a working exploit soon, researchers say...."
  },
  {
    "title": "Trickbot, Conti Ransomware Operator Unmasked Amid Huge Ops Leak",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/trickbot-conti-ransomware-operator-unmasked",
    "date": "2025-06-02T19:00:52.000Z",
    "source": "Dark Reading",
    "summary": "An anonymous whistleblower has leaked large amounts of data tied to the alleged operator behind Trickbot and Conti ransomware...."
  },
  {
    "title": "The North Face warns customers of April credential stuffing attack",
    "link": "https://www.bleepingcomputer.com/news/security/the-north-face-warns-customers-of-april-credential-stuffing-attack/",
    "date": "2025-06-02T18:37:19.000Z",
    "source": "Bleeping Computer",
    "summary": "Outdoor apparel retailer The North Face is warning customers that their personal information was stolen in credential stuffing attacks targeting the company's website in April. [...]..."
  },
  {
    "title": "SentinelOne: Last week’s 7-hour outage caused by software flaw",
    "link": "https://www.bleepingcomputer.com/news/technology/sentinelone-last-weeks-7-hour-outage-caused-by-software-flaw/",
    "date": "2025-06-02T18:24:17.000Z",
    "source": "Bleeping Computer",
    "summary": "American cybersecurity company SentinelOne revealed over the weekend that a software flaw triggered a seven-hour-long outage on Thursday. [...]..."
  },
  {
    "title": "Google Chrome to distrust Chunghwa Telecom, Netlock certificates in August",
    "link": "https://www.bleepingcomputer.com/news/security/google-chrome-to-distrust-chunghwa-telecom-netlock-certificates-in-august/",
    "date": "2025-06-02T17:36:30.000Z",
    "source": "Bleeping Computer",
    "summary": "Google says it will no longer trust root CA certificates signed by Chunghwa Telecom and Netlock in the Chrome Root Store due to a pattern of compliance failures and failure to make improvements. [...]..."
  },
  {
    "title": "Southwest has new rule that changes how you charge your phone mid-flight",
    "link": "https://www.zdnet.com/article/southwest-airlines-introduces-new-rules-about-how-you-charge-your-phone-in-flight/",
    "date": "2025-06-02T17:14:30.000Z",
    "source": "ZDNet Security",
    "summary": "Packing a portable charger for your next flight? Better read up on Southwest's latest policy change...."
  },
  {
    "title": "Microsoft and CrowdStrike partner to link hacking group names",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-and-crowdstrike-partner-to-link-hacking-group-names/",
    "date": "2025-06-02T16:56:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft and CrowdStrike announced today that they've partnered to connect the aliases used for specific threat groups without actually using a single naming standard. [...]..."
  },
  {
    "title": "Cryptojacking Campaign Exploits DevOps APIs Using Off-the-Shelf Tools from GitHub",
    "link": "https://thehackernews.com/2025/06/cryptojacking-campaign-exploits-devops.html",
    "date": "2025-06-02T16:03:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new cryptojacking campaign that's targeting publicly accessible DevOps web servers such as those associated with Docker, Gitea, and HashiCorp Consul and Nom..."
  },
  {
    "title": "Australia Begins New Ransomware Payment Disclosure Rules",
    "link": "https://www.darkreading.com/threat-intelligence/australia-ransomware-payment-disclosure-rules",
    "date": "2025-06-02T15:50:22.000Z",
    "source": "Dark Reading",
    "summary": "The country will require certain organizations to report ransomware payments and communications within 72 hours after they're made or face potential civil penalties...."
  },
  {
    "title": "Critical Bugs Could Spark Takeover of Widely Used Fire Safety OT/ICS Platform",
    "link": "https://www.darkreading.com/vulnerabilities-threats/critical-bugs-takeover-fire-safety-ot-ics-platform",
    "date": "2025-06-02T15:46:01.000Z",
    "source": "Dark Reading",
    "summary": "The unpatched security vulnerabilities in Consilium Safety's CS5000 Fire Panel could create \"serious safety issues\" in environments where fire suppression and safety are paramount, according to a CISA..."
  },
  {
    "title": "Preinstalled Apps on Ulefone, Krüger&Matz Phones Let Any App Reset Device, Steal PIN",
    "link": "https://thehackernews.com/2025/06/preinstalled-apps-on-ulefone-kruger.html",
    "date": "2025-06-02T15:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Three security vulnerabilities have been disclosed in preloaded Android applications on smartphones from Ulefone and Krüger&Matz that could enable any app installed on the device to perform a factory ..."
  },
  {
    "title": "‘Russian Market’ emerges as a go-to shop for stolen credentials",
    "link": "https://www.bleepingcomputer.com/news/security/russian-market-emerges-as-a-go-to-shop-for-stolen-credentials/",
    "date": "2025-06-02T14:28:33.000Z",
    "source": "Bleeping Computer",
    "summary": "The \"Russian Market\" cybercrime marketplace has emerged as one of the most popular platforms for buying and selling credentials stolen by information stealer malware. [...]..."
  },
  {
    "title": "Qualcomm Fixes 3 Zero-Days Used in Targeted Android Attacks via Adreno GPU",
    "link": "https://thehackernews.com/2025/06/qualcomm-fixes-3-zero-days-used-in.html",
    "date": "2025-06-02T14:22:00.000Z",
    "source": "The Hacker News",
    "summary": "Qualcomm has shipped security updates to address three zero-day vulnerabilities that it said have been exploited in limited, targeted attacks in the wild.\nThe flaws in question, which were responsibly..."
  },
  {
    "title": "Beyond the Broken Wall: Why the Security Perimeter Is Not Enough",
    "link": "https://www.darkreading.com/endpoint-security/beyond-broken-wall-why-security-perimeter-not-enough",
    "date": "2025-06-02T14:00:34.000Z",
    "source": "Dark Reading",
    "summary": "Organizations need to abandon perimeter-based security for data-centric protection strategies in today's distributed IT environments...."
  },
  {
    "title": "In the AI Race With China, Don't Forget About Security",
    "link": "https://www.darkreading.com/vulnerabilities-threats/ai-race-china-dont-forget-about-security",
    "date": "2025-06-02T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The US needs to establish a clear framework to provide reasonable guardrails to protect its interests — the quicker, the better...."
  },
  {
    "title": "Microsoft ships emergency patch to fix Windows 11 startup failures",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-ships-emergency-patch-to-fix-windows-11-installation-issues/",
    "date": "2025-06-02T12:06:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released an out-of-band update to address a known issue causing some Windows 11 systems to enter recovery and fail to start after installing the KB5058405 May 2025 security update. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: APT Intrusions, AI Malware, Zero-Click Exploits, Browser Hijacks and More",
    "link": "https://thehackernews.com/2025/06/weekly-recap-apt-intrusions-ai-malware.html",
    "date": "2025-06-02T11:23:00.000Z",
    "source": "The Hacker News",
    "summary": "If this had been a security drill, someone would’ve said it went too far. But it wasn’t a drill—it was real. The access? Everything looked normal. The tools? Easy to find. The detection? Came too late..."
  },
  {
    "title": "Qualcomm fixes three Adreno GPU zero-days exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/qualcomm-fixes-three-adreno-gpu-zero-days-exploited-in-attacks/",
    "date": "2025-06-02T11:11:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Qualcomm has released security patches for three zero-day vulnerabilities in the Adreno Graphics Processing Unit (GPU) driver that impact dozens of chipsets and are actively exploited in targeted atta..."
  },
  {
    "title": "The Secret Defense Strategy of Four Critical Industries Combating Advanced Cyber Threats",
    "link": "https://thehackernews.com/2025/06/the-secret-defense-strategy-of-four.html",
    "date": "2025-06-02T10:55:00.000Z",
    "source": "The Hacker News",
    "summary": "The evolution of cyber threats has forced organizations across all industries to rethink their security strategies. As attackers become more sophisticated — leveraging encryption, living-off-the-land ..."
  },
  {
    "title": "Fake Recruiter Emails Target CFOs Using Legit NetBird Tool Across 6 Global Regions",
    "link": "https://thehackernews.com/2025/06/fake-recruiter-emails-target-cfos-using.html",
    "date": "2025-06-02T05:51:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have warned of a new spear-phishing campaign that uses a legitimate remote access tool called Netbird to target Chief Financial Officers (CFOs) and financial executives at ba..."
  },
  {
    "title": "Exploit details for max severity Cisco IOS XE flaw now public",
    "link": "https://www.bleepingcomputer.com/news/security/exploit-details-for-max-severity-cisco-ios-xe-flaw-now-public/",
    "date": "2025-05-31T14:09:19.000Z",
    "source": "Bleeping Computer",
    "summary": "Technical details about a maximum-severity Cisco IOS XE WLC arbitrary file upload flaw tracked as CVE-2025-20188 have been made publicly available, bringing us closer to a working exploit. [...]..."
  },
  {
    "title": "New Linux Flaws Allow Password Hash Theft via Core Dumps in Ubuntu, RHEL, Fedora",
    "link": "https://thehackernews.com/2025/05/new-linux-flaws-allow-password-hash.html",
    "date": "2025-05-31T10:19:00.000Z",
    "source": "The Hacker News",
    "summary": "Two information disclosure flaws have been identified in apport and systemd-coredump, the core dump handlers in Ubuntu, Red Hat Enterprise Linux, and Fedora, according to the Qualys Threat Research Un..."
  },
  {
    "title": "U.S. DoJ Seizes 4 Domains Supporting Cybercrime Crypting Services in Global Operation",
    "link": "https://thehackernews.com/2025/05/us-doj-seizes-4-domains-supporting.html",
    "date": "2025-05-31T07:16:00.000Z",
    "source": "The Hacker News",
    "summary": "A multinational law enforcement operation has resulted in the takedown of an online cybercrime syndicate that offered services to threat actors to ensure that their malicious software stayed undetecte..."
  },
  {
    "title": "'Earth Lamia' Exploits Known SQL, RCE Bugs Across Asia",
    "link": "https://www.darkreading.com/threat-intelligence/earth-lamia-exploits-sql-rce-bugs-asia",
    "date": "2025-05-30T20:13:59.000Z",
    "source": "Dark Reading",
    "summary": "A \"highly active\" Chinese threat group is taking proverbial candy from babies, exploiting known bugs in exposed servers to steal data from organizations in sensitive sectors...."
  },
  {
    "title": "Hackers are exploiting critical flaw in vBulletin forum software",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-are-exploiting-critical-flaw-in-vbulletin-forum-software/",
    "date": "2025-05-30T19:26:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Two critical vulnerabilities affecting the open-source forum software vBulletin have been discovered, with one confirmed to be actively exploited in the wild. [...]..."
  },
  {
    "title": "FBI Warns of Filipino Tech Company Running Sprawling Crypto Scams",
    "link": "https://www.darkreading.com/threat-intelligence/fbi-warns-tech-company-crypto-scams",
    "date": "2025-05-30T18:44:02.000Z",
    "source": "Dark Reading",
    "summary": "The US Treasury said cryptocurrency investment schemes like the ones facilitated by Funnull Technology Inc. have cost Americans billions of dollars annually...."
  },
  {
    "title": "Microsoft now testing Notepad text formatting in Windows 11",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-now-testing-notepad-text-formatting-in-windows-11/",
    "date": "2025-05-30T18:41:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced today that the Windows 11 Notepad application is getting a text formatting feature supporting Markdown-style input. [...]..."
  }
]