[
  {
    "title": "[Dark Reading Virtual Event] Know Your Enemy: How cybercriminals and nation-state hackers operate",
    "link": "https://www.darkreading.com/events/-dark-reading-virtual-event-know-your-enemy-how-cybercriminals-and-nation-state-hackers-operate",
    "date": "2025-10-01T12:50:14.743Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "2025 Cybersecurity Reality Check: Breaches Hidden, Attack Surfaces Growing, and AI Misperceptions Rising",
    "link": "https://thehackernews.com/2025/10/2025-cybersecurity-reality-check.html",
    "date": "2025-10-01T11:07:00.000Z",
    "source": "The Hacker News",
    "summary": "Bitdefender’s 2025 Cybersecurity Assessment Report paints a sobering picture of today’s cyber defense landscape: mounting pressure to remain silent after breaches, a gap between leadership and frontli..."
  },
  {
    "title": "Hackers Exploit Milesight Routers to Send Phishing SMS to European Users",
    "link": "https://thehackernews.com/2025/10/hackers-exploit-milesight-routers-to.html",
    "date": "2025-10-01T11:07:00.000Z",
    "source": "The Hacker News",
    "summary": "Unknown threat actors are abusing Milesight industrial cellular routers to send SMS messages as part of a smishing campaign targeting users in European countries since at least February 2022.\nFrench c..."
  },
  {
    "title": "New Android Banking Trojan “Klopatra” Uses Hidden VNC to Control Infected Smartphones",
    "link": "https://thehackernews.com/2025/10/new-android-banking-trojan-klopatra.html",
    "date": "2025-10-01T09:25:00.000Z",
    "source": "The Hacker News",
    "summary": "A previously undocumented Android banking trojan called Klopatra has compromised over 3,000 devices, with a majority of the infections reported in Spain and Italy.\nItalian fraud prevention firm Cleafy..."
  },
  {
    "title": "Ukraine Warns of CABINETRAT Backdoor + XLL Add-ins Spread via Signal ZIPs",
    "link": "https://thehackernews.com/2025/10/ukraine-warns-of-cabinetrat-backdoor.html",
    "date": "2025-10-01T07:11:19.000Z",
    "source": "The Hacker News",
    "summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has warned of new targeted cyber attacks in the country using a backdoor called CABINETRAT.\nThe activity, observed in September 2025, has been..."
  },
  {
    "title": "China Imposes One-Hour Reporting Rule for Major Cyber Incidents",
    "link": "https://www.darkreading.com/cybersecurity-operations/china-one-hour-reporting-rule-major-cyber-incidents",
    "date": "2025-10-01T01:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The sweeping new regulations show that China's serious about hardening its own networks after launching widespread attacks on global networks...."
  },
  {
    "title": "Imgur blocks UK users after data watchdog signals possible fine",
    "link": "https://www.bleepingcomputer.com/news/technology/imgur-blocks-uk-users-after-data-watchdog-signals-possible-fine/",
    "date": "2025-09-30T21:24:08.000Z",
    "source": "Bleeping Computer",
    "summary": "People in the United Kingdom are no longer able to access content hosted on the Imgur, a popular media sharing site, after a UK data watchdog warned it may impose a monetary penalty on the parent comp..."
  },
  {
    "title": "New China APT Strikes With Precision and Persistence",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/new-china-apt-strikes-precision-persistence",
    "date": "2025-09-30T21:09:37.000Z",
    "source": "Dark Reading",
    "summary": "Phantom Taurus demonstrates a deep understanding of Windows environments, including advanced components like IIServerCore, a fileless backdoor that executes in memory to evade detection...."
  },
  {
    "title": "'Klopatra' Trojan Makes Bank Transfers While You Sleep",
    "link": "https://www.darkreading.com/threat-intelligence/klopatra-trojan-bank-transfers-sleep",
    "date": "2025-09-30T20:28:44.000Z",
    "source": "Dark Reading",
    "summary": "A sophisticated new banking malware is hard to detect, capable of stealing lots of money, and infecting thousands of people in Italy and Spain...."
  },
  {
    "title": "Sendit sued by the FTC for illegal collection of children data",
    "link": "https://www.bleepingcomputer.com/news/legal/sendit-sued-by-the-ftc-for-illegal-collection-of-children-data/",
    "date": "2025-09-30T19:57:34.000Z",
    "source": "Bleeping Computer",
    "summary": "The Federal Trade Commission (FTC) is suing Sendit's operating company and its CEO for unlawful collection of data from underage users, as well as deceptive subscription practices. [...]..."
  },
  {
    "title": "China Exploited New VMware Bug for Nearly a Year",
    "link": "https://www.darkreading.com/remote-workforce/china-exploited-new-vmware-bug-nearly",
    "date": "2025-09-30T19:41:14.000Z",
    "source": "Dark Reading",
    "summary": "A seemingly benign privilege-escalation process in VMware and other software has likely benefited attackers and other malware strains for years, researchers noted...."
  },
  {
    "title": "New MatrixPDF toolkit turns PDFs into phishing and malware lures",
    "link": "https://www.bleepingcomputer.com/news/security/new-matrixpdf-toolkit-turns-pdfs-into-phishing-and-malware-lures/",
    "date": "2025-09-30T18:57:53.000Z",
    "source": "Bleeping Computer",
    "summary": "A new phishing and malware distribution toolkit called MatrixPDF allows attackers to convert ordinary PDF files into interactive lures that bypass email security and redirect victims to credential the..."
  },
  {
    "title": "New $50 Battering RAM Attack Breaks Intel and AMD Cloud Security Protections",
    "link": "https://thehackernews.com/2025/10/50-battering-ram-attack-breaks-intel.html",
    "date": "2025-09-30T18:42:00.000Z",
    "source": "The Hacker News",
    "summary": "A group of academics from KU Leuven and the University of Birmingham has demonstrated a new vulnerability called Battering RAM to bypass the latest defenses on Intel and AMD cloud processors.\n\"We buil..."
  },
  {
    "title": "WestJet confirms recent breach exposed customers' passports",
    "link": "https://www.bleepingcomputer.com/news/security/westjet-confirms-recent-breach-exposed-customers-passports/",
    "date": "2025-09-30T18:40:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Canadian airline WestJet is informing customers that the cyberattack disclosed in June compromised their sensitive information, including passports and ID documents. [...]..."
  },
  {
    "title": "Windows 11 2025 Update (25H2) is now available, Here's what's new",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-2025-update-25h2-is-now-available-heres-whats-new/",
    "date": "2025-09-30T17:58:43.000Z",
    "source": "Bleeping Computer",
    "summary": "Today, Microsoft announced the release of Windows 11 25H2, also known as Windows 11 2025 Update. [...]..."
  },
  {
    "title": "Nearly 50,000 Cisco firewalls vulnerable to actively exploited flaws",
    "link": "https://www.bleepingcomputer.com/news/security/nearly-50-000-cisco-firewalls-vulnerable-to-actively-exploited-flaws/",
    "date": "2025-09-30T16:58:08.000Z",
    "source": "Bleeping Computer",
    "summary": "Roughly 50,000 Cisco Adaptive Security Appliance (ASA) and Firewall Threat Defense (FTD) appliances exposed on the public web are vulnerable to two vulnerabilities actively leveraged by hackers. [...]..."
  },
  {
    "title": "Phantom Taurus: New China-Linked Hacker Group Hits Governments With Stealth Malware",
    "link": "https://thehackernews.com/2025/09/phantom-taurus-new-china-linked-hacker.html",
    "date": "2025-09-30T16:07:00.000Z",
    "source": "The Hacker News",
    "summary": "Government and telecommunications organizations across Africa, the Middle East, and Asia have emerged as the target of a previously undocumented China-aligned nation-state actor dubbed Phantom Taurus ..."
  },
  {
    "title": "Critical WD My Cloud bug allows remote command injection",
    "link": "https://www.bleepingcomputer.com/news/security/critical-wd-my-cloud-bug-allows-remote-command-injection/",
    "date": "2025-09-30T15:07:23.000Z",
    "source": "Bleeping Computer",
    "summary": "Western Digital has released firmware updates for multiple My Cloud NAS models to patch a critical-severity vulnerability that could be exploited remotely to execute arbitrary system commands. [...]..."
  },
  {
    "title": "Chinese hackers exploiting VMware zero-day since October 2024",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-hackers-exploiting-vmware-zero-day-since-october-2024/",
    "date": "2025-09-30T14:54:44.000Z",
    "source": "Bleeping Computer",
    "summary": "Broadcom has patched a high-severity privilege escalation vulnerability in its VMware Aria Operations and VMware Tools software, which has been exploited in zero-day attacks since October 2024. [...]..."
  },
  {
    "title": "VMware Certification Is Surging in a Shifting IT Landscape",
    "link": "https://www.bleepingcomputer.com/news/security/vmware-certification-is-surging-in-a-shifting-it-landscape/",
    "date": "2025-09-30T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "VMware certification is surging as IT teams face hybrid infra, cloud complexity, & rising risks. See how VMUG Advantage helps practitioners & enterprises turn certification into stronger security & me..."
  },
  {
    "title": "Can Shadow AI Risks Be Stopped?",
    "link": "https://www.darkreading.com/cyber-risk/can-shadow-ai-risks-be-stopped",
    "date": "2025-09-30T13:58:14.000Z",
    "source": "Dark Reading",
    "summary": "Agentic AI has introduced abundant shadow artificial intelligence (AI) risks. Cybersecurity startup Entro Security extends its platform to help enterprises combat the growing issue...."
  },
  {
    "title": "Microsoft fixes Windows DRM video playback issues for some users",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-drm-video-playback-issues-now-partially-resolved/",
    "date": "2025-09-30T13:47:45.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft says it has \"partially\" resolved a known issue that caused problems when trying to play DRM-protected video in Blu-ray/DVD/Digital TV applications. [...]..."
  },
  {
    "title": "CISA warns of critical Linux Sudo flaw exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-critical-linux-sudo-flaw-exploited-in-attacks/",
    "date": "2025-09-30T13:42:53.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are actively exploiting a critical vulnerability (CVE-2025-32463) in the sudo package that enables the execution of commands with root-level privileges on Linux operating systems. [...]..."
  },
  {
    "title": "Researchers Disclose Google Gemini AI Flaws Allowing Prompt Injection and Cloud Exploits",
    "link": "https://thehackernews.com/2025/09/researchers-disclose-google-gemini-ai.html",
    "date": "2025-09-30T13:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed three now-patched security vulnerabilities impacting Google's Gemini artificial intelligence (AI) assistant that, if successfully exploited, could have exposed..."
  },
  {
    "title": "Microsoft Expands Sentinel Into Agentic Security Platform With Unified Data Lake",
    "link": "https://thehackernews.com/2025/09/microsoft-expands-sentinel-into-agentic.html",
    "date": "2025-09-30T13:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Tuesday unveiled the expansion of its Sentinel Security Incidents and Event Management solution (SIEM) as a unified agentic platform with the general availability of the Sentinel data lak..."
  },
  {
    "title": "Windows 11 KB5065789 update released with 41 changes and fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5065789-update-released-with-41-changes-and-fixes/",
    "date": "2025-09-30T12:50:47.000Z",
    "source": "Bleeping Computer",
    "summary": "​​Microsoft has released the KB5065789 preview cumulative update for Windows 11 24H2, which includes 41 improvements, including new AI actions in File Explorer and bug fixes for Windows Update and Win..."
  },
  {
    "title": "Broadcom fixes high-severity VMware NSX bugs reported by NSA",
    "link": "https://www.bleepingcomputer.com/news/security/broadcom-fixes-high-severity-vmware-nsx-bugs-reported-by-nsa/",
    "date": "2025-09-30T12:10:13.000Z",
    "source": "Bleeping Computer",
    "summary": "Broadcom has released security updates to patch two high-severity VMware NSX vulnerabilities reported by the U.S. National Security Agency (NSA). [...]..."
  },
  {
    "title": "Stop Alert Chaos: Context Is the Key to Effective Incident Response",
    "link": "https://thehackernews.com/2025/09/stop-alert-chaos-context-is-key-to.html",
    "date": "2025-09-30T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "The Problem: Legacy SOCs and Endless Alert Noise\nEvery SOC leader knows the feeling: hundreds of alerts pouring in, dashboards lighting up like a slot machine, analysts scrambling to keep pace. The ha..."
  },
  {
    "title": "Urgent: China-Linked Hackers Exploit New VMware Zero-Day Since October 2024",
    "link": "https://thehackernews.com/2025/09/urgent-china-linked-hackers-exploit-new.html",
    "date": "2025-09-30T10:57:00.000Z",
    "source": "The Hacker News",
    "summary": "A newly patched security flaw impacting Broadcom VMware Tools and VMware Aria Operations has been exploited in the wild as a zero-day since mid-October 2024 by a threat actor called UNC5174, according..."
  },
  {
    "title": "'Trifecta' of Google Gemini Flaws Turn AI Into Attack Vehicle",
    "link": "https://www.darkreading.com/vulnerabilities-threats/trifecta-google-gemini-flaws-ai-attack-vehicle",
    "date": "2025-09-30T10:20:14.000Z",
    "source": "Dark Reading",
    "summary": "Flaws in individual models of Google's AI suite created significant security and privacy risks for users, demonstrating the need for heightened defenses...."
  }
]