[
  {
    "title": "Secure Your Spot at RSAC 2026 Conference",
    "link": "https://www.darkreading.com/events/rsac-2026-conference",
    "date": "2026-01-16T00:34:43.280Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "ChatGPT is now more reliable at finding and remembering your past chat",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-is-now-more-reliable-at-finding-and-remembering-your-past-chat/",
    "date": "2026-01-16T00:14:44.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is rolling out a big upgrade for ChatGPT with support for advanced chat history search, but the feature is rolling out to Plus and Pro subscribers only. [...]..."
  },
  {
    "title": "Gootloader now uses 1,000-part ZIP archives for stealthy delivery",
    "link": "https://www.bleepingcomputer.com/news/security/gootloader-now-uses-1-000-part-zip-archives-for-stealthy-delivery/",
    "date": "2026-01-15T22:54:34.000Z",
    "source": "Bleeping Computer",
    "summary": "The Gootloader malware, typically used for initial access, is now using a malformed ZIP archive designed to evade detection by concatenating up to 1,000 archives. [...]..."
  },
  {
    "title": "Grubhub confirms hackers stole data in recent security breach",
    "link": "https://www.bleepingcomputer.com/news/security/grubhub-confirms-hackers-stole-data-in-recent-security-breach/",
    "date": "2026-01-15T21:38:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Food delivery platform Grubhub has confirmed a recent data breach after hackers accessed its systems, with sources telling BleepingComputer the company is now facing extortion demands. [...]..."
  },
  {
    "title": "Predator Spyware Sample Indicates 'Vendor-Controlled' C2",
    "link": "https://www.darkreading.com/mobile-security/predator-spyware-sample-vendor-controlled-c2",
    "date": "2026-01-15T21:26:18.000Z",
    "source": "Dark Reading",
    "summary": "Researchers detailed how Intellexa, Predator's owner, uses failed deployments and thwarted infections to strengthen its commercial spyware and generate more effective attacks...."
  },
  {
    "title": "Hackers exploit Modular DS WordPress plugin flaw for admin access",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-modular-ds-wordpress-plugin-flaw-for-admin-access/",
    "date": "2026-01-15T20:49:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are actively exploiting a maximum severity flaw in the Modular DS WordPress plugin that allows them to bypass authentication remotely and access the vulnerable sites with admin-level privilege..."
  },
  {
    "title": "Verizon blames nationwide outage on a \"software issue\"",
    "link": "https://www.bleepingcomputer.com/news/mobile/verizon-blames-nationwide-outage-on-a-software-issue/",
    "date": "2026-01-15T20:13:54.000Z",
    "source": "Bleeping Computer",
    "summary": "Verizon has confirmed that yesterday's nationwide wireless outage was caused by a software issue, though the company has not shared additional details about what went wrong. [...]..."
  },
  {
    "title": "AWS CodeBuild Misconfiguration Exposed GitHub Repos to Potential Supply Chain Attacks",
    "link": "https://thehackernews.com/2026/01/aws-codebuild-misconfiguration-exposed.html",
    "date": "2026-01-15T19:31:00.000Z",
    "source": "The Hacker News",
    "summary": "A critical misconfiguration in Amazon Web Services (AWS) CodeBuild could have allowed complete takeover of the cloud service provider's own GitHub repositories, including its AWS JavaScript SDK, putti..."
  },
  {
    "title": "Winter Olympics Could Share Podium With Cyberattackers",
    "link": "https://www.darkreading.com/remote-workforce/winter-olympics-podium-cyberattackers",
    "date": "2026-01-15T19:10:05.000Z",
    "source": "Dark Reading",
    "summary": "The upcoming Winter Games in the Italian Alps are attracting both hacktivists looking to reach billions of people and state-sponsored cyber-spies targeting the attending glitterati...."
  },
  {
    "title": "Microsoft Copilot Studio extension for VS Code now publicly available",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-copilot-studio-extension-for-vs-code-now-publicly-available/",
    "date": "2026-01-15T19:08:13.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced that the Copilot Studio extension for the Visual Studio Code (VS Code) integrated development environment is now available to all users. [...]..."
  },
  {
    "title": "Critical flaw lets hackers track, eavesdrop via Bluetooth audio devices",
    "link": "https://www.bleepingcomputer.com/news/security/critical-flaw-lets-hackers-track-eavesdrop-via-bluetooth-audio-devices/",
    "date": "2026-01-15T16:13:54.000Z",
    "source": "Bleeping Computer",
    "summary": "A critical vulnerability in Google's Fast Pair protocol can allow attackers to hijack Bluetooth audio accessories like wireless headphones and earbuds, track users, and eavesdrop on their conversation..."
  },
  {
    "title": "Critical WordPress Modular DS Plugin Flaw Actively Exploited to Gain Admin Access",
    "link": "https://thehackernews.com/2026/01/critical-wordpress-modular-ds-plugin.html",
    "date": "2026-01-15T15:31:00.000Z",
    "source": "The Hacker News",
    "summary": "A maximum-severity security flaw in a WordPress plugin called Modular DS has come under active exploitation in the wild, according to Patchstack.\nThe vulnerability, tracked as CVE-2026-23550 (CVSS sco..."
  },
  {
    "title": "Vulnerabilities Surge, But Messy Reporting Blurs Picture",
    "link": "https://www.darkreading.com/cybersecurity-analytics/vulnerabilities-surge-messy-reporting-blurs-picture",
    "date": "2026-01-15T15:19:31.000Z",
    "source": "Dark Reading",
    "summary": "MITRE loses its lead as the top reporter of vulnerabilities, while new organizations pump out CVEs and reported bugs in WordPress plug-ins surge...."
  },
  {
    "title": "Researchers Reveal Reprompt Attack Allowing Single-Click Data Exfiltration From Microsoft Copilot",
    "link": "https://thehackernews.com/2026/01/researchers-reveal-reprompt-attack.html",
    "date": "2026-01-15T15:09:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new attack method dubbed Reprompt that could allow bad actors to exfiltrate sensitive data from artificial intelligence (AI) chatbots like Microso..."
  },
  {
    "title": "How to automate just-in-time access to applications with Tines",
    "link": "https://www.bleepingcomputer.com/news/security/how-to-automate-just-in-time-access-to-applications-with-tines/",
    "date": "2026-01-15T15:01:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Managing just-in-time access at scale is a growing IAM challenge as speed and auditability collide daily. Tines shows how automated workflows can grant, track, and revoke temporary app access without ..."
  },
  {
    "title": "ThreatsDay Bulletin: AI Voice Cloning Exploit, Wi-Fi Kill Switch, PLC Vulns, and 14 More Stories",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-ai-voice-cloning.html",
    "date": "2026-01-15T13:56:00.000Z",
    "source": "The Hacker News",
    "summary": "The internet never stays quiet. Every week, new hacks, scams, and security problems show up somewhere.\nThis week’s stories show how fast attackers change their tricks, how small mistakes turn into big..."
  },
  {
    "title": "Model Security Is the Wrong Frame – The Real Risk Is Workflow Security",
    "link": "https://thehackernews.com/2026/01/model-security-is-wrong-frame-real-risk.html",
    "date": "2026-01-15T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "As AI copilots and assistants become embedded in daily work, security teams are still focused on protecting the models themselves. But recent incidents suggest the bigger risk lies elsewhere: in the w..."
  },
  {
    "title": "4 Outdated Habits Destroying Your SOC's MTTR in 2026",
    "link": "https://thehackernews.com/2026/01/4-outdated-habits-destroying-your-socs.html",
    "date": "2026-01-15T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "It’s 2026, yet many SOCs are still operating the way they did years ago, using tools and processes designed for a very different threat landscape. Given the growth in volumes and complexity of cyber t..."
  },
  {
    "title": "Trio of Critical Bugs Spotted in Delta Industrial PLCs",
    "link": "https://www.darkreading.com/ics-ot-security/critical-bugs-delta-industrial-plcs",
    "date": "2026-01-15T11:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Experts disagree on whether the vulnerabilities in a programmable logic controller from Delta are a five-alarm fire or not much to worry over...."
  },
  {
    "title": "FTC bans GM from selling drivers' location data for five years",
    "link": "https://www.bleepingcomputer.com/news/security/ftc-bans-general-motors-from-selling-drivers-location-data-for-five-years/",
    "date": "2026-01-15T09:59:30.000Z",
    "source": "Bleeping Computer",
    "summary": "The FTC has finalized an order with General Motors, settling charges that it collected and sold the location and driving data of millions of drivers without consent. [...]..."
  },
  {
    "title": "Microsoft Legal Action Disrupts RedVDS Cybercrime Infrastructure Used for Online Fraud",
    "link": "https://thehackernews.com/2026/01/microsoft-legal-action-disrupts-redvds.html",
    "date": "2026-01-15T09:37:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Wednesday announced that it has taken a \"coordinated legal action\" in the U.S. and the U.K. to disrupt a cybercrime subscription service called RedVDS that has allegedly fueled millions i..."
  },
  {
    "title": "Palo Alto Networks warns of DoS bug letting hackers disable firewalls",
    "link": "https://www.bleepingcomputer.com/news/security/palo-alto-networks-warns-of-dos-bug-letting-hackers-disable-firewalls/",
    "date": "2026-01-15T09:02:42.000Z",
    "source": "Bleeping Computer",
    "summary": "Palo Alto Networks patched a high-severity vulnerability that could allow unauthenticated attackers to disable firewall protections in denial-of-service (DoS) attacks. [...]..."
  },
  {
    "title": "Palo Alto Fixes GlobalProtect DoS Flaw That Can Crash Firewalls Without Login",
    "link": "https://thehackernews.com/2026/01/palo-alto-fixes-globalprotect-dos-flaw.html",
    "date": "2026-01-15T08:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Palo Alto Networks has released security updates for a high-severity security flaw impacting GlobalProtect Gateway and Portal, for which it said there exists a proof-of-concept (PoC) exploit.\nThe vuln..."
  },
  {
    "title": "Microsoft disrupts massive RedVDS cybercrime virtual desktop service",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-seizes-servers-disrupts-massive-redvds-cybercrime-platform/",
    "date": "2026-01-15T07:11:45.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced on Wednesday that it disrupted RedVDS, a massive cybercrime platform linked to at least $40 million in reported losses in the United States alone since March 2025. [...]..."
  },
  {
    "title": "ChatGPT's upcoming cross-platform feature is codenamed \"Agora\"",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-upcoming-cross-platform-feature-is-codenamed-agora/",
    "date": "2026-01-15T03:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is internally testing a new feature called \"Agora,\" and it could be related to some sort of cross-platform feature that works in real time or some other new product. [...]..."
  },
  {
    "title": "Google plans to make Chrome for Android an agentic browser with Gemini",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-plans-to-make-chrome-for-android-an-agentic-browser-with-gemini/",
    "date": "2026-01-15T01:30:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google appears to be testing a new feature that integrates Gemini into Chrome for Android, allowing you to use agentic browser capabilities on your mobile device. [...]..."
  },
  {
    "title": "Retail, Services Industries Under Fire in Oceania",
    "link": "https://www.darkreading.com/cybersecurity-analytics/retail-services-industries-oceania",
    "date": "2026-01-14T21:19:44.000Z",
    "source": "Dark Reading",
    "summary": "Last year in Australia, New Zealand, and the South Pacific, Main Street businesses like retail and construction suffered more cyberattacks than their critical sector counterparts...."
  },
  {
    "title": "Microsoft Disrupts Cybercrime Service RedVDS",
    "link": "https://www.darkreading.com/threat-intelligence/microsoft-disrupts-cybercrime-service-redvds",
    "date": "2026-01-14T19:07:30.000Z",
    "source": "Dark Reading",
    "summary": "RedVDS, a cybercrime-as-a-service operation that has stolen millions from victims, lost two domains to a law enforcement operation...."
  },
  {
    "title": "Researchers Null-Route Over 550 Kimwolf and Aisuru Botnet Command Servers",
    "link": "https://thehackernews.com/2026/01/kimwolf-botnet-infected-over-2-million.html",
    "date": "2026-01-14T19:03:00.000Z",
    "source": "The Hacker News",
    "summary": "The Black Lotus Labs team at Lumen Technologies said it null-routed traffic to more than 550 command-and-control (C2) nodes associated with the AISURU/Kimwolf botnet since early October 2025.\nAISURU a..."
  },
  {
    "title": "'VoidLink' Malware Poses Advanced Threat to Linux Systems",
    "link": "https://www.darkreading.com/cloud-security/voidlink-malware-advanced-threat-linux-systems",
    "date": "2026-01-14T15:59:49.000Z",
    "source": "Dark Reading",
    "summary": "Researchers discovered a modular, \"cloud-first\" framework that is feature-rich and designed to maintain stealthy, long-term access to Linux environments...."
  }
]