[
  {
    "title": "Hackers claim Discord breach exposed data of 5.5 million users",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-claim-discord-breach-exposed-data-of-55-million-users/",
    "date": "2025-10-09T00:22:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Discord says they will not be negotiating with threat actors who claim to have stolen the data of 5.5 million unique users from the company's Zendesk support system instance, including government IDs ..."
  },
  {
    "title": "Vampire Bot Malware Sinks Fangs Into Job Hunters",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/vampire-bot-malware-job-hunters",
    "date": "2025-10-08T21:02:42.000Z",
    "source": "Dark Reading",
    "summary": "The campaign is the latest by BatShadow, one of a growing number of cybercrime groups operating out of Vietnam...."
  },
  {
    "title": "Red Hat Hackers Team Up With Scattered Lapsus$ Hunters",
    "link": "https://www.darkreading.com/threat-intelligence/red-hat-hackers-team-up-scattered-lapsus-hunters",
    "date": "2025-10-08T20:40:36.000Z",
    "source": "Dark Reading",
    "summary": "Crimson Collective, which recently breached the GitLab instance of Red Hat Consulting, has teamed up with the notorious cybercriminal collective...."
  },
  {
    "title": "LockBit, Qilin &amp; DragonForce Join Forces in Ransomware 'Cartel'",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/extortion-gangs-join-forces-ransomware-cartel",
    "date": "2025-10-08T19:56:33.000Z",
    "source": "Dark Reading",
    "summary": "The three extortion gangs also invited other e-crime attackers to join their collaboration to share attack information and resources, in the wake of LockBit 5.0 being released...."
  },
  {
    "title": "New FileFix attack uses cache smuggling to evade security software",
    "link": "https://www.bleepingcomputer.com/news/security/new-filefix-attack-uses-cache-smuggling-to-evade-security-software/",
    "date": "2025-10-08T19:49:47.000Z",
    "source": "Bleeping Computer",
    "summary": "A new variant of the FileFix social engineering attack uses cache smuggling to secretly download a malicious ZIP archive onto a victim's system and bypassing security software. [...]..."
  },
  {
    "title": "Qilin ransomware claims Asahi brewery attack, leaks data",
    "link": "https://www.bleepingcomputer.com/news/security/qilin-ransomware-claims-asahi-brewery-attack-leaks-data/",
    "date": "2025-10-08T18:42:22.000Z",
    "source": "Bleeping Computer",
    "summary": "The Qilin ransomware group has claimed responsibility for the attack at Japanese beer maker Asahi, adding the company to its extortion page on the dark web yesterday. [...]..."
  },
  {
    "title": "Microsoft 365 outage blocks access to Teams, Exchange Online",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-outage-blocks-access-to-teams-exchange-online/",
    "date": "2025-10-08T18:35:01.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft is working to resolve an ongoing outage preventing users from accessing Microsoft 365 services, including Microsoft Teams, Exchange Online, and the admin center. [...]..."
  },
  {
    "title": "Microsoft enables Exchange Online auto-archiving by default",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-enables-exchange-online-auto-archiving-by-default-to-fight-overflowing-mailboxes/",
    "date": "2025-10-08T17:49:59.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is enabling threshold-based auto-archiving by default in Exchange Online to prevent email flow issues caused by mailboxes filling up faster than expected. [...]..."
  },
  {
    "title": "Crimson Collective hackers target AWS cloud instances for data theft",
    "link": "https://www.bleepingcomputer.com/news/security/crimson-collective-hackers-target-aws-cloud-instances-for-data-theft/",
    "date": "2025-10-08T17:33:38.000Z",
    "source": "Bleeping Computer",
    "summary": "The 'Crimson Collective' threat group has been targeting AWS (Amazon Web Services) cloud environments for the past weeks, to steal data and extort companies. [...]..."
  },
  {
    "title": "Framelink Figma MCP Server Opens Orgs to Agentic AI Compromise",
    "link": "https://www.darkreading.com/vulnerabilities-threats/figma-mcp-server-agentic-ai-compromise",
    "date": "2025-10-08T17:14:02.000Z",
    "source": "Dark Reading",
    "summary": "Patch now: A bug (CVE-2025-53967) in a third-party option for connecting Figma to agentic AI can lead to remote code execution (RCE)...."
  },
  {
    "title": "Hackers Exploit WordPress Sites to Power Next-Gen ClickFix Phishing Attacks",
    "link": "https://thehackernews.com/2025/10/hackers-exploit-wordpress-themes-to.html",
    "date": "2025-10-08T16:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a nefarious campaign targeting WordPress sites to make malicious JavaScript injections that are designed to redirect users to sketchy sites.\n\"Site vi..."
  },
  {
    "title": "Hackers exploit auth bypass in Service Finder WordPress theme",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-auth-bypass-in-service-finder-wordpress-theme/",
    "date": "2025-10-08T15:57:53.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are actively exploiting a critical vulnerability in the Service Finder WordPress theme that allows them to bypass authentication and log in as administrators. [...]..."
  },
  {
    "title": "London police arrests suspects linked to nursery breach, child doxing",
    "link": "https://www.bleepingcomputer.com/news/security/london-police-arrests-suspects-linked-to-nursery-breach-child-doxing/",
    "date": "2025-10-08T14:49:08.000Z",
    "source": "Bleeping Computer",
    "summary": "The UK Metropolitan Police has arrested two suspects following an investigation into the doxing of children online after a ransomware attack on a chain of London-based nurseries. [...]..."
  },
  {
    "title": "China-Nexus Actors Weaponize 'Nezha' Open Source Tool",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/china-nexus-actors-nezha-open-source-tool",
    "date": "2025-10-08T14:02:28.000Z",
    "source": "Dark Reading",
    "summary": "A threat actor is putting a spin on classic remote monitoring and management (RMM) attacks, using a Chinese open source tool instead...."
  },
  {
    "title": "Defend the Target, Not Just the Door: A Modern Plan for Google Workspace",
    "link": "https://www.bleepingcomputer.com/news/security/defend-the-target-not-just-the-door-a-modern-plan-for-google-workspace/",
    "date": "2025-10-08T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "The Salesloft Drift breach shows attackers don't need to \"hack Google\" — they just need to breach a trusted integration. Learn from Material Security how to secure OAuth, detect risky behavior, and pr..."
  },
  {
    "title": "Chinese Hackers Weaponize Open-Source Nezha Tool in New Attack Wave",
    "link": "https://thehackernews.com/2025/10/chinese-hackers-weaponize-open-source.html",
    "date": "2025-10-08T13:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with suspected ties to China have turned a legitimate open-source monitoring tool called Nezha into an attack weapon, using it to deliver a known malware called Gh0st RAT to targets.\nThe..."
  },
  {
    "title": "Calling All Influencers: Spear-Phishers Dangle Tesla, Red Bull Jobs",
    "link": "https://www.darkreading.com/remote-workforce/influencers-phishers-tesla-red-bull-jobs",
    "date": "2025-10-08T13:48:18.000Z",
    "source": "Dark Reading",
    "summary": "Wanna work for a hot brand? Cyberattackers continue to evolve lures for job seekers in an impersonation campaign aimed at stealing résumés from social media pros...."
  },
  {
    "title": "Step Into the Password Graveyard… If You Dare (and Join the Live Session)",
    "link": "https://thehackernews.com/2025/10/step-into-password-graveyard-if-you.html",
    "date": "2025-10-08T12:08:00.000Z",
    "source": "The Hacker News",
    "summary": "Every year, weak passwords lead to millions in losses — and many of those breaches could have been stopped.\nAttackers don’t need advanced tools; they just need one careless login.\nFor IT teams, that m..."
  },
  {
    "title": "LockBit, Qilin, and DragonForce Join Forces to Dominate the Ransomware Ecosystem",
    "link": "https://thehackernews.com/2025/10/lockbit-qilin-and-dragonforce-join.html",
    "date": "2025-10-08T12:04:00.000Z",
    "source": "The Hacker News",
    "summary": "Three prominent ransomware groups DragonForce, LockBit, and Qilin have announced a new strategic ransomware alliance, once underscoring continued shifts in the cyber threat landscape.\nThe coalition is..."
  },
  {
    "title": "Severe Figma MCP Vulnerability Lets Hackers Execute Code Remotely — Patch Now",
    "link": "https://thehackernews.com/2025/10/severe-figma-mcp-vulnerability-lets.html",
    "date": "2025-10-08T10:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a now-patched vulnerability in the popular figma-developer-mcp Model Context Protocol (MCP) server that could allow attackers to achieve code execut..."
  },
  {
    "title": "No Time to Waste: Embedding AI to Cut Noise and Reduce Risk",
    "link": "https://thehackernews.com/2025/09/automation-is-redefining-pentest.html",
    "date": "2025-10-08T08:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence is reshaping cybersecurity on both sides of the battlefield. Cybercriminals are using AI-powered tools to accelerate and automate attacks at a scale defenders have never faced ..."
  },
  {
    "title": "OpenAI Disrupts Russian, North Korean, and Chinese Hackers Misusing ChatGPT for Cyberattacks",
    "link": "https://thehackernews.com/2025/10/openai-disrupts-russian-north-korean.html",
    "date": "2025-10-08T07:16:00.000Z",
    "source": "The Hacker News",
    "summary": "OpenAI on Tuesday said it disrupted three activity clusters for misusing its ChatGPT artificial intelligence (AI) tool to facilitate malware development.\nThis includes a Russian‑language threat actor,..."
  },
  {
    "title": "Cyberattack Leads to Beer Shortage as Asahi Recovers",
    "link": "https://www.darkreading.com/ics-ot-security/cyberattack-beer-shortage-asahi-recovers",
    "date": "2025-10-08T01:00:00.000Z",
    "source": "Dark Reading",
    "summary": "A ransomware last week left the Asahi brewery in Japan struggling to take orders and deliver its products domestically, as manufacturers become a favored target...."
  },
  {
    "title": "Salesforce refuses to pay ransom over widespread data theft attacks",
    "link": "https://www.bleepingcomputer.com/news/security/salesforce-refuses-to-pay-ransom-over-widespread-data-theft-attacks/",
    "date": "2025-10-08T00:17:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Salesforce has confirmed that it will not negotiate with or pay a ransom to the threat actors behind a massive wave of data theft attacks that impacted the company's customers this year. [...]..."
  },
  {
    "title": "Docker makes Hardened Images Catalog affordable for small businesses",
    "link": "https://www.bleepingcomputer.com/news/security/docker-makes-hardened-images-catalog-affordable-for-small-businesses/",
    "date": "2025-10-07T22:09:48.000Z",
    "source": "Bleeping Computer",
    "summary": "The Docker team has announced unlimited access to its Hardened Images catalog to make access to secure software bundles affordable for all development teams at startups and SMBs. [...]..."
  },
  {
    "title": "Attackers Season Spam With a Touch of 'Salt'",
    "link": "https://www.darkreading.com/cyber-risk/attackers-season-spam-touch-salt",
    "date": "2025-10-07T21:18:57.000Z",
    "source": "Dark Reading",
    "summary": "Researchers report an increase in the use of hidden content in spam and malicious email to confuse filters and other security mechanisms...."
  },
  {
    "title": "Google won’t fix new ASCII smuggling attack in Gemini",
    "link": "https://www.bleepingcomputer.com/news/security/google-wont-fix-new-ascii-smuggling-attack-in-gemini/",
    "date": "2025-10-07T20:35:40.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has decided not to fix a new ASCII smuggling attack in Gemini that could be used to trick the AI assistant into providing users with fake information, alter the model's behavior, and silently p..."
  },
  {
    "title": "DraftKings warns of account breaches in credential stuffing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/draftkings-warns-of-account-breaches-in-credential-stuffing-attacks/",
    "date": "2025-10-07T19:09:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Sports betting giant DraftKings has notified an undisclosed number of customers that their accounts had been hacked in a recent wave of credential stuffing attacks. [...]..."
  },
  {
    "title": "Security Concerns Shadow Vibe Coding Adoption",
    "link": "https://www.darkreading.com/application-security/security-concerns-shadow-vibe-coding-adoption",
    "date": "2025-10-07T19:08:06.000Z",
    "source": "Dark Reading",
    "summary": "In a recent poll, readers shared how they're using vibe coding in AppDev (if they are at all). While some found success, others found the risks too great...."
  },
  {
    "title": "BatShadow Group Uses New Go-Based 'Vampire Bot' Malware to Hunt Job Seekers",
    "link": "https://thehackernews.com/2025/10/batshadow-group-uses-new-go-based.html",
    "date": "2025-10-07T17:04:00.000Z",
    "source": "The Hacker News",
    "summary": "A Vietnamese threat actor named BatShadow has been attributed to a new campaign that leverages social engineering tactics to deceive job seekers and digital marketing professionals to deliver a previo..."
  }
]