[
  {
    "title": "I powered my home for two weeks with this portable power station (and it's $500 off)",
    "link": "https://www.zdnet.com/article/i-powered-my-home-for-two-weeks-with-this-portable-power-station-and-its-500-off/",
    "date": "2025-07-24T14:56:15.000Z",
    "source": "ZDNet Security",
    "summary": "The Jackery Explorer 2000 Plus is a powerful, solar-ready station built to keep your home running. Right now, you can get one for 25% off...."
  },
  {
    "title": "This soundbar delivers audio above its price point, and it's not by Sonos or JBL",
    "link": "https://www.zdnet.com/article/this-soundbar-delivers-audio-above-its-price-point-and-its-not-by-sonos-or-jbl/",
    "date": "2025-07-24T14:12:40.000Z",
    "source": "ZDNet Security",
    "summary": "For its price, the Yamaha True X Bar has surprisingly strong bass and rich sound. It ranks among the best soundbar systems I've tested...."
  },
  {
    "title": "Translating Cyber-Risk for the Boardroom",
    "link": "https://www.darkreading.com/cyber-risk/translating-cyber-risk-boardroom",
    "date": "2025-07-24T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "When security leaders embrace this truth and learn to speak in the language of leadership, they don't just protect the enterprise, they help lead it forward...."
  },
  {
    "title": "Google Photos is using AI to turn your photos into videos and remix them - try it for free",
    "link": "https://www.zdnet.com/article/google-photos-is-using-ai-to-turn-your-photos-into-videos-and-remix-them-try-it-for-free/",
    "date": "2025-07-24T13:43:00.000Z",
    "source": "ZDNet Security",
    "summary": "Watch your pictures come to life in six-second clips, or let Google's AI edit your photos into an entirely different style like anime. Here's how...."
  },
  {
    "title": "EcoFlow's new DC-only portable power stations could replace my current setup",
    "link": "https://www.zdnet.com/article/ecoflows-new-dc-only-portable-power-stations-could-replace-my-current-setup/",
    "date": "2025-07-24T13:41:00.000Z",
    "source": "ZDNet Security",
    "summary": "The EcoFlow Trail Series is focused on simplicity, making it a great portable battery to take camping or traveling...."
  },
  {
    "title": "7 ways Linux can lower your tech costs - and extend the life of your devices",
    "link": "https://www.zdnet.com/article/7-ways-linux-can-lower-your-tech-costs-and-extend-the-life-of-your-devices/",
    "date": "2025-07-24T13:31:43.000Z",
    "source": "ZDNet Security",
    "summary": "I've watched many people spend huge amounts of money keeping their computers running or up to speed. But they don't have to with Linux. Here's why...."
  },
  {
    "title": "Hackers breach Toptal GitHub account, publish malicious npm packages",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-breach-toptal-github-account-publish-malicious-npm-packages/",
    "date": "2025-07-24T13:26:04.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers compromised Toptal's GitHub organization account and used their access to publish ten malicious packages on the Node Package Manager (NPM) index. [...]..."
  },
  {
    "title": "Amazon just released the first full-color Kindle for the youngest readers",
    "link": "https://www.zdnet.com/article/amazon-just-released-the-first-full-color-kindle-with-the-youngest-readers-in-mind/",
    "date": "2025-07-24T13:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "The new Kindle Colorsoft Kids expands your children's e-reading experience with a richer, distraction-free experience...."
  },
  {
    "title": "I finally found a thermal camera that works on iPhone and Android",
    "link": "https://www.zdnet.com/article/i-finally-found-a-thermal-camera-that-works-on-iphone-and-android/",
    "date": "2025-07-24T12:59:06.000Z",
    "source": "ZDNet Security",
    "summary": "The TC002C Duo works with both iPhones and Androids, as well as Windows PCs for more compatibility than some of its competitors...."
  },
  {
    "title": "Watch This Webinar to Uncover Hidden Flaws in Login, AI, and Digital Trust — and Fix Them",
    "link": "https://thehackernews.com/2025/07/watch-this-webinar-to-uncover-hidden.html",
    "date": "2025-07-24T11:36:00.000Z",
    "source": "The Hacker News",
    "summary": "Is Managing Customer Logins and Data Giving You Headaches? You're Not Alone!\nToday, we all expect super-fast, secure, and personalized online experiences. But let's be honest, we're also more careful ..."
  },
  {
    "title": "SonicWall urges admins to patch critical RCE flaw in SMA 100 devices",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-warns-of-critical-rce-flaw-in-sma-100-VPN-appliances/",
    "date": "2025-07-24T11:17:39.000Z",
    "source": "Bleeping Computer",
    "summary": "SonicWall urges customers to patch SMA 100 series appliances against a critical authenticated arbitrary file upload vulnerability that can let attackers gain remote code execution. [...]..."
  },
  {
    "title": "Surfshark vs. CyberGhost: Which VPN should you get?",
    "link": "https://www.zdnet.com/article/surfshark-vs-cyberghost/",
    "date": "2025-07-24T11:00:18.000Z",
    "source": "ZDNet Security",
    "summary": "You can't go wrong choosing Surfshark or CyberGhost as VPN, but here's why you might want to get one over the other...."
  },
  {
    "title": "Pentests once a year? Nope. It’s time to build an offensive SOC",
    "link": "https://thehackernews.com/2025/07/pentests-once-year-nope-its-time-to.html",
    "date": "2025-07-24T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "You wouldn’t run your blue team once a year, so why accept this substandard schedule for your offensive side?\nYour cybersecurity teams are under intense pressure to be proactive and to find your netwo..."
  },
  {
    "title": "China-Based APTs Deploy Fake Dalai Lama Apps to Spy on Tibetan Community",
    "link": "https://thehackernews.com/2025/07/china-based-apts-deploy-fake-dalai-lama.html",
    "date": "2025-07-24T10:59:00.000Z",
    "source": "The Hacker News",
    "summary": "The Tibetan community has been targeted by a China-nexus cyber espionage group as part of two campaigns conducted last month ahead of the Dalai Lama's 90th birthday on July 6, 2025.\nThe multi-stage at..."
  },
  {
    "title": "Storm-2603 Exploits SharePoint Flaws to Deploy Warlock Ransomware on Unpatched Systems",
    "link": "https://thehackernews.com/2025/07/storm-2603-exploits-sharepoint-flaws-to.html",
    "date": "2025-07-24T10:37:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has revealed that one of the threat actors behind the active exploitation of SharePoint flaws is deploying Warlock ransomware on targeted systems.\nThe tech giant, in an update shared Wednesd..."
  },
  {
    "title": "The best Apple Watch Ultra bands of 2025: Expert tested",
    "link": "https://www.zdnet.com/article/best-apple-watch-ultra-strap/",
    "date": "2025-07-24T10:00:18.000Z",
    "source": "ZDNet Security",
    "summary": "We've researched and tested the top Apple Watch Ultra straps available from Nike, Apple, and Casetify. Read on to find our reviews and ratings...."
  },
  {
    "title": "Microsoft: SharePoint servers also targeted in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-sharepoint-servers-also-targeted-in-ransomware-attacks/",
    "date": "2025-07-24T09:53:14.000Z",
    "source": "Bleeping Computer",
    "summary": "A China-based hacking group is deploying Warlock ransomware on Microsoft SharePoint servers vulnerable to widespread attacks targeting the recently patched ToolShell zero-day exploit chain. [...]..."
  },
  {
    "title": "The best mechanical keyboards of 2025: I handpicked the top models available",
    "link": "https://www.zdnet.com/article/best-mechanical-keyboard/",
    "date": "2025-07-24T09:30:17.000Z",
    "source": "ZDNet Security",
    "summary": "We've brought you our top picks of the best mechanical keyboards complete with RGB backlighting, hot-swappable keys, and tactile feedback. Check out our favorite recommendations from brands like Cherr..."
  },
  {
    "title": "These are the 5 weirdest wellness gadgets I never skip using - and how they work",
    "link": "https://www.zdnet.com/article/these-are-the-5-weirdest-wellness-gadgets-i-never-skip-using-and-how-they-work/",
    "date": "2025-07-24T09:20:17.000Z",
    "source": "ZDNet Security",
    "summary": "These are the oddest health and wellness gadgets I use in my everyday routine, from a smart scale to a red light skin therapy wand...."
  },
  {
    "title": "The best music headphones of 2025: Expert tested and reviewed",
    "link": "https://www.zdnet.com/article/best-music-headphones/",
    "date": "2025-07-24T09:00:18.000Z",
    "source": "ZDNet Security",
    "summary": "I've tested the best headphones from Audio-Technica, Bowers and Wilkins, Technics, and more to find which pair delivers the best clarity, detail, and sound for audiophiles on the go...."
  },
  {
    "title": "Your TV's USB port is seriously underutilized: 5 features you're not taking advantage of",
    "link": "https://www.zdnet.com/article/your-tvs-usb-port-is-seriously-underutilized-5-features-youre-not-taking-advantage-of/",
    "date": "2025-07-24T08:25:13.000Z",
    "source": "ZDNet Security",
    "summary": "While the USB port is an older technology, it remains remarkably versatile, offering more functionalities than commonly perceived. Here are some notable examples...."
  },
  {
    "title": "I'm never toting ice after testing this portable smart cooler - here's why",
    "link": "https://www.zdnet.com/article/im-never-toting-ice-after-testing-this-portable-smart-cooler-heres-why/",
    "date": "2025-07-24T08:15:14.000Z",
    "source": "ZDNet Security",
    "summary": "Say goodbye to melting ice with the Anker Solix EverFrost 2, a battery-powered cooler designed to keep items cold for up to three days, eliminating the need for traditional ice...."
  },
  {
    "title": "I've tested dozens of tablets and this is the first Android model to truly replace my iPad Pro",
    "link": "https://www.zdnet.com/article/ive-tested-dozens-of-tablets-and-this-is-the-first-android-model-to-truly-replace-my-ipad-pro/",
    "date": "2025-07-24T08:00:20.000Z",
    "source": "ZDNet Security",
    "summary": "The latest OnePlus Pad 3 offers major improvements over its predecessor, while still being priced to compete with Samsung and Apple...."
  },
  {
    "title": "Every iPhone owner should use MagSafe - I can't live without these 7 favorite accessories",
    "link": "https://www.zdnet.com/article/every-iphone-owner-should-use-magsafe-i-cant-live-without-these-7-favorite-accessories/",
    "date": "2025-07-24T08:00:17.000Z",
    "source": "ZDNet Security",
    "summary": "These MagSafe accessories keep everything I need within a phone's reach. Here are the best ones every iPhone owner should use...."
  },
  {
    "title": "These secret Netflix codes saved me from canceling my subscription - here's why",
    "link": "https://www.zdnet.com/article/these-secret-netflix-codes-saved-me-from-canceling-my-subscription-heres-why/",
    "date": "2025-07-24T07:45:14.000Z",
    "source": "ZDNet Security",
    "summary": "Netflix offers a system of hidden codes that unlock obscure genres and categories; here's how to access them...."
  },
  {
    "title": "I recommend this Asus laptop to creative pros and office workers alike (and it's $300 off)",
    "link": "https://www.zdnet.com/article/i-recommend-this-asus-laptop-to-creative-pros-and-office-workers-alike-and-its-300-off/",
    "date": "2025-07-24T07:30:17.000Z",
    "source": "ZDNet Security",
    "summary": "The Asus ProArt P16 delivers solid performance out of the box, but it really stands out for users who tap into its powerful customization features...."
  },
  {
    "title": "Are portable wind generators a viable alternative for solar power? My verdict after testing one at home",
    "link": "https://www.zdnet.com/article/are-portable-wind-generators-a-viable-alternative-for-solar-power-my-verdict-after-testing-one-at-home/",
    "date": "2025-07-24T07:00:22.000Z",
    "source": "ZDNet Security",
    "summary": "Solar generators have a clear limitation when the sun isn't shining. This portable backup power solution, however, ensures your devices remain powered regardless of weather conditions...."
  },
  {
    "title": "This HP OmniBook finally sold me on the 2-in-1 laptop design (and it's on sale for $400 off)",
    "link": "https://www.zdnet.com/article/this-hp-omnibook-finally-sold-me-on-the-2-in-1-laptop-design-and-its-on-sale-for-400-off/",
    "date": "2025-07-24T07:00:21.000Z",
    "source": "ZDNet Security",
    "summary": "The HP OmniBook X Flip 16 combines some of the best features from its contemporaries into a sleek, well-designed device...."
  },
  {
    "title": "Europol Arrests XSS Forum Admin in Kyiv After 12-Year Run Operating Cybercrime Marketplace",
    "link": "https://thehackernews.com/2025/07/europol-arrests-xss-forum-admin-in-kyiv.html",
    "date": "2025-07-24T06:48:00.000Z",
    "source": "The Hacker News",
    "summary": "Europol on Monday announced the arrest of the suspected administrator of XSS.is (formerly DaMaGeLaB), a notorious Russian-speaking cybercrime platform.\nThe arrest, which took place in Kyiv, Ukraine, o..."
  },
  {
    "title": "Hackers Deploy Stealth Backdoor in WordPress Mu-Plugins to Maintain Admin Access",
    "link": "https://thehackernews.com/2025/07/hackers-deploy-stealth-backdoor-in.html",
    "date": "2025-07-24T05:11:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have uncovered a new stealthy backdoor concealed within the \"mu-plugins\" directory in WordPress sites to grant threat actors persistent access and allow them to perform arbit..."
  }
]