[
  {
    "title": "Microsoft is retiring 'Send to Kindle' in Word",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-retiring-send-to-kindle-in-word/",
    "date": "2026-01-11T00:29:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is retiring a feature that allowed you to send your documents to Kindle straight from Microsoft Word. [...]..."
  },
  {
    "title": "BreachForums hacking forum database leaked, exposing 324,000 accounts",
    "link": "https://www.bleepingcomputer.com/news/security/breachforums-hacking-forum-database-leaked-exposing-324-000-accounts/",
    "date": "2026-01-10T18:17:31.000Z",
    "source": "Bleeping Computer",
    "summary": "The latest incarnation of the notorious BreachForums hacking forum has suffered a data breach, with its user database table leaked online. [...]..."
  },
  {
    "title": "Spain arrests 34 suspects linked to Black Axe cyber crime",
    "link": "https://www.bleepingcomputer.com/news/security/spain-arrests-34-suspects-linked-to-black-axe-cyber-crime/",
    "date": "2026-01-10T15:17:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Authorities in Spain have arrested 34 individuals allegedly part of a criminal network involved in cyber fraud and believed to be connected to the Black Axe group responsible for illicit activities ac..."
  },
  {
    "title": "MuddyWater Launches RustyWater RAT via Spear-Phishing Across Middle East Sectors",
    "link": "https://thehackernews.com/2026/01/muddywater-launches-rustywater-rat-via.html",
    "date": "2026-01-10T10:35:00.000Z",
    "source": "The Hacker News",
    "summary": "The Iranian threat actor known as MuddyWater has been attributed to a spear-phishing campaign targeting diplomatic, maritime, financial, and telecom entities in the Middle East with a Rust-based impla..."
  },
  {
    "title": "Ireland recalls almost 13,000 passports over missing 'IRL' code",
    "link": "https://www.bleepingcomputer.com/news/security/ireland-recalls-almost-13-000-passports-over-missing-irl-code/",
    "date": "2026-01-10T10:27:38.000Z",
    "source": "Bleeping Computer",
    "summary": "Ireland's Department of Foreign Affairs has recalled nearly 13,000 passports after a software update caused a printing defect. The printing error makes the documents non-compliant with international t..."
  },
  {
    "title": "Europol Arrests 34 Black Axe Members in Spain Over €5.9M Fraud and Organized Crime",
    "link": "https://thehackernews.com/2026/01/europol-arrests-34-black-axe-members-in.html",
    "date": "2026-01-10T08:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Europol on Friday announced the arrest of 34 individuals in Spain who are alleged to be part of an international criminal organization called Black Axe.\nAs part of an operation conducted by the Spanis..."
  },
  {
    "title": "Anthropic: Viral Claude “Banned and reported to authorities” message isn’t real",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/anthropic-viral-claude-banned-and-reported-to-authorities-message-isnt-real/",
    "date": "2026-01-10T00:06:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Anthropic has denied reports of banning legitimate accounts, after a viral post on X claimed the creator of Claude had banned a user. [...]..."
  },
  {
    "title": "ChatGPT tests a new feature to find jobs, improve your resume, and more",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-tests-a-new-feature-to-find-jobs-improve-your-resume-and-more/",
    "date": "2026-01-09T23:23:08.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is testing \"Jobs,\" a new feature that could help you explore roles, improve your resume, and plan your career. This feature is being tested after ChatGPT gained support for the Health dashboard..."
  },
  {
    "title": "Deepfake Fraud Tools Are Lagging Behind Expectations",
    "link": "https://www.darkreading.com/remote-workforce/deepfake-fraud-tools-lag-expectations",
    "date": "2026-01-09T22:08:25.000Z",
    "source": "Dark Reading",
    "summary": "Deepfakes are becoming more realistic and more popular. Luckily, defenders are still ahead in the arms race...."
  },
  {
    "title": "Microsoft may soon allow IT admins to uninstall Copilot",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-may-soon-allow-it-admins-to-uninstall-copilot-on-managed-devices/",
    "date": "2026-01-09T20:34:22.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is testing a new policy that allows IT administrators to uninstall the AI-powered Copilot digital assistant on managed devices. [...]..."
  },
  {
    "title": "Hackers target misconfigured proxies to access paid LLM services",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-target-misconfigured-proxies-to-access-paid-llm-services/",
    "date": "2026-01-09T19:56:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are systematically hunting for misconfigured proxy servers that could provide access to commercial large language model (LLM) services. [...]..."
  },
  {
    "title": "China-Linked Hackers Exploit VMware ESXi Zero-Days to Escape Virtual Machines",
    "link": "https://thehackernews.com/2026/01/chinese-linked-hackers-exploit-vmware.html",
    "date": "2026-01-09T17:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Chinese-speaking threat actors are suspected to have leveraged a compromised SonicWall VPN appliance as an initial access vector to deploy a VMware ESXi exploit that may have been developed as far bac..."
  },
  {
    "title": "Illicit Crypto Economy Surges as Nation-States Join in the Fray",
    "link": "https://www.darkreading.com/cyber-risk/illicit-crypto-economy-surges-nation-states",
    "date": "2026-01-09T16:56:15.000Z",
    "source": "Dark Reading",
    "summary": "Cybercriminal cryptocurrency transactions totaled billions in 2025, with activity from sanctioned countries like Russia and Iran causing the largest jump...."
  },
  {
    "title": "Illinois Department of Human Services data breach affects 700K people",
    "link": "https://www.bleepingcomputer.com/news/security/illinois-department-of-human-services-data-breach-affects-700k-people/",
    "date": "2026-01-09T15:37:41.000Z",
    "source": "Bleeping Computer",
    "summary": "The Illinois Department of Human Services (IDHS), one of Illinois' largest state agencies, accidentally exposed the personal and health data of nearly 700,000 residents due to incorrect privacy settin..."
  },
  {
    "title": "Russian APT28 Runs Credential-Stealing Campaign Targeting Energy and Policy Organizations",
    "link": "https://thehackernews.com/2026/01/russian-apt28-runs-credential-stealing.html",
    "date": "2026-01-09T15:28:00.000Z",
    "source": "The Hacker News",
    "summary": "Russian state-sponsored threat actors have been linked to a fresh set of credential harvesting attacks targeting individuals associated with a Turkish energy and nuclear research agency, as well as st..."
  },
  {
    "title": "Email security needs more seatbelts: Why click rate is the wrong metric",
    "link": "https://www.bleepingcomputer.com/news/security/email-security-needs-more-seatbelts-why-click-rate-is-the-wrong-metric/",
    "date": "2026-01-09T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Click rate misses the real email security risk: what attackers can do after they access a mailbox. Material Security explains why containment and post-compromise impact matter more than phishing metri..."
  },
  {
    "title": "Illinois man charged with hacking Snapchat accounts to steal nude photos",
    "link": "https://www.bleepingcomputer.com/news/security/illinois-man-charged-with-hacking-snapchat-accounts-to-steal-nude-photos/",
    "date": "2026-01-09T13:46:29.000Z",
    "source": "Bleeping Computer",
    "summary": "U.S. prosecutors have charged an Illinois man with orchestrating a phishing operation that allowed him to hack the Snapchat accounts of nearly 600 women to steal private photos and sell them online. [..."
  },
  {
    "title": "Cybersecurity Predictions 2026: The Hype We Can Ignore (And the Risks We Can't)",
    "link": "https://thehackernews.com/2026/01/cybersecurity-predictions-2026-hype-we.html",
    "date": "2026-01-09T11:09:00.000Z",
    "source": "The Hacker News",
    "summary": "As organizations plan for 2026, cybersecurity predictions are everywhere. Yet many strategies are still shaped by headlines and speculation rather than evidence. The real challenge isn’t a lack of for..."
  },
  {
    "title": "Trend Micro warns of critical Apex Central RCE vulnerability",
    "link": "https://www.bleepingcomputer.com/news/security/trend-micro-fixes-critical-rce-flaw-in-apex-central-console/",
    "date": "2026-01-09T10:40:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Japanese cybersecurity software firm Trend Micro has patched a critical security flaw in Apex Central (on-premise) that could allow attackers to execute arbitrary code with SYSTEM privileges. [...]..."
  },
  {
    "title": "Trend Micro Apex Central RCE Flaw Scores 9.8 CVSS in On-Prem Windows Versions",
    "link": "https://thehackernews.com/2026/01/trend-micro-apex-central-rce-flaw.html",
    "date": "2026-01-09T10:01:00.000Z",
    "source": "The Hacker News",
    "summary": "Trend Micro has released security updates to address multiple security vulnerabilities impacting on-premise versions of Apex Central for Windows, including a critical bug that could result in arbitrar..."
  },
  {
    "title": "CISA Retires 10 Emergency Cybersecurity Directives Issued Between 2019 and 2024",
    "link": "https://thehackernews.com/2026/01/cisa-retires-10-emergency-cybersecurity.html",
    "date": "2026-01-09T09:11:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday said it's retiring 10 emergency directives (Eds) that were issued between 2019 and 2024.\nThe list of the directives now con..."
  },
  {
    "title": "Russia’s Fancy Bear APT Doubles Down on Global Secrets Theft",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/russian-apt-credentials-global-targets",
    "date": "2026-01-09T07:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The notorious Russian state-sponsored group relies on basic techniques that are highly effective, often delivering greater ROI than more complex malware-heavy operations...."
  },
  {
    "title": "FBI Warns North Korean Hackers Using Malicious QR Codes in Spear-Phishing",
    "link": "https://thehackernews.com/2026/01/fbi-warns-north-korean-hackers-using.html",
    "date": "2026-01-09T05:46:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Federal Bureau of Investigation (FBI) on Thursday released an advisory warning of North Korean state-sponsored threat actors leveraging malicious QR codes in spear-phishing campaigns targetin..."
  },
  {
    "title": "CISA retires 10 emergency cyber orders in rare bulk closure",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-retires-10-emergency-cyber-orders-in-rare-bulk-closure/",
    "date": "2026-01-09T03:46:07.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has retired 10 Emergency Directives issued between 2019 and 2024, saying that the required actions have been completed or are now cover..."
  },
  {
    "title": "CrowdStrike to Buy SGNL to Expand Identity Security Capabilities",
    "link": "https://www.darkreading.com/endpoint-security/crowdsrike-buy-sgnl-expand-identity-security-capabilities",
    "date": "2026-01-08T23:37:23.000Z",
    "source": "Dark Reading",
    "summary": "The CrowdStrike-SGNL deal underscores how identity security has become a critical component of enterprise cybersecurity as companies add cloud services and deploy AI-driven tools...."
  },
  {
    "title": "Maximum Severity HPE OneView Flaw Exploited in the Wild",
    "link": "https://www.darkreading.com/vulnerabilities-threats/maximum-severity-hpe-oneview-flaw-exploited",
    "date": "2026-01-08T22:21:29.000Z",
    "source": "Dark Reading",
    "summary": "Exploitation of CVE-2025-37164 can enable remote code execution on HPE's IT infrastructure management platform, leading to devastating consequences...."
  },
  {
    "title": "Fake AI Chrome Extensions Steal 900K Users' Data",
    "link": "https://www.darkreading.com/cloud-security/fake-ai-chrome-extensions-steal-900k-users-data",
    "date": "2026-01-08T21:34:40.000Z",
    "source": "Dark Reading",
    "summary": "Threat actors ripped off a legitimate AI-powered Chrome extension in order to harvest ChatGPT and DeepSeek data before sending it to a C2 server...."
  },
  {
    "title": "ChatGPT's Memory Feature Supercharges Prompt Injection",
    "link": "https://www.darkreading.com/endpoint-security/chatgpt-memory-feature-prompt-injection",
    "date": "2026-01-08T20:23:34.000Z",
    "source": "Dark Reading",
    "summary": "The \"ZombieAgent\" exploit makes use of ChatGPT's long-term memory and advanced capabilities...."
  },
  {
    "title": "WhatsApp Worm Spreads Astaroth Banking Trojan Across Brazil via Contact Auto-Messaging",
    "link": "https://thehackernews.com/2026/01/whatsapp-worm-spreads-astaroth-banking.html",
    "date": "2026-01-08T17:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign that uses WhatsApp as a distribution vector for a Windows banking trojan called Astaroth in attacks targeting Brazil.\nThe campaign ha..."
  },
  {
    "title": "Here's What Cloud Security's Future Holds for the Year Ahead",
    "link": "https://www.darkreading.com/cloud-security/heres-cloud-security-holds-year-ahead",
    "date": "2026-01-08T15:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Here are the top cloud security trends I'm seeing in my crystal ball for the New Year — particularly arming us for AI adoption...."
  }
]