[
  {
    "title": "AI Agent Identity Management: A New Security Control Plane for CISOs",
    "link": "https://www.bleepingcomputer.com/news/security/ai-agent-identity-management-a-new-security-control-plane-for-cisos/",
    "date": "2026-02-03T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Autonomous AI agents are creating a new identity blind spot as they operate outside traditional IAM controls. Token Security shows why managing the full lifecycle of AI agent identities is becoming a ..."
  },
  {
    "title": "UK privacy watchdog probes Grok over AI-generated sexual images",
    "link": "https://www.bleepingcomputer.com/news/security/uk-privacy-watchdog-probes-grok-over-ai-generated-sexual-images/",
    "date": "2026-02-03T14:25:50.000Z",
    "source": "Bleeping Computer",
    "summary": "The United Kingdom's data protection authority launched a formal investigation into X and its Irish subsidiary over reports that the Grok AI assistant was used to generate nonconsensual sexual images...."
  },
  {
    "title": "[Webinar] The Smarter SOC Blueprint: Learn What to Build, Buy, and Automate",
    "link": "https://thehackernews.com/2026/02/webinar-smarter-soc-blueprint-learn.html",
    "date": "2026-02-03T14:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Most security teams today are buried under tools. Too many dashboards. Too much noise. Not enough real progress.\nEvery vendor promises “complete coverage” or “AI-powered automation,” but inside most S..."
  },
  {
    "title": "Hackers Exploit Metro4Shell RCE Flaw in React Native CLI npm Package",
    "link": "https://thehackernews.com/2026/02/hackers-exploit-metro4shell-rce-flaw-in.html",
    "date": "2026-02-03T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed exploiting a critical security flaw impacting the Metro Development Server in the popular \"@react-native-community/cli\" npm package.\nCybersecurity company VulnCheck sa..."
  },
  {
    "title": "Hackers exploit critical React Native Metro bug to breach dev systems",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-critical-react-native-metro-bug-to-breach-dev-systems/",
    "date": "2026-02-03T14:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are targeting developers by exploiting the critical vulnerability CVE-2025-11953 in the Metro server for React Native to deliver malicious payloads for Windows and Linux. [...]..."
  },
  {
    "title": "French prosecutors raid X offices, summon Musk over Grok deepfakes",
    "link": "https://www.bleepingcomputer.com/news/security/french-prosecutors-raid-x-offices-over-grok-sexual-deepfakes/",
    "date": "2026-02-03T12:43:37.000Z",
    "source": "Bleeping Computer",
    "summary": "French prosecutors have raided X's offices in Paris on Tuesday as part of a criminal investigation into the platform's Grok AI tool, widely used to generate sexually explicit images. [...]..."
  },
  {
    "title": "When Cloud Outages Ripple Across the Internet",
    "link": "https://thehackernews.com/2026/02/when-cloud-outages-ripple-across.html",
    "date": "2026-02-03T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Recent major cloud service outages have been hard to miss. High-profile incidents affecting providers such as AWS, Azure, and Cloudflare have disrupted large parts of the internet, taking down website..."
  },
  {
    "title": "APT28 Uses Microsoft Office CVE-2026-21509 in Espionage-Focused Malware Attacks",
    "link": "https://thehackernews.com/2026/02/apt28-uses-microsoft-office-cve-2026.html",
    "date": "2026-02-03T09:12:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russia-linked state-sponsored threat actor known as APT28 (aka UAC-0001) has been attributed to attacks exploiting a newly disclosed security flaw in Microsoft Office as part of a campaign codenam..."
  },
  {
    "title": "Mozilla Adds One-Click Option to Disable Generative AI Features in Firefox",
    "link": "https://thehackernews.com/2026/02/mozilla-adds-one-click-option-to.html",
    "date": "2026-02-03T05:39:00.000Z",
    "source": "The Hacker News",
    "summary": "Mozilla on Monday announced a new controls section in its Firefox desktop browser settings that allows users to completely turn off generative artificial intelligence (GenAI) features.\n\"It provides a ..."
  },
  {
    "title": "Notepad++ Hosting Breach Attributed to China-Linked Lotus Blossom Hacking Group",
    "link": "https://thehackernews.com/2026/02/notepad-hosting-breach-attributed-to.html",
    "date": "2026-02-03T04:55:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-linked threat actor known as Lotus Blossom has been attributed with medium confidence to the recently discovered compromise of the infrastructure hosting Notepad++.\nThe attack enabled the stat..."
  },
  {
    "title": "Attackers Harvest Dropbox Logins Via Fake PDF Lures",
    "link": "https://www.darkreading.com/cloud-security/attackers-harvest-dropbox-logins-fake-pdf-lures",
    "date": "2026-02-02T22:21:33.000Z",
    "source": "Dark Reading",
    "summary": "A malware-free phishing campaign targets corporate inboxes and asks employees to view \"request orders,\" ultimately leading to Dropbox credential theft...."
  },
  {
    "title": "New GlassWorm attack targets macOS via compromised OpenVSX extensions",
    "link": "https://www.bleepingcomputer.com/news/security/new-glassworm-attack-targets-macos-via-compromised-openvsx-extensions/",
    "date": "2026-02-02T22:04:19.000Z",
    "source": "Bleeping Computer",
    "summary": "A new GlassWorm malware attack through compromised OpenVSX extensions focuses on stealing passwords, crypto-wallet data, and developer credentials and configurations from macOS systems. [...]..."
  },
  {
    "title": "County Pays $600K to Wrongfully Jailed Pen Testers",
    "link": "https://www.darkreading.com/cybersecurity-operations/county-pays-600k-wrongfully-jailed-pen-testers",
    "date": "2026-02-02T21:57:51.000Z",
    "source": "Dark Reading",
    "summary": "Iowa police arrested two penetration testers in 2019 for doing their jobs, highlighting the risk to security professionals in red teaming exercises...."
  },
  {
    "title": "Russian hackers exploit recently patched Microsoft Office bug in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/russian-hackers-exploit-recently-patched-microsoft-office-bug-in-attacks/",
    "date": "2026-02-02T21:00:07.000Z",
    "source": "Bleeping Computer",
    "summary": "Ukraine's Computer Emergency Response Team (CERT) says that Russian hackers are exploiting CVE-2026-21509, a recently patched vulnerability in multiple versions of Microsoft Office. [...]..."
  },
  {
    "title": "Chinese Hackers Hijack Notepad++ Updates for 6 Months",
    "link": "https://www.darkreading.com/application-security/chinese-hackers-hijack-notepad-updates-6-months",
    "date": "2026-02-02T19:57:02.000Z",
    "source": "Dark Reading",
    "summary": "State-sponsored threat actors compromised the popular code editor's hosting provider to redirect targeted users to malicious downloads...."
  },
  {
    "title": "Malicious MoltBot skills used to push password-stealing malware",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-moltbot-skills-used-to-push-password-stealing-malware/",
    "date": "2026-02-02T19:11:12.000Z",
    "source": "Bleeping Computer",
    "summary": "More than 230 malicious packages for the personal AI assistant OpenClaw (formerly known as Moltbot and ClawdBot) have been published in less than a week on the tool's official registry and on GitHub. ..."
  },
  {
    "title": "Mozilla announces switch to disable all Firefox AI features",
    "link": "https://www.bleepingcomputer.com/news/software/mozilla-will-let-you-turn-off-all-firefox-ai-features/",
    "date": "2026-02-02T18:09:13.000Z",
    "source": "Bleeping Computer",
    "summary": "In response to user feedback on AI integration, Mozilla announced today that the next Firefox release will let users disable AI features entirely or manage them individually. [...]..."
  },
  {
    "title": "Researchers Find 341 Malicious ClawHub Skills Stealing Data from OpenClaw Users",
    "link": "https://thehackernews.com/2026/02/researchers-find-341-malicious-clawhub.html",
    "date": "2026-02-02T17:49:00.000Z",
    "source": "The Hacker News",
    "summary": "A security audit of 2,857 skills on ClawHub has found 341 malicious skills across multiple campaigns, according to new findings from Koi Security, exposing users to new supply chain risks.\nClawHub is ..."
  },
  {
    "title": "Microsoft: January update shutdown bug affects more Windows PCs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-january-update-shutdown-bug-affects-more-windows-pcs/",
    "date": "2026-02-02T17:17:30.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed that a known issue preventing some Windows 11 devices from shutting down also affects Windows 10 systems with Virtual Secure Mode (VSM) enabled. [...]..."
  },
  {
    "title": "OpenClaw Bug Enables One-Click Remote Code Execution via Malicious Link",
    "link": "https://thehackernews.com/2026/02/openclaw-bug-enables-one-click-remote.html",
    "date": "2026-02-02T16:28:00.000Z",
    "source": "The Hacker News",
    "summary": "A high-severity security flaw has been disclosed in OpenClaw (formerly referred to as Clawdbot and Moltbot) that could allow remote code execution (RCE) through a crafted malicious link.\nThe issue, wh..."
  },
  {
    "title": "ShinyHunters Expands Scope of SaaS Extortion Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/shinyhunters-expands-scope-saas-extortion-attacks",
    "date": "2026-02-02T16:07:57.000Z",
    "source": "Dark Reading",
    "summary": "Following their attacks on Salesforce instances last year, members of the cybercrime group have broadened their targeting and gotten more aggressive with extortion tactics...."
  },
  {
    "title": "Microsoft Begins NTLM Phase-Out With Three-Stage Plan to Move Windows to Kerberos",
    "link": "https://thehackernews.com/2026/02/microsoft-begins-ntlm-phase-out-with.html",
    "date": "2026-02-02T15:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has announced a three-phase approach to phase out New Technology LAN Manager (NTLM) as part of its efforts to shift Windows environments toward stronger, Kerberos-based options.\nThe developm..."
  },
  {
    "title": "CTM360 Report Warns of Global Surge in Fake High-Yield Investment Scams",
    "link": "https://www.bleepingcomputer.com/news/security/ctm360-report-warns-of-global-surge-in-fake-high-yield-investment-scams/",
    "date": "2026-02-02T15:34:44.000Z",
    "source": "Bleeping Computer",
    "summary": "Fake high-yield investment platforms are surging worldwide, promising \"guaranteed\" returns that mask classic Ponzi schemes.CTM360 explains how HYIP scams scale through social media, recycled templates..."
  },
  {
    "title": "Notepad++ update feature hijacked by Chinese state hackers for months",
    "link": "https://www.bleepingcomputer.com/news/security/notepad-plus-plus-update-feature-hijacked-by-chinese-state-hackers-for-months/",
    "date": "2026-02-02T14:53:52.000Z",
    "source": "Bleeping Computer",
    "summary": "Chinese state-sponsored threat actors were likely behind the hijacking of Notepad++ update traffic last year that lasted for almost half a year, the developer states in an official announcement today...."
  },
  {
    "title": "Panera Bread breach impacts 5.1 million accounts, not 14 million customers ",
    "link": "https://www.bleepingcomputer.com/news/security/panera-bread-data-breach-impacts-51-million-accounts-not-14-million-customers/",
    "date": "2026-02-02T13:46:39.000Z",
    "source": "Bleeping Computer",
    "summary": "The data breach notification service Have I Been Pwned says that a data breach at the U.S. food chain Panera Bread affected 5.1 million accounts, not 14 million customers as previously reported. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Proxy Botnet, Office Zero-Day, MongoDB Ransoms, AI Hijacks & New Threats",
    "link": "https://thehackernews.com/2026/02/weekly-recap-proxy-botnet-office-zero.html",
    "date": "2026-02-02T11:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Every week brings new discoveries, attacks, and defenses that shape the state of cybersecurity. Some threats are stopped quickly, while others go unseen until they cause real damage.\nSometimes a singl..."
  },
  {
    "title": "Securing the Mid-Market Across the Complete Threat Lifecycle",
    "link": "https://thehackernews.com/2026/02/securing-mid-market-across-complete.html",
    "date": "2026-02-02T11:45:00.000Z",
    "source": "The Hacker News",
    "summary": "For mid-market organizations, cybersecurity is a constant balancing act. Proactive, preventative security measures are essential to protect an expanding attack surface. Combined with effective protect..."
  },
  {
    "title": "Microsoft fixes bug causing password sign-in option to disappear",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-bug-causing-password-sign-in-option-to-disappear/",
    "date": "2026-02-02T11:34:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has fixed a known issue that was causing the password sign-in option to disappear from the lock screen options after installing Windows 11 updates released since August 2025. [...]..."
  },
  {
    "title": "NationStates confirms data breach, shuts down game site",
    "link": "https://www.bleepingcomputer.com/news/security/nationstates-confirms-data-breach-shuts-down-game-site/",
    "date": "2026-02-02T10:05:57.000Z",
    "source": "Bleeping Computer",
    "summary": "NationStates, a multiplayer browser-based game, has confirmed a data breach after taking its website offline earlier this week to investigate a security incident. [...]..."
  },
  {
    "title": "Notepad++ Official Update Mechanism Hijacked to Deliver Malware to Select Users",
    "link": "https://thehackernews.com/2026/02/notepad-official-update-mechanism.html",
    "date": "2026-02-02T08:55:00.000Z",
    "source": "The Hacker News",
    "summary": "The maintainer of Notepad++ has revealed that state-sponsored attackers hijacked the utility's update mechanism to redirect update traffic to malicious servers instead.\n\"The attack involved [an] infra..."
  }
]