[
  {
    "title": "Hackers claim to hack Resecurity, firm says it was a honeypot",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-claim-resecurity-hack-firm-says-it-was-a-honeypot/",
    "date": "2026-01-03T20:34:22.000Z",
    "source": "Bleeping Computer",
    "summary": "The ShinyHunters hacking group claims it breached the systems of cybersecurity firm Resecurity and stole internal data, while Resecurity says the attackers only accessed a deliberately deployed honeyp..."
  },
  {
    "title": "Covenant Health says May data breach impacted nearly 478,000 patients",
    "link": "https://www.bleepingcomputer.com/news/security/covenant-health-says-may-data-breach-impacted-nearly-478-000-patients/",
    "date": "2026-01-02T19:00:42.000Z",
    "source": "Bleeping Computer",
    "summary": "The Covenant Health organization has revised to nearly 500,000 the number of individuals affected by a data breach discovered last May. [...]..."
  },
  {
    "title": "Cryptocurrency theft attacks traced to 2022 LastPass breach",
    "link": "https://www.bleepingcomputer.com/news/security/cryptocurrency-theft-attacks-traced-to-2022-lastpass-breach/",
    "date": "2026-01-02T17:28:01.000Z",
    "source": "Bleeping Computer",
    "summary": "Blockchain investigation firm TRM Labs says ongoing cryptocurrency thefts have been traced to the 2022 LastPass breach, with attackers draining wallets years after encrypted vaults were stolen and lau..."
  },
  {
    "title": "Over 10K Fortinet firewalls exposed to actively exploited 2FA bypass",
    "link": "https://www.bleepingcomputer.com/news/security/over-10-000-fortinet-firewalls-exposed-to-ongoing-2fa-bypass-attacks/",
    "date": "2026-01-02T16:01:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Over 10,000 Internet-exposed Fortinet firewalls are still vulnerable to attacks exploiting a five-year-old two-factor authentication (2FA) bypass vulnerability. [...]..."
  },
  {
    "title": "Google is testing a new image AI and it's going to be its fastest model",
    "link": "https://www.bleepingcomputer.com/news/google/google-is-testing-a-new-image-ai-and-its-going-to-be-its-fastest-model/",
    "date": "2026-01-02T15:19:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Google is testing a new image AI model called \"Nano Banana 2 Flash,\" and it's going to be as good as the Gemini 3 Pro Nano Banana, but it'll be cheaper. [...]..."
  },
  {
    "title": "The Kimwolf Botnet is Stalking Your Local Network",
    "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
    "date": "2026-01-02T14:20:10.000Z",
    "source": "Krebs on Security",
    "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a ..."
  },
  {
    "title": "Trust Wallet links $8.5 million crypto theft to Shai-Hulud NPM attack",
    "link": "https://www.bleepingcomputer.com/news/security/trust-wallet-links-85-million-crypto-theft-to-shai-hulud-npm-attack/",
    "date": "2026-01-02T14:19:40.000Z",
    "source": "Bleeping Computer",
    "summary": "Trust Wallet believes the compromise of its web browser to steal roughly $8.5 million from over 2,500 crypto wallets is likely related to an \"industry-wide\" Sha1-Hulud attack in November. [...]..."
  },
  {
    "title": "Cybersecurity Predictions for 2026: Navigating the Future of Digital Threats",
    "link": "https://www.darkreading.com/threat-intelligence/cybersecurity-predictions-for-2026-navigating-the-future-of-digital-threats",
    "date": "2026-01-02T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Cybersecurity experts discuss 2026 predictions, highlighting the rise of AI-driven threats, the shift to resilience over prevention, and the urgent need for advanced security measures to combat evolvi..."
  },
  {
    "title": "CTO New Year Resolutions for a More Secure 2026",
    "link": "https://www.darkreading.com/cyber-risk/cto-new-year-resolutions-for-a-more-secure-2026",
    "date": "2026-01-02T13:55:02.000Z",
    "source": "Dark Reading",
    "summary": "From securing MCPs and supply chain defenses to formal AI and quantum governance, experts share their wish lists for cyber safety in 2026...."
  },
  {
    "title": "Transparent Tribe Launches New RAT Attacks Against Indian Government and Academia",
    "link": "https://thehackernews.com/2026/01/transparent-tribe-launches-new-rat.html",
    "date": "2026-01-02T13:52:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Transparent Tribe has been attributed to a fresh set of attacks targeting Indian governmental, academic, and strategic entities with a remote access trojan (RAT) that grants ..."
  },
  {
    "title": "The ROI Problem in Attack Surface Management",
    "link": "https://thehackernews.com/2026/01/the-roi-problem-in-attack-surface.html",
    "date": "2026-01-02T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Attack Surface Management (ASM) tools promise reduced risk. What they usually deliver is more information. \nSecurity teams deploy ASM, asset inventories grow, alerts start flowing, and dashboards fill..."
  },
  {
    "title": "Cybercriminals Abuse Google Cloud Email Feature in Multi-Stage Phishing Campaign",
    "link": "https://thehackernews.com/2026/01/cybercriminals-abuse-google-cloud-email.html",
    "date": "2026-01-02T09:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a phishing campaign that involves the attackers impersonating legitimate Google-generated messages by abusing Google Cloud's Application Integration..."
  },
  {
    "title": "OpenAI is offering $20 ChatGPT Plus for free to some users",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-offering-20-chatgpt-plus-for-free-to-some-users/",
    "date": "2026-01-01T19:18:54.000Z",
    "source": "Bleeping Computer",
    "summary": "If you're already subscribed to ChatGPT Plus, which costs $20, you can request OpenAI to cancel your subscription, and it may offer one month of free usage. [...]..."
  },
  {
    "title": "The biggest cybersecurity and cyberattack stories of 2025",
    "link": "https://www.bleepingcomputer.com/news/security/the-biggest-cybersecurity-and-cyberattack-stories-of-2025/",
    "date": "2026-01-01T16:15:26.000Z",
    "source": "Bleeping Computer",
    "summary": "2025 was a big year for cybersecurity, with cyberattacks, data breaches, threat groups reaching new notoriety levels, and, of course, zero-day flaws exploited in breaches. Some stories, though, were m..."
  },
  {
    "title": "ThreatsDay Bulletin: GhostAd Drain, macOS Attacks, Proxy Botnets, Cloud Exploits, and 12+ Stories",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-ghostad-drain-macos.html",
    "date": "2026-01-01T15:52:00.000Z",
    "source": "The Hacker News",
    "summary": "The first ThreatsDay Bulletin of 2026 lands on a day that already feels symbolic — new year, new breaches, new tricks. If the past twelve months taught defenders anything, it’s that threat actors don’..."
  },
  {
    "title": "New GlassWorm malware wave targets Macs with trojanized crypto wallets",
    "link": "https://www.bleepingcomputer.com/news/security/new-glassworm-malware-wave-targets-macs-with-trojanized-crypto-wallets/",
    "date": "2026-01-01T15:18:23.000Z",
    "source": "Bleeping Computer",
    "summary": "A fourth wave of the \"GlassWorm\" campaign is targeting macOS developers with malicious VSCode/OpenVSX extensions that deliver trojanized versions of crypto wallet applications. [...]..."
  },
  {
    "title": "RondoDox Botnet Exploits Critical React2Shell Flaw to Hijack IoT Devices and Web Servers",
    "link": "https://thehackernews.com/2026/01/rondodox-botnet-exploits-critical.html",
    "date": "2026-01-01T09:19:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a persistent nine-month-long campaign that has targeted Internet of Things (IoT) devices and web applications to enroll them into a botnet known as ..."
  },
  {
    "title": "How To Browse Faster and Get More Done Using Adapt Browser",
    "link": "https://thehackernews.com/2026/01/how-to-browse-fast-using-a-lightweight-browser.html",
    "date": "2026-01-01T05:47:00.000Z",
    "source": "The Hacker News",
    "summary": "As web browsers evolve into all-purpose platforms, performance and productivity often suffer. \nFeature overload, excessive background processes, and fragmented workflows can slow down browsing session..."
  },
  {
    "title": "NYC mayoral inauguration bans Flipper Zero, Raspberry Pi devices ",
    "link": "https://www.bleepingcomputer.com/news/security/nyc-mayoral-inauguration-bans-flipper-zero-raspberry-pi-devices/",
    "date": "2025-12-31T22:52:44.000Z",
    "source": "Bleeping Computer",
    "summary": "New York City's 2026 mayoral inauguration of Zohran Mamdani has published a list of banned items for the event, specifically prohibiting the Flipper Zero and Raspberry Pi devices. [...]..."
  },
  {
    "title": "Sunken Ships: Will Orgs Learn From Ivanti EPMM Attacks?",
    "link": "https://www.darkreading.com/cyber-risk/sunken-ships-ivanti-epmm-attacks",
    "date": "2025-12-31T17:35:27.000Z",
    "source": "Dark Reading",
    "summary": "The April/May zero-day exploitations of Ivanti's mobile device management platform meant unprecedented pwning of thousands of orgs by a Chinese APT — and history will probably repeat itself...."
  },
  {
    "title": "Trust Wallet Chrome Extension Hack Drains $8.5M via Shai-Hulud Supply Chain Attack",
    "link": "https://thehackernews.com/2025/12/trust-wallet-chrome-extension-hack.html",
    "date": "2025-12-31T16:29:00.000Z",
    "source": "The Hacker News",
    "summary": "Trust Wallet on Tuesday revealed that the second iteration of the Shai-Hulud (aka Sha1-Hulud) supply chain outbreak in November 2025 was likely responsible for the hack of its Google Chrome extension,..."
  },
  {
    "title": "DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide",
    "link": "https://thehackernews.com/2025/12/darkspectre-browser-extension-campaigns.html",
    "date": "2025-12-31T16:14:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor behind two malicious browser extension campaigns, ShadyPanda and GhostPoster, has been attributed to a third attack campaign codenamed DarkSpectre that has impacted 2.2 million users ..."
  },
  {
    "title": "Hackers drain $3.9M from Unleash Protocol after multisig hijack",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-drain-39m-from-unleash-protocol-after-multisig-hijack/",
    "date": "2025-12-31T15:54:17.000Z",
    "source": "Bleeping Computer",
    "summary": "The decentralized intellectual property platform Unleash Protocol has lost around $3.9 million worth of cryptocurrency after someone executed an unauthorized contract upgrade that allowed asset withdr..."
  },
  {
    "title": "When the Cloud Rains on Everyone's IoT Parade",
    "link": "https://www.darkreading.com/iot/when-cloud-rains-on-everyone-iot-parade",
    "date": "2025-12-31T14:31:37.000Z",
    "source": "Dark Reading",
    "summary": "What happens to all of those always-connected devices when the cloud goes down? Disruptions to sleep, school, and smart homes, just to name a few issues...."
  },
  {
    "title": "Identity Security 2026: Four Predictions &amp; Recommendations",
    "link": "https://www.darkreading.com/identity-access-management-security/identity-security-2026-predictions-and-recommendations",
    "date": "2025-12-31T14:00:58.000Z",
    "source": "Dark Reading",
    "summary": "Agentic AI adoption and identity security risks, IGA expands in mid-market, SOC-identity team collaboration, and identity platform consolidation — this 2026 predictions post previews identity trends...."
  },
  {
    "title": "Contrarians No More: AI Skepticism Is on the Rise",
    "link": "https://www.darkreading.com/cybersecurity-operations/contrarians-no-more-ai-skepticism",
    "date": "2025-12-31T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Concerns about an economic bubble bursting, along with doubts regarding return on investment, suggest the tide may be turning for the artificial intelligence industry...."
  },
  {
    "title": "Critical CVSS 9.8 Flaw Found in IBM API Connect Authentication System",
    "link": "https://thehackernews.com/2025/12/ibm-warns-of-critical-api-connect-bug.html",
    "date": "2025-12-31T13:37:00.000Z",
    "source": "The Hacker News",
    "summary": "IBM has disclosed details of a critical security flaw in API Connect that could allow attackers to gain remote access to the application.\nThe vulnerability, tracked as CVE-2025-13915, is rated 9.8 out..."
  },
  {
    "title": "Researchers Spot Modified Shai-Hulud Worm Testing Payload on npm Registry",
    "link": "https://thehackernews.com/2025/12/researchers-spot-modified-shai-hulud.html",
    "date": "2025-12-31T13:29:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of what appears to be a new strain of Shai Hulud on the npm registry with slight modifications from the previous wave observed last month.\nThe npm pack..."
  },
  {
    "title": "U.S. Treasury Lifts Sanctions on Three Individuals Linked to Intellexa and Predator Spyware",
    "link": "https://thehackernews.com/2025/12/us-treasury-lifts-sanctions-on-three.html",
    "date": "2025-12-31T05:17:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday removed three individuals linked to the Intellexa Consortium, the holding company behind a commercial spyware k..."
  },
  {
    "title": "CSA Issues Alert on Critical SmarterMail Bug Allowing Remote Code Execution",
    "link": "https://thehackernews.com/2025/12/csa-issues-alert-on-critical.html",
    "date": "2025-12-30T16:28:00.000Z",
    "source": "The Hacker News",
    "summary": "The Cyber Security Agency of Singapore (CSA) has issued a bulletin warning of a maximum-severity security flaw in SmarterTools SmarterMail email software that could be exploited to achieve remote code..."
  }
]