[
  {
    "title": "HPE Issues Security Patch for StoreOnce Bug Allowing Remote Authentication Bypass",
    "link": "https://thehackernews.com/2025/06/hpe-issues-security-patch-for-storeonce.html",
    "date": "2025-06-04T05:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Hewlett Packard Enterprise (HPE) has released security updates to address as many as eight vulnerabilities in its StoreOnce data backup and deduplication solution that could result in an authenticatio..."
  },
  {
    "title": "OpenAI is hopeful GPT-5 will compete a little more",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-hopeful-gpt-5-will-compete-a-little-more/",
    "date": "2025-06-03T21:30:52.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI's next big foundational model is GPT-5, and the AI startup is hoping that the model will compete a little more with rivals. [...]..."
  },
  {
    "title": "LayerX Launches ExtensionPedia",
    "link": "https://www.darkreading.com/endpoint-security/layerx-launches-extensionpedia",
    "date": "2025-06-03T21:23:55.000Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "TXOne Networks Introduces Capability for Intelligent Vulnerability Mitigation",
    "link": "https://www.darkreading.com/ics-ot-security/txone-networks-intelligent-vulnerability-mitigation",
    "date": "2025-06-03T21:18:11.000Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "'Crocodilus' Sharpens Its Teeth on Android Users",
    "link": "https://www.darkreading.com/mobile-security/crocodilus-sharpens-teeth-android-users",
    "date": "2025-06-03T21:08:04.000Z",
    "source": "Dark Reading",
    "summary": "The data-stealing malware initially targeted users in Turkey but has since evolved into a global threat...."
  },
  {
    "title": "ChatGPT rolls out Memory upgrade for free users",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-rolls-out-memory-upgrade-for-free-users/",
    "date": "2025-06-03T20:55:51.000Z",
    "source": "Bleeping Computer",
    "summary": "ChatGPT's memory feature is now better and capable of referencing past conversations for free accounts. [...]..."
  },
  {
    "title": "Hewlett Packard Enterprise warns of critical StoreOnce auth bypass",
    "link": "https://www.bleepingcomputer.com/news/security/hewlett-packard-enterprise-warns-of-critical-storeonce-auth-bypass/",
    "date": "2025-06-03T20:55:02.000Z",
    "source": "Bleeping Computer",
    "summary": "Hewlett Packard Enterprise (HPE) has issued a security bulletin to warn about eight vulnerabilities impacting StoreOnce, its disk-based backup and deduplication solution. [...]..."
  },
  {
    "title": "Victoria's Secret Delays Earnings Call Due to Cyber Incident",
    "link": "https://www.darkreading.com/vulnerabilities-threats/victorias-secret-delays-earnings-cyber-incident",
    "date": "2025-06-03T20:00:17.000Z",
    "source": "Dark Reading",
    "summary": "But that didn't stop the clothing retailer from issuing preliminary results for the first quarter of 2025...."
  },
  {
    "title": "Chrome Drops Trust for Chunghwa, Netlock Certificates",
    "link": "https://www.darkreading.com/remote-workforce/chrome-drops-trust-chunghwa-netlock-certificates",
    "date": "2025-06-03T19:04:19.000Z",
    "source": "Dark Reading",
    "summary": "Digital certificates authorized by the authorities will no longer have trust by default in the browser starting in August, over what Google said is a loss of integrity in actions by the respective com..."
  },
  {
    "title": "LummaC2 Fractures as Acreed Malware Becomes Top Dog",
    "link": "https://www.darkreading.com/remote-workforce/lummac2-fractures-acreed-malware-top-dog",
    "date": "2025-06-03T18:40:02.000Z",
    "source": "Dark Reading",
    "summary": "LummaC2 formerly accounted for almost 92% of Russian Market's credential theft log alerts. Now, the Acreed infostealer has replaced its market share...."
  },
  {
    "title": "Best travel VPNs 2025: The top travel VPNs for unblocking services and avoiding censorship",
    "link": "https://www.zdnet.com/article/best-travel-vpn/",
    "date": "2025-06-03T18:01:19.000Z",
    "source": "ZDNet Security",
    "summary": "VPNs shield you from spying and online tracking. My favorite travel VPNs offer fast speeds, massive server networks, unlimited connections, and more...."
  },
  {
    "title": "Coinbase breach tied to bribed TaskUs support agents in India",
    "link": "https://www.bleepingcomputer.com/news/security/coinbase-breach-tied-to-bribed-taskus-support-agents-in-india/",
    "date": "2025-06-03T17:17:52.000Z",
    "source": "Bleeping Computer",
    "summary": "A recently disclosed data breach at Coinbase has been linked to India-based customer support representatives from outsourcing firm TaskUs, who threat actors bribed to steal data from the crypto exchan..."
  },
  {
    "title": "Microsoft adds quick machine recovery to Windows 11 settings",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-adds-quick-machine-recovery-to-windows-11-settings/",
    "date": "2025-06-03T15:50:07.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is testing a dedicated page in Windows Settings for quick machine recovery, which will provide users with additional configuration options. [...]..."
  },
  {
    "title": "Malicious RubyGems pose as Fastlane to steal Telegram API data",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-rubygems-pose-as-fastlane-to-steal-telegram-api-data/",
    "date": "2025-06-03T15:48:02.000Z",
    "source": "Bleeping Computer",
    "summary": "Two malicious RubyGems packages posing as popular Fastlane CI/CD plugins redirect Telegram API requests to attacker-controlled servers to intercept and steal data. [...]..."
  },
  {
    "title": "Fake DocuSign, Gitcode Sites Spread NetSupport RAT via Multi-Stage PowerShell Attack",
    "link": "https://thehackernews.com/2025/06/fake-docusign-gitcode-sites-spread.html",
    "date": "2025-06-03T15:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters are alerting to a new campaign that employs deceptive websites to trick unsuspecting users into executing malicious PowerShell scripts on their machines and infect them with the NetSupp..."
  },
  {
    "title": "Mozilla launches new system to detect Firefox crypto drainer add-ons",
    "link": "https://www.bleepingcomputer.com/news/security/mozilla-launches-new-system-to-detect-firefox-crypto-drainer-add-ons/",
    "date": "2025-06-03T14:29:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Mozilla has developed a new security feature for its add-on portal that helps block Firefox malicious extensions that drain cryptocurrency wallets. [...]..."
  },
  {
    "title": "Scattered Spider: Three things the news doesn’t tell you",
    "link": "https://www.bleepingcomputer.com/news/security/scattered-spider-three-things-the-news-doesnt-tell-you/",
    "date": "2025-06-03T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Scattered Spider isn't one group — it's an identity-first threat model evolving fast. From vishing to AiTM phishing, they're exploiting MFA gaps to hijack the cloud. Watch the Push Security webinar to..."
  },
  {
    "title": "Is Your CISO Navigating Your Flight Path?",
    "link": "https://www.darkreading.com/cybersecurity-operations/ciso-navigating-your-flight-path",
    "date": "2025-06-03T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "If your CISO isn't wielding influence with the CEO and helping top leaders clearly see the flight path ahead, your company is dangerously exposed...."
  },
  {
    "title": "CISA warns of ConnectWise ScreenConnect bug exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-connectwise-screenconnect-bug-exploited-in-attacks/",
    "date": "2025-06-03T13:57:12.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA is alerting federal agencies in the U.S. of hackers exploiting a recently patched ScreenConnect vulnerability that could lead to executing remote code on the server. [...]..."
  },
  {
    "title": "Victoria’s Secret delays earnings release after security incident",
    "link": "https://www.bleepingcomputer.com/news/security/victorias-secret-delays-earnings-release-after-security-incident/",
    "date": "2025-06-03T13:25:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Fashion retail giant Victoria's Secret has delayed its first quarter 2025 earnings release because of ongoing corporate system restoration efforts following a May 24 security incident. [...]..."
  },
  {
    "title": "Critical 10-Year-Old Roundcube Webmail Bug Allows Authenticated Users Run Malicious Code",
    "link": "https://thehackernews.com/2025/06/critical-10-year-old-roundcube-webmail.html",
    "date": "2025-06-03T13:01:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a critical security flaw in the Roundcube webmail software that has gone unnoticed for a decade and could be exploited to take over susceptible syst..."
  },
  {
    "title": "Wyze's new Bulb Cam turns any light socket into a 2K camera - for just $50",
    "link": "https://www.zdnet.com/article/wyzes-new-bulb-cam-turns-any-light-socket-into-a-2k-camera-for-just-50/",
    "date": "2025-06-03T13:00:20.000Z",
    "source": "ZDNet Security",
    "summary": "The new Wyze Bulb Cam replaces light bulbs and offers extra security coverage built into a motion-activated smart light...."
  },
  {
    "title": "Scattered Spider: Understanding Help Desk Scams and How to Defend Your Organization",
    "link": "https://thehackernews.com/2025/06/scattered-spider-understanding-help.html",
    "date": "2025-06-03T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "In the wake of high-profile attacks on UK retailers Marks & Spencer and Co-op, Scattered Spider has been all over the media, with coverage spilling over into the mainstream news due to the severity of..."
  },
  {
    "title": "Google patches new Chrome zero-day bug exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/google-patches-new-chrome-zero-day-bug-exploited-in-attacks/",
    "date": "2025-06-03T10:22:52.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has released an emergency security update to fix the third Chrome zero-day vulnerability exploited in attacks since the start of the year. [...]..."
  },
  {
    "title": "Android Trojan Crocodilus Now Active in 8 Countries, Targeting Banks and Crypto Wallets",
    "link": "https://thehackernews.com/2025/06/android-trojan-crocodilus-now-active-in.html",
    "date": "2025-06-03T09:34:00.000Z",
    "source": "The Hacker News",
    "summary": "A growing number of malicious campaigns have leveraged a recently discovered Android banking trojan called Crocodilus to target users in Europe and South America.\nThe malware, according to a new repor..."
  },
  {
    "title": "Android malware Crocodilus adds fake contacts to spoof trusted callers",
    "link": "https://www.bleepingcomputer.com/news/security/android-malware-crocodilus-adds-fake-contacts-to-spoof-trusted-callers/",
    "date": "2025-06-03T09:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "The latest version of the 'Crocodilus' Android malware has introduced a new mechanism that adds a fake contact on the infected device's contact list to deceive victims. [...]..."
  },
  {
    "title": "Google Chrome to Distrust Two Certificate Authorities Over Compliance and Conduct Issues",
    "link": "https://thehackernews.com/2025/06/google-chrome-to-distrust-two.html",
    "date": "2025-06-03T07:48:00.000Z",
    "source": "The Hacker News",
    "summary": "Google has revealed that it will no longer trust digital certificates issued by Chunghwa Telecom and Netlock citing \"patterns of concerning behavior observed over the past year.\"\nThe changes are expec..."
  },
  {
    "title": "Microsoft and CrowdStrike Launch Shared Threat Actor Glossary to Cut Attribution Confusion",
    "link": "https://thehackernews.com/2025/06/microsoft-and-crowdstrike-launch-shared.html",
    "date": "2025-06-03T07:20:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft and CrowdStrike have announced that they are teaming up to align their individual threat actor taxonomies by publishing a new joint threat actor mapping.\n\"By mapping where our knowledge of t..."
  },
  {
    "title": "New Chrome Zero-Day Actively Exploited; Google Issues Emergency Out-of-Band Patch",
    "link": "https://thehackernews.com/2025/06/new-chrome-zero-day-actively-exploited.html",
    "date": "2025-06-03T04:22:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Monday released out-of-band fixes to address three security issues in its Chrome browser, including one that it said has come under active exploitation in the wild.\nThe high-severity flaw is..."
  },
  {
    "title": "Cartier discloses data breach amid fashion brand cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/cartier-discloses-data-breach-amid-fashion-brand-cyberattacks/",
    "date": "2025-06-02T22:31:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Luxury fashion brand Cartier is warning customers it suffered a data breach that exposed customers' personal information after its systems were compromised. [...]..."
  }
]