[
  {
    "title": "Your password manager is under attack, and this new threat makes it worse: How to defend yourself",
    "link": "https://www.zdnet.com/article/your-password-manager-is-under-attack-and-this-new-threat-makes-it-worse-how-to-defend-yourself/",
    "date": "2025-05-09T08:00:17.000Z",
    "source": "ZDNet Security",
    "summary": "Heard of polymorphic browser extensions yet? You will. These savage imposters threaten the very future of credential management. Here's what you need to know - and do...."
  },
  {
    "title": "Google Rolls Out On-Device AI Protections to Detect Scams in Chrome and Android",
    "link": "https://thehackernews.com/2025/05/google-rolls-out-on-device-ai.html",
    "date": "2025-05-09T07:13:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Thursday announced it's rolling out new artificial intelligence (AI)-powered countermeasures to combat scams across Chrome, Search, and Android.\nThe tech giant said it will begin using Gemin..."
  },
  {
    "title": "Chinese Hackers Exploit SAP RCE Flaw CVE-2025-31324, Deploy Golang-Based SuperShell",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-exploit-sap-rce-flaw.html",
    "date": "2025-05-09T04:29:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-linked unnamed threat actor dubbed Chaya_004 has been observed exploiting a recently disclosed security flaw in SAP NetWeaver.\nForescout Vedere Labs, in a report published Thursday, said it un..."
  },
  {
    "title": "FBI: End-of-life routers hacked for cybercrime proxy networks",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-end-of-life-routers-hacked-for-cybercrime-proxy-networks/",
    "date": "2025-05-08T22:15:39.000Z",
    "source": "Bleeping Computer",
    "summary": "The FBI warns that threat actors are deploying malware on end-of-life (EoL) routers to convert them into proxies sold on the 5Socks and Anyproxy networks. [...]..."
  },
  {
    "title": "Cisco fixes max severity IOS XE flaw letting attackers hijack devices",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-fixes-max-severity-ios-xe-flaw-letting-attackers-hijack-devices/",
    "date": "2025-05-08T20:53:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco has fixed a maximum severity flaw in IOS XE Software for Wireless LAN Controllers by a hard-coded JSON Web Token (JWT) that allows an unauthenticated remote attacker to take over devices. [...]..."
  },
  {
    "title": "Education giant Pearson hit by cyberattack exposing customer data",
    "link": "https://www.bleepingcomputer.com/news/security/education-giant-pearson-hit-by-cyberattack-exposing-customer-data/",
    "date": "2025-05-08T20:14:09.000Z",
    "source": "Bleeping Computer",
    "summary": "Education giant Pearson suffered a cyberattack, allowing threat actors to steal corporate data and customer information, BleepingComputer has learned. [...]..."
  },
  {
    "title": "SonicWall Issues Patch for Exploit Chain in SMA Devices",
    "link": "https://www.darkreading.com/endpoint-security/sonicwall-patch-exploit-chain-sma-devices",
    "date": "2025-05-08T19:43:42.000Z",
    "source": "Dark Reading",
    "summary": "Three vulnerabilities in SMA 100 gateways could facilitate root RCE attacks, and one of the vulnerabilities has already been exploited in the wild...."
  },
  {
    "title": "Email-Based Attacks Top Cyber-Insurance Claims",
    "link": "https://www.darkreading.com/cyber-risk/email-based-attacks-cyber-insurance-claims",
    "date": "2025-05-08T19:03:55.000Z",
    "source": "Dark Reading",
    "summary": "Cyber-insurance carrier Coalition said business email compromise and funds transfer fraud accounted for 60% of claims in 2024...."
  },
  {
    "title": "Supply chain attack hits npm package with 45,000 weekly downloads",
    "link": "https://www.bleepingcomputer.com/news/security/supply-chain-attack-hits-npm-package-with-45-000-weekly-downloads/",
    "date": "2025-05-08T19:03:24.000Z",
    "source": "Bleeping Computer",
    "summary": "An npm package named 'rand-user-agent' has been compromised in a supply chain attack to inject obfuscated code that activates a remote access trojan (RAT) on the user's system. [...]..."
  },
  {
    "title": "Malicious PyPi package hides RAT malware, targets Discord devs since 2022",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-pypi-package-hides-rat-malware-targets-discord-devs-since-2022/",
    "date": "2025-05-08T18:51:14.000Z",
    "source": "Bleeping Computer",
    "summary": "A malicious Python package targeting Discord developers with remote access trojan (RAT) malware was spotted on the Python Package Index (PyPI) after more than three years. [...]..."
  },
  {
    "title": "How Google's AI combats new scam tactics - and how you can stay one step ahead",
    "link": "https://www.zdnet.com/article/how-googles-ai-combats-new-scam-tactics-and-how-you-can-stay-one-step-ahead/",
    "date": "2025-05-08T17:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "Google is trying to lock down Search, Chrome, and Android, but ultimately, you're the last line of defense...."
  },
  {
    "title": "Operation PowerOFF Takes Down 9 DDoS-for-Hire Domains",
    "link": "https://www.darkreading.com/threat-intelligence/operation-poweroff-takes-down-nine-ddos-domains",
    "date": "2025-05-08T16:43:12.000Z",
    "source": "Dark Reading",
    "summary": "Four different countries, including the United States and Germany, were included in the latest international operation alongside Europol's support...."
  },
  {
    "title": "Kickidler employee monitoring software abused in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/kickidler-employee-monitoring-software-abused-in-ransomware-attacks/",
    "date": "2025-05-08T16:05:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Ransomware operations are using legitimate Kickidler employee monitoring software for reconnaissance, tracking their victims' activity, and harvesting credentials after breaching their networks. [...]..."
  },
  {
    "title": "38,000+ FreeDrain Subdomains Found Exploiting SEO to Steal Crypto Wallet Seed Phrases",
    "link": "https://thehackernews.com/2025/05/38000-freedrain-subdomains-found.html",
    "date": "2025-05-08T15:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have exposed what they say is an \"industrial-scale, global cryptocurrency phishing operation\" engineered to steal digital assets from cryptocurrency wallets for several years..."
  },
  {
    "title": "VC giant Insight Partners confirms investor data stolen in breach",
    "link": "https://www.bleepingcomputer.com/news/security/vc-giant-insight-partners-confirms-investor-data-stolen-in-breach/",
    "date": "2025-05-08T15:01:39.000Z",
    "source": "Bleeping Computer",
    "summary": "Venture capital firm Insight Partners has confirmed that sensitive data for employees and limited partners was stolen in a January 2025 cyberattack. [...]..."
  },
  {
    "title": "Security Tools Alone Don't Protect You — Control Effectiveness Does",
    "link": "https://thehackernews.com/2025/05/security-tools-alone-dont-protect-you.html",
    "date": "2025-05-08T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "61% of security leaders reported suffering a breach due to failed or misconfigured controls over the past 12 months. This is despite having an average of 43 cybersecurity tools in place.\nThis massive ..."
  },
  {
    "title": "Life Without CVEs? It's Time to Act",
    "link": "https://www.darkreading.com/vulnerabilities-threats/life-without-cves-time-act",
    "date": "2025-05-08T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Despite all MITRE has done for cybersecurity, it is clear we should not wait 11 months to discuss the future of the CVE database. It's simply too important for that...."
  },
  {
    "title": "SonicWall Patches 3 Flaws in SMA 100 Devices Allowing Attackers to Run Code as Root",
    "link": "https://thehackernews.com/2025/05/sonicwall-patches-3-flaws-in-sma-100.html",
    "date": "2025-05-08T13:56:00.000Z",
    "source": "The Hacker News",
    "summary": "SonicWall has released patches to address three security flaws affecting SMA 100 Secure Mobile Access (SMA) appliances that could be fashioned to result in remote code execution.\nThe vulnerabilities a..."
  },
  {
    "title": "Qilin Ransomware Ranked Highest in April 2025 with 72 Data Leak Disclosures",
    "link": "https://thehackernews.com/2025/05/qilin-leads-april-2025-ransomware-spike.html",
    "date": "2025-05-08T13:47:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with ties to the Qilin ransomware family have leveraged malware known as SmokeLoader along with a previously undocumented .NET compiled loader codenamed NETXLOADER as part of a campaign ..."
  },
  {
    "title": "Google links new LostKeys data theft malware to Russian cyberspies",
    "link": "https://www.bleepingcomputer.com/news/security/google-links-new-lostkeys-data-theft-malware-to-russian-cyberspies/",
    "date": "2025-05-08T13:39:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Since the start of the year, the Russian state-backed ColdRiver hacking group has been using new LostKeys malware to steal files in espionage attacks targeting Western governments, journalists, think ..."
  },
  {
    "title": "SonicWall urges admins to patch VPN flaw exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-urges-admins-to-patch-vpn-flaw-exploited-in-attacks/",
    "date": "2025-05-08T11:19:58.000Z",
    "source": "Bleeping Computer",
    "summary": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks [...]..."
  },
  {
    "title": "MirrorFace Targets Japan and Taiwan with ROAMINGMOUSE and Upgraded ANEL Malware",
    "link": "https://thehackernews.com/2025/05/mirrorface-targets-japan-and-taiwan.html",
    "date": "2025-05-08T10:32:00.000Z",
    "source": "The Hacker News",
    "summary": "The nation-state threat actor known as MirrorFace has been observed deploying malware dubbed ROAMINGMOUSE as part of a cyber espionage campaign directed against government agencies and public institut..."
  },
  {
    "title": "Russian Hackers Using ClickFix Fake CAPTCHA to Deploy New LOSTKEYS Malware",
    "link": "https://thehackernews.com/2025/05/russian-hackers-using-clickfix-fake.html",
    "date": "2025-05-08T06:57:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russia-linked threat actor known as COLDRIVER has been observed distributing a new malware called LOSTKEYS as part of an espionage-focused campaign using ClickFix-like social engineering lures.\n\"L..."
  },
  {
    "title": "'Lemon Sandstorm' Underscores Risks to Middle East Infrastructure",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/lemon-sandstorm-risks-middle-east-infrastructure",
    "date": "2025-05-08T05:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The Iranian state-backed group targeted the operational technology of a critical national infrastructure (CNI) network and persisted in its network for years, but ultimately failed...."
  },
  {
    "title": "Cisco Patches CVE-2025-20188 (10.0 CVSS) in IOS XE That Enables Root Exploits via JWT",
    "link": "https://thehackernews.com/2025/05/cisco-patches-cve-2025-20188-100-cvss.html",
    "date": "2025-05-08T04:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has released software fixes to address a maximum-severity security flaw in its IOS XE Wireless Controller that could enable an unauthenticated, remote attacker to upload arbitrary files to a sus..."
  },
  {
    "title": "LockBit ransomware gang hacked, victim negotiations exposed",
    "link": "https://www.bleepingcomputer.com/news/security/lockbit-ransomware-gang-hacked-victim-negotiations-exposed/",
    "date": "2025-05-08T00:06:32.000Z",
    "source": "Bleeping Computer",
    "summary": "The LockBit ransomware gang has suffered a data breach after its dark web affiliate panels were defaced and replaced with a message linking to a MySQL database dump. [...]..."
  },
  {
    "title": "'CoGUI' Phishing Kit Helps Chinese Hackers Target Japan",
    "link": "https://www.darkreading.com/threat-intelligence/cogui-phishing-kit-chinese-hackers-japan",
    "date": "2025-05-08T00:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Japan is being peppered with an overwhelming volume of spam, thanks to a new platform popular across the East China Sea...."
  },
  {
    "title": "AI Agents Fail in Novel Ways, Put Businesses at Risk",
    "link": "https://www.darkreading.com/vulnerabilities-threats/ai-agents-fail-novel-put-businesses-at-risk",
    "date": "2025-05-07T22:54:19.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft researchers identify 10 new potential pitfalls for companies that are developing or deploying agentic AI systems, with failures potentially leading to the AI becoming a malicious insider...."
  },
  {
    "title": "Pakistani Firm Shipped Fentanyl Analogs, Scams to US",
    "link": "https://krebsonsecurity.com/2025/05/pakistani-firm-shipped-fentanyl-analogs-scams-to-us/",
    "date": "2025-05-07T22:22:48.000Z",
    "source": "Krebs on Security",
    "summary": "A Texas firm recently charged with conspiring to distribute synthetic opioids in the United States is at the center of a vast network of companies in the U.S. and Pakistan whose employees are accused ..."
  },
  {
    "title": "Countries Begin NATO's Locked Shields Cyber-Defense Exercise",
    "link": "https://www.darkreading.com/cybersecurity-operations/countries-nato-locked-shields-cyber-defense-exercise",
    "date": "2025-05-07T21:59:32.000Z",
    "source": "Dark Reading",
    "summary": "The 15th annual event helps countries test and develop defenses against current and emerging cyber threats, including disinformation, quantum computing, and AI...."
  }
]