[
  {
    "title": "Rare Werewolf APT Uses Legitimate Software in Attacks on Hundreds of Russian Enterprises",
    "link": "https://thehackernews.com/2025/06/rare-werewolf-apt-uses-legitimate.html",
    "date": "2025-06-10T07:48:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Rare Werewolf (formerly Rare Wolf) has been linked to a series of cyber attacks targeting Russia and the Commonwealth of Independent States (CIS) countries.\n\"A distinctive fe..."
  },
  {
    "title": "CISA Adds Erlang SSH and Roundcube Flaws to Known Exploited Vulnerabilities Catalog",
    "link": "https://thehackernews.com/2025/06/cisa-adds-erlang-ssh-and-roundcube.html",
    "date": "2025-06-10T05:37:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday added two critical security flaws impacting Erlang/Open Telecom Platform (OTP) SSH and Roundcube to its Known Exploited Vulne..."
  },
  {
    "title": "Stolen Ticketmaster data from Snowflake attacks briefly for sale again",
    "link": "https://www.bleepingcomputer.com/news/security/stolen-ticketmaster-data-from-snowflake-attacks-briefly-for-sale-again/",
    "date": "2025-06-09T22:31:18.000Z",
    "source": "Bleeping Computer",
    "summary": "The Arkana Security extortion gang briefly listed over the weekend what appeared to be newly stolen Ticketmaster data but is instead the data stolen during the 2024 Snowflake data theft attacks. [...]..."
  },
  {
    "title": "New Trump Cybersecurity Order Reverses Biden, Obama Priorities",
    "link": "https://www.darkreading.com/cybersecurity-operations/trump-cybersecurity-order-reverses-biden-obama-priorities",
    "date": "2025-06-09T21:38:17.000Z",
    "source": "Dark Reading",
    "summary": "The White House put limits on cyber sanctions, killed the digital ID program, and refocused the government's cyber activities to enabling AI, rolling out post-quantum cryptography, and promoting secur..."
  },
  {
    "title": "OpenAI Bans ChatGPT Accounts Linked to Nation-State Threat Actors",
    "link": "https://www.darkreading.com/threat-intelligence/openai-bans-chatgpt-accounts-nation-state-threat-actors",
    "date": "2025-06-09T21:28:16.000Z",
    "source": "Dark Reading",
    "summary": "The AI company's investigative team found that many accounts were using the program to engage in malicious activity around the world, such as employment schemes, social engineering, and cyber espionag..."
  },
  {
    "title": "'Librarian Ghouls' Cyberattackers Strike at Night",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/librarian-ghouls-cyberattackers-strike",
    "date": "2025-06-09T21:09:41.000Z",
    "source": "Dark Reading",
    "summary": "Since at least December, the advanced persistent threat (APT) group has been using legit tools to steal data, dodge detection, and drop cryptominers on systems belonging to organizations in Russia...."
  },
  {
    "title": "Gartner: How Security Teams Can Turn Hype Into Opportunity",
    "link": "https://www.darkreading.com/application-security/gartner-security-teams-hype-opportunity",
    "date": "2025-06-09T20:36:33.000Z",
    "source": "Dark Reading",
    "summary": "During the opening keynote at Gartner Security & Risk Management Summit 2025, analysts weighed in on how CISOs and security teams can use security fervor around AI and other tech to the betterment of ..."
  },
  {
    "title": "The best free VPNs of 2025: Secure, safe, and tested solutions",
    "link": "https://www.zdnet.com/article/best-free-vpn/",
    "date": "2025-06-09T20:33:38.000Z",
    "source": "ZDNet Security",
    "summary": "I tested the best free VPNs like Proton VPN, Windscribe, PrivadoVPN, and more that offer solid services without invading your privacy or mining your data...."
  },
  {
    "title": "Over 84,000 Roundcube instances vulnerable to actively exploited flaw",
    "link": "https://www.bleepingcomputer.com/news/security/over-84-000-roundcube-instances-vulnerable-to-actively-exploited-flaw/",
    "date": "2025-06-09T20:14:16.000Z",
    "source": "Bleeping Computer",
    "summary": "Over 84,000 instances of the Roundcube webmail software are vulnerable to CVE-2025-49113, a critical remote code execution (RCE) vulnerability with a publicly available exploit. [...]..."
  },
  {
    "title": "Google patched bug leaking phone numbers tied to accounts",
    "link": "https://www.bleepingcomputer.com/news/security/google-patched-bug-leaking-phone-numbers-tied-to-accounts/",
    "date": "2025-06-09T19:36:39.000Z",
    "source": "Bleeping Computer",
    "summary": "A vulnerability allowed researchers to brute-force any Google account's recovery phone number simply by knowing a their profile name and an easily retrieved partial phone number, creating a massive ri..."
  },
  {
    "title": "SIEMs Missing the Mark on MITRE ATT&amp;CK Techniques",
    "link": "https://www.darkreading.com/cybersecurity-operations/siems-missing-mark-mitre-techniques",
    "date": "2025-06-09T19:17:10.000Z",
    "source": "Dark Reading",
    "summary": "CardinalOps' report shows that organizations are struggling to keep up with the evolution of the latest threats while a significant number of detection rules remain non-functional...."
  },
  {
    "title": "SentinelOne shares new details on China-linked breach attempt",
    "link": "https://www.bleepingcomputer.com/news/security/sentinelone-shares-new-details-on-china-linked-breach-attempt/",
    "date": "2025-06-09T18:26:08.000Z",
    "source": "Bleeping Computer",
    "summary": "SentinelOne has shared more details on an attempted supply chain attack by Chinese hackers through an IT services and logistics firm that manages hardware logistics for the cybersecurity firm. [...]..."
  },
  {
    "title": "Linux Foundation unveils decentralized WordPress plugin manager",
    "link": "https://www.bleepingcomputer.com/news/technology/linux-foundation-unveils-decentralized-wordpress-plugin-manager/",
    "date": "2025-06-09T18:07:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A collective of former WordPress developers and contributors backed by the Linux Foundation has launched the FAIR Package Manager, a new and independent distribution system for trusted WordPress plugi..."
  },
  {
    "title": "Sensata Technologies says personal data stolen by ransomware gang",
    "link": "https://www.bleepingcomputer.com/news/security/sensata-technologies-says-personal-data-stolen-by-ransomware-gang/",
    "date": "2025-06-09T16:09:35.000Z",
    "source": "Bleeping Computer",
    "summary": "Sensata Technologies is warning former and current employees it suffered a data breach after concluding an investigation into an April ransomware attack. [...]..."
  },
  {
    "title": "Over 70 Organizations Across Multiple Sectors Targeted by China-Linked Cyber Espionage Group",
    "link": "https://thehackernews.com/2025/06/over-70-organizations-across-multiple.html",
    "date": "2025-06-09T15:23:00.000Z",
    "source": "The Hacker News",
    "summary": "The reconnaissance activity targeting American cybersecurity company SentinelOne was part of a broader set of partially-related intrusions into several targets between July 2024 and March 2025.\n\"The v..."
  },
  {
    "title": "Two Distinct Botnets Exploit Wazuh Server Vulnerability to Launch Mirai-Based Attacks",
    "link": "https://thehackernews.com/2025/06/botnet-wazuh-server-vulnerability.html",
    "date": "2025-06-09T14:46:00.000Z",
    "source": "The Hacker News",
    "summary": "A now-patched critical security flaw in the Wazur Server is being exploited by threat actors to drop two different Mirai botnet variants and use them to conduct distributed denial-of-service (DDoS) at..."
  },
  {
    "title": "Designing Blue Team playbooks with Wazuh for proactive incident response",
    "link": "https://www.bleepingcomputer.com/news/security/designing-blue-team-playbooks-with-wazuh-for-proactive-incident-response/",
    "date": "2025-06-09T14:27:02.000Z",
    "source": "Bleeping Computer",
    "summary": "Blue Team playbooks are essential—but tools like Wazuh take them to the next level. From credential dumping to web shells and brute-force attacks, see how Wazuh strengthens real-time detection and aut..."
  },
  {
    "title": "Next-Gen Developers Are a Cybersecurity Powder Keg",
    "link": "https://www.darkreading.com/application-security/next-gen-developers-cybersecurity-powder-keg",
    "date": "2025-06-09T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "AI coding tools promise productivity but deliver security problems, too. As developers embrace \"vibe coding,\" enterprises face mounting risks from insecure code generation that security teams can't ke..."
  },
  {
    "title": "Grocery wholesale giant United Natural Foods hit by cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/grocery-wholesale-giant-united-natural-foods-hit-by-cyberattack/",
    "date": "2025-06-09T13:31:40.000Z",
    "source": "Bleeping Computer",
    "summary": "United Natural Foods (UNFI), North America's largest publicly traded wholesale distributor, was forced to shut down some systems following a recent cyberattack. [...]..."
  },
  {
    "title": "Apple, Google, and Microsoft offer free password managers - but should you use them?",
    "link": "https://www.zdnet.com/article/apple-google-and-microsoft-offer-free-password-managers-but-should-you-use-them/",
    "date": "2025-06-09T12:25:18.000Z",
    "source": "ZDNet Security",
    "summary": "The three dominant computing platforms have each tried to build features that help you manage passwords without paying for third-party software. Are any of them worth your time and effort?..."
  },
  {
    "title": "China-Backed Hackers Target SentinelOne in 'PurpleHaze' Attack Spree",
    "link": "https://www.darkreading.com/remote-workforce/china-hackers-target-sentinelone-purplehaze-attack",
    "date": "2025-06-09T11:46:59.000Z",
    "source": "Dark Reading",
    "summary": "Known threat groups APT15 and UNC5174 unleashed attacks against SentinelOne and more than 70 other high-value targets, as part of ongoing cyber-espionage and other malicious activity involving ShadowP..."
  },
  {
    "title": "⚡ Weekly Recap: Chrome 0-Day, Data Wipers, Misused Tools and Zero-Click iPhone Attacks",
    "link": "https://thehackernews.com/2025/06/weekly-recap-chrome-0-day-data-wipers.html",
    "date": "2025-06-09T11:20:00.000Z",
    "source": "The Hacker News",
    "summary": "Behind every security alert is a bigger story. Sometimes it’s a system being tested. Sometimes it’s trust being lost in quiet ways—through delays, odd behavior, or subtle gaps in control.\nThis week, w..."
  },
  {
    "title": "Think Your IdP or CASB Covers Shadow IT? These 5 Risks Prove Otherwise",
    "link": "https://thehackernews.com/2025/06/think-your-idp-or-casb-covers-shadow-it.html",
    "date": "2025-06-09T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "You don’t need a rogue employee to suffer a breach.\nAll it takes is a free trial that someone forgot to cancel. An AI-powered note-taker quietly syncing with your Google Drive. A personal Gmail accoun..."
  },
  {
    "title": "OpenAI Bans ChatGPT Accounts Used by Russian, Iranian, and Chinese Hacker Groups",
    "link": "https://thehackernews.com/2025/06/openai-bans-chatgpt-accounts-used-by.html",
    "date": "2025-06-09T06:45:00.000Z",
    "source": "The Hacker News",
    "summary": "OpenAI has revealed that it banned a set of ChatGPT accounts that were likely operated by Russian-speaking threat actors and two Chinese nation-state hacking groups to assist with malware development,..."
  },
  {
    "title": "New Mirai botnet infect TBK DVR devices via command injection flaw",
    "link": "https://www.bleepingcomputer.com/news/security/new-mirai-botnet-infect-tbk-dvr-devices-via-command-injection-flaw/",
    "date": "2025-06-08T14:17:27.000Z",
    "source": "Bleeping Computer",
    "summary": "A new variant of the Mirai malware botnet is exploiting a command injection vulnerability in TBK DVR-4104 and DVR-4216 digital video recording devices to hijack them. [...]..."
  },
  {
    "title": "New Supply Chain Malware Operation Hits npm and PyPI Ecosystems, Targeting Millions Globally",
    "link": "https://thehackernews.com/2025/06/new-supply-chain-malware-operation-hits.html",
    "date": "2025-06-08T13:47:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have flagged a supply chain attack targeting over a dozen packages associated with GlueStack to deliver malware.\nThe malware, introduced via a change to \"lib/commonjs/index.j..."
  },
  {
    "title": "Malicious Browser Extensions Infect Over 700 Users Across Latin America Since Early 2025",
    "link": "https://thehackernews.com/2025/06/malicious-browser-extensions-infect-722.html",
    "date": "2025-06-08T08:01:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have shed light on a new campaign targeting Brazilian users since the start of 2025 to infect users with a malicious extension for Chromium-based web browsers and siphon user..."
  },
  {
    "title": "Malware found in NPM packages with 1 million weekly downloads",
    "link": "https://www.bleepingcomputer.com/news/security/supply-chain-attack-hits-gluestack-npm-packages-with-960k-weekly-downloads/",
    "date": "2025-06-07T19:31:21.000Z",
    "source": "Bleeping Computer",
    "summary": "A significant supply chain attack hit NPM after 15 popular Gluestack packages with over 950,000 weekly downloads were compromised to include malicious code that acts as a remote access trojan (RAT). [..."
  },
  {
    "title": "Malicious npm packages posing as utilities delete project directories",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-npm-packages-posing-as-utilities-delete-project-directories/",
    "date": "2025-06-07T14:11:21.000Z",
    "source": "Bleeping Computer",
    "summary": "Two malicious packages have been discovered in the npm JavaScript package index, which masquerades as useful utilities but, in reality, are destructive data wipers that delete entire application direc..."
  },
  {
    "title": "Cutting-Edge ClickFix Tactics Snowball, Pushing Phishing Forward",
    "link": "https://www.darkreading.com/remote-workforce/cutting-edge-clickfix-snowball-phishing",
    "date": "2025-06-06T20:07:51.000Z",
    "source": "Dark Reading",
    "summary": "Several widespread ClickFix campaigns are underway, bent on delivering malware to business targets, and they represent a new level of phishing sophistication that defenders need to be prepared for, re..."
  }
]