[
  {
    "title": "Hackers abuse Microsoft ClickOnce and AWS services for stealthy attacks",
    "link": "https://www.bleepingcomputer.com/news/security/oneclik-attacks-use-microsoft-clickonce-and-aws-to-target-energy-sector/",
    "date": "2025-06-25T20:34:38.000Z",
    "source": "Bleeping Computer",
    "summary": "A sophisticated malicious campaign that researchers call OneClik has been leveraging Microsoft's ClickOnce software deployment tool and custom Golang backdoors to compromise organizations within the e..."
  },
  {
    "title": "New wave of ‘fake interviews’ use 35 npm packages to spread malware",
    "link": "https://www.bleepingcomputer.com/news/security/new-wave-of-fake-interviews-use-35-npm-packages-to-spread-malware/",
    "date": "2025-06-25T19:24:12.000Z",
    "source": "Bleeping Computer",
    "summary": "A new wave of North Korea's 'Contagious Interview' campaign is targeting job seekers with malicious npm packages that infect dev's devices with infostealers and backdoors. [...]..."
  },
  {
    "title": "Millions of Brother Printers Hit by Critical, Unpatchable Bug",
    "link": "https://www.darkreading.com/endpoint-security/millions-brother-printers-critical-unpatchable-bug",
    "date": "2025-06-25T18:57:19.000Z",
    "source": "Dark Reading",
    "summary": "A slew of vulnerabilities, including a critical CVSS 9.8 that enables an attacker to generate the default admin password, affect hundreds of printer, scanner, and label-maker models made by manufactur..."
  },
  {
    "title": "How Avast's free AI-powered Scam Guardian protects you from online con artists",
    "link": "https://www.zdnet.com/article/how-avasts-free-ai-powered-scam-guardian-protects-you-from-online-con-artists/",
    "date": "2025-06-25T18:54:38.000Z",
    "source": "ZDNet Security",
    "summary": "Now built into Avast Free Antivirus and Avast Premium Security, the AI-driven scam protection warns you about suspicious websites, messages, emails, and more...."
  },
  {
    "title": "CISA Is Shrinking: What Does It Mean for Cyber?",
    "link": "https://www.darkreading.com/cybersecurity-operations/cisa-is-shrinking-what-does-it-mean-for-cyber-",
    "date": "2025-06-25T18:18:35.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading Confidential Episode 7: Cyber experts Tom Parker and Jake Williams offer their views on the practical impact of cuts to the US Cybersecurity and Infrastructure Security Agency...."
  },
  {
    "title": "Google releases Gemini CLI with free Gemini 2.5 Pro ",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-releases-gemini-cli-with-free-gemini-25-pro/",
    "date": "2025-06-25T17:53:28.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has released Gemini 2.5 Pro-powered Gemini CLI, which allows you to use Gemini inside your terminal, including Windows Terminal. [...]..."
  },
  {
    "title": "Citrix warns of NetScaler vulnerability exploited in DoS attacks",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-warns-of-netscaler-vulnerability-exploited-in-dos-attacks/",
    "date": "2025-06-25T17:35:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Citrix is warning that a vulnerability in NetScaler appliances tracked as CVE-2025-6543 is being actively exploited in the wild, causing devices to enter a denial of service condition. [...]..."
  },
  {
    "title": "nOAuth Vulnerability Still Affects 9% of Microsoft Entra SaaS Apps Two Years After Discovery",
    "link": "https://thehackernews.com/2025/06/noauth-vulnerability-still-affects-9-of.html",
    "date": "2025-06-25T16:56:00.000Z",
    "source": "The Hacker News",
    "summary": "New research has uncovered continued risk from a known security weakness in Microsoft's Entra ID, potentially enabling malicious actors to achieve account takeovers in susceptible software-as-a-servic..."
  },
  {
    "title": "WinRAR patches bug letting malware launch from extracted archives",
    "link": "https://www.bleepingcomputer.com/news/security/winrar-patches-bug-letting-malware-launch-from-extracted-archives/",
    "date": "2025-06-25T16:55:14.000Z",
    "source": "Bleeping Computer",
    "summary": "WinRAR has addressed a directory traversal vulnerability tracked as CVE-2025-6218 that, under certain circumstances, allows malware to be executed after extracting a malicious archive. [...]..."
  },
  {
    "title": "Dire Wolf Ransomware Comes Out Snarling, Bites Technology, Manufacturing",
    "link": "https://www.darkreading.com/threat-intelligence/dire-wolf-ransomware-manufacturing-technology",
    "date": "2025-06-25T16:27:19.000Z",
    "source": "Dark Reading",
    "summary": "The emerging group has already gotten its teeth into 16 victims since May with its double extortion tactics, claiming victims in 11 countries, including the US, Thailand, and Taiwan...."
  },
  {
    "title": "New 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions",
    "link": "https://www.bleepingcomputer.com/news/security/new-citrixbleed-2-netscaler-flaw-let-hackers-hijack-sessions/",
    "date": "2025-06-25T16:10:37.000Z",
    "source": "Bleeping Computer",
    "summary": "A recent vulnerability in Citrix NetScaler ADC and Gateway is dubbed \"CitrixBleed 2,\" after its similarity to an older exploited flaw that allowed unauthenticated attackers to hijack authentication se..."
  },
  {
    "title": "Hundreds of MCP Servers Expose AI Models to Abuse, RCE",
    "link": "https://www.darkreading.com/cloud-security/hundreds-mcp-servers-ai-models-abuse-rce",
    "date": "2025-06-25T15:23:04.000Z",
    "source": "Dark Reading",
    "summary": "The servers that connect AI with real-world data are occasionally wide-open channels for cyberattacks...."
  },
  {
    "title": "Citrix Releases Emergency Patches for Actively Exploited CVE-2025-6543 in NetScaler ADC",
    "link": "https://thehackernews.com/2025/06/citrix-releases-emergency-patches-for.html",
    "date": "2025-06-25T14:51:00.000Z",
    "source": "The Hacker News",
    "summary": "Citrix has released security updates to address a critical flaw affecting NetScaler ADC that it said has been exploited in the wild.\nThe vulnerability, tracked as CVE-2025-6543, carries a CVSS score o..."
  },
  {
    "title": "BreachForums hacking forum operators reportedly arrested in France",
    "link": "https://www.bleepingcomputer.com/news/security/breachforums-hacking-forum-operators-reportedly-arrested-in-france/",
    "date": "2025-06-25T14:25:46.000Z",
    "source": "Bleeping Computer",
    "summary": "The French police have reportedly arrested five operators of the BreachForum cybercrime forum, a website used by cybercriminals to leak and sell stolen data that exposed the sensitive information of m..."
  },
  {
    "title": "Generative AI Exacerbates Software Supply Chain Risks",
    "link": "https://www.darkreading.com/vulnerabilities-threats/generative-ai-exacerbates-software-supply-chain-risks",
    "date": "2025-06-25T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Malicious actors are exploiting AI-fabricated software components — presenting a major challenge for securing software supply chains...."
  },
  {
    "title": "Citrix Bleed 2 Flaw Enables Token Theft; SAP GUI Flaws Risk Sensitive Data Exposure",
    "link": "https://thehackernews.com/2025/06/citrix-bleed-2-flaw-enables-token-theft.html",
    "date": "2025-06-25T13:37:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have detailed two now-patched security flaws in SAP Graphical User Interface (GUI) for Windows and Java that, if successfully exploited, could have enabled attackers to acces..."
  },
  {
    "title": "Ring's new generative AI feature is here to answer your 'who's there?' or 'what was that?' questions",
    "link": "https://www.zdnet.com/article/rings-new-generative-ai-feature-is-here-to-answer-your-whos-there-or-what-was-that-questions/",
    "date": "2025-06-25T13:00:14.000Z",
    "source": "ZDNet Security",
    "summary": "Called Video Descriptions, the AI feature generates detailed descriptions of what your Ring camera sees and delivers it in your notifications...."
  },
  {
    "title": "XOR Marks the Flaw in SAP GUI",
    "link": "https://www.darkreading.com/cloud-security/xor-flaw-sap-gui",
    "date": "2025-06-25T13:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The company has patched two vulnerabilities in its Graphical User Interface that would have allowed attackers to grab data from a user's input history feature...."
  },
  {
    "title": "Does your generative AI protect your privacy? New study ranks them best to worst",
    "link": "https://www.zdnet.com/article/does-your-generative-ai-protect-your-privacy-new-study-ranks-them-best-to-worst/",
    "date": "2025-06-25T12:44:00.000Z",
    "source": "ZDNet Security",
    "summary": "Le Chat and Grok are the most respectful of your privacy. So which ones are the worst offenders?..."
  },
  {
    "title": "Pro-Iranian Hacktivist Group Leaks Personal Records from the 2024 Saudi Games",
    "link": "https://thehackernews.com/2025/06/pro-iranian-hacktivist-group-leaks.html",
    "date": "2025-06-25T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Thousands of personal records allegedly linked to athletes and visitors of the Saudi Games have been published online by a pro-Iranian hacktivist group called Cyber Fattah.\nCybersecurity company Resec..."
  },
  {
    "title": "Incogni vs. DeleteMe: Which service removes your personal data best?",
    "link": "https://www.zdnet.com/article/incogni-vs-deleteme/",
    "date": "2025-06-25T10:30:15.000Z",
    "source": "ZDNet Security",
    "summary": "Incogni and DeleteMe are data removal services that can help you lock down your data, but they specialize in different areas. Read on to discover which service will suit you best...."
  },
  {
    "title": "Beware the Hidden Risk in Your Entra Environment",
    "link": "https://thehackernews.com/2025/06/beware-hidden-risk-in-your-entra.html",
    "date": "2025-06-25T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "If you invite guest users into your Entra ID tenant, you may be opening yourself up to a surprising risk. \nA gap in access control in Microsoft Entra’s subscription handling is allowing guest users to..."
  },
  {
    "title": "SonicWall NetExtender Trojan and ConnectWise Exploits Used in Remote Access Attacks",
    "link": "https://thehackernews.com/2025/06/sonicwall-netextender-trojan-and.html",
    "date": "2025-06-25T08:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Unknown threat actors have been distributing a trojanized version of SonicWall's SSL VPN NetExtender application to steal credentials from unsuspecting users who may have installed it.\n\"NetExtender en..."
  },
  {
    "title": "North Korea-linked Supply Chain Attack Targets Developers with 35 Malicious npm Packages",
    "link": "https://thehackernews.com/2025/06/north-korea-linked-supply-chain-attack.html",
    "date": "2025-06-25T08:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have uncovered a fresh batch of malicious npm packages linked to the ongoing Contagious Interview operation originating from North Korea.\nAccording to Socket, the ongoing sup..."
  },
  {
    "title": "Updating to Android 16 gives you 2 useful security features - but you need to enable them",
    "link": "https://www.zdnet.com/article/updating-to-android-16-gives-you-2-useful-security-features-but-you-need-to-enable-them/",
    "date": "2025-06-25T07:20:16.000Z",
    "source": "ZDNet Security",
    "summary": "Once you turn on these new Android 16 security features, your information and phone will be better protected against harm...."
  },
  {
    "title": "These battery-powered 4K security cameras give Ring and Blink a run for their money",
    "link": "https://www.zdnet.com/article/these-battery-powered-4k-security-cameras-give-ring-and-blink-a-run-for-their-money/",
    "date": "2025-06-25T06:45:15.000Z",
    "source": "ZDNet Security",
    "summary": "TP-Link's new cameras feature 4K capabilities with 24/7 recording, thanks to the HomeBase H500. They're also cheaper than their closest competitors...."
  },
  {
    "title": "You may qualify for AT&T's $177 million data breach settlement - how to file a claim today",
    "link": "https://www.zdnet.com/article/you-may-qualify-for-at-ts-177-million-data-breach-settlement-how-to-file-a-claim-today/",
    "date": "2025-06-25T06:30:18.000Z",
    "source": "ZDNet Security",
    "summary": "Millions of customers had their data stolen. Now AT&T is offering compensation...."
  },
  {
    "title": "Africa Sees Surge in Cybercrime as Law Enforcement Struggles",
    "link": "https://www.darkreading.com/cyber-risk/africa-surge-cybercrime-law-enforcement-struggles",
    "date": "2025-06-25T06:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Cybercrime accounts for more than 30% of all reported crime in East Africa and West Africa, with online scams, ransomware, business email compromise, and digital sextortion taking off...."
  },
  {
    "title": "Microsoft Extends Windows 10 Security Updates for One Year with New Enrollment Options",
    "link": "https://thehackernews.com/2025/06/microsoft-extends-windows-10-security.html",
    "date": "2025-06-25T05:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Tuesday announced that it's extending Windows 10 Extended Security Updates (ESU) for an extra year by letting users either pay a small fee of $30 or by sync their PC settings to the cloud..."
  },
  {
    "title": "Google rolls out text-to-image model Imagen 4 for free",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-rolls-out-text-to-image-model-imagen-4-for-free/",
    "date": "2025-06-24T22:36:21.000Z",
    "source": "Bleeping Computer",
    "summary": "Google confirmed that Imagen 4, which is the company's state-of-the-art text-to-image, is rolling out for free, but only on AI Studio. [...]..."
  }
]