[
  {
    "title": "Let's Get Physical: A New Convergence for Electrical Grid Security",
    "link": "https://www.darkreading.com/cybersecurity-operations/physical-convergence-electrical-grid-cybersecurity",
    "date": "2025-11-03T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The power grid is being attacked online and IRL. Increasingly, regulators and industry experts agree: Security teams need to focus on both cyber and physical threats, together...."
  },
  {
    "title": "Cybercriminals Exploit Remote Monitoring Tools to Infiltrate Logistics and Freight Networks",
    "link": "https://thehackernews.com/2025/11/cybercriminals-exploit-remote.html",
    "date": "2025-11-03T13:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Bad actors are increasingly training their sights on trucking and logistics companies with an aim to infect them with remote monitoring and management (RMM) software for financial gain and ultimately ..."
  },
  {
    "title": "⚡ Weekly Recap: Lazarus Hits Web3, Intel/AMD TEEs Cracked, Dark Web Leak Tool & More",
    "link": "https://thehackernews.com/2025/11/weekly-recap-lazarus-hits-web3-intelamd.html",
    "date": "2025-11-03T12:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyberattacks are getting smarter and harder to stop. This week, hackers used sneaky tools, tricked trusted systems, and quickly took advantage of new security problems—some just hours after being foun..."
  },
  {
    "title": "AI Developed Code: 5 Critical Security Checkpoints for Human Oversight",
    "link": "https://www.darkreading.com/application-security/ai-code-security-checkpoints",
    "date": "2025-11-03T12:00:00.000Z",
    "source": "Dark Reading",
    "summary": "To write secure code with LLMs developers must have the skills to use AI as a collaborative assistant rather than an autonomous tool, Madou argues...."
  },
  {
    "title": "The Evolution of SOC Operations: How Continuous Exposure Management Transforms Security Operations",
    "link": "https://thehackernews.com/2025/11/the-evolution-of-soc-operations-how.html",
    "date": "2025-11-03T11:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Security Operations Centers (SOC) today are overwhelmed. Analysts handle thousands of alerts every day, spending much time chasing false positives and adjusting detection rules reactively. SOCs often ..."
  },
  {
    "title": "Researchers Uncover BankBot-YNRK and DeliveryRAT Android Trojans Stealing Financial Data",
    "link": "https://thehackernews.com/2025/11/researchers-uncover-bankbot-ynrk-and.html",
    "date": "2025-11-03T11:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have shed light on two different Android trojans called BankBot-YNRK and DeliveryRAT that are capable of harvesting sensitive data from compromised devices.\nAccording to CYFI..."
  },
  {
    "title": "‘TruffleNet’ Attack Wields Stolen Credentials Against AWS",
    "link": "https://www.darkreading.com/vulnerabilities-threats/trufflenet-attack-stolen-credentials-aws",
    "date": "2025-11-03T10:59:03.000Z",
    "source": "Dark Reading",
    "summary": "Reconnaissance and BEC are among the malicious activities attackers commit after compromising cloud accounts, using a framework based on the TruffleHog tool...."
  },
  {
    "title": "New HttpTroy Backdoor Poses as VPN Invoice in Targeted Cyberattack on South Korea",
    "link": "https://thehackernews.com/2025/11/new-httptroy-backdoor-poses-as-vpn.html",
    "date": "2025-11-03T10:42:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korea-linked threat actor known as Kimsuky has distributed a previously undocumented backdoor codenamed HttpTroy as part of a likely spear-phishing attack targeting a single victim in South ..."
  },
  {
    "title": "Microsoft: Windows Task Manager won’t quit after KB5067036 update",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-task-manager-wont-quit-after-kb5067036-update/",
    "date": "2025-11-03T10:12:47.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed a known issue that is preventing users from quitting the Windows 11 Task Manager after installing the October 2025 optional update. [...]..."
  },
  {
    "title": "Penn hacker claims to have stolen 1.2 million donor records in data breach",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-hacker-claims-1.2-million-donor-data-breach/",
    "date": "2025-11-02T22:07:14.000Z",
    "source": "Bleeping Computer",
    "summary": "A hacker has taken responsibility for last week's University of Pennsylvania \"We got hacked\" email incident, saying it was a far more extensive breach that exposed data on 1.2 million donors and inter..."
  },
  {
    "title": "Alleged Jabber Zeus Coder ‘MrICQ’ in U.S. Custody",
    "link": "https://krebsonsecurity.com/2025/11/alleged-jabber-zeus-coder-mricq-in-u-s-custody/",
    "date": "2025-11-02T20:37:24.000Z",
    "source": "Krebs on Security",
    "summary": "A Ukrainian man indicted in 2012 for conspiring with a prolific hacking group to steal tens of millions of dollars from U.S. businesses was arrested in Italy and is now in custody in the United States..."
  },
  {
    "title": "Open VSX rotates access tokens used in supply-chain malware attack",
    "link": "https://www.bleepingcomputer.com/news/security/open-vsx-rotates-tokens-used-in-supply-chain-malware-attack/",
    "date": "2025-11-02T15:09:19.000Z",
    "source": "Bleeping Computer",
    "summary": "The Open VSX registry rotated access tokens after they were accidentally leaked by developers in public repositories and allowed threat actors to publish malicious extensions in an attempted supply-ch..."
  },
  {
    "title": "OpenAI is going Meta route, as it considers memory-based ads on ChatGPT",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-going-meta-route-as-it-considers-memory-based-ads-on-chatgpt/",
    "date": "2025-11-01T20:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is planning to introduce ads on ChatGPT, as it continues to struggle with revenue from paid users. [...]..."
  },
  {
    "title": "Google confirms AI search will have ads, but they may look different",
    "link": "https://www.bleepingcomputer.com/news/google/google-confirms-ai-search-will-have-ads-but-they-may-look-different/",
    "date": "2025-11-01T16:56:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google Ads are not going anywhere. Eventually, AI Search results on Google and likely other properties will have ads. [...]..."
  },
  {
    "title": "Windows 11 Build 26220.7051 released with “Ask Copilot” feature",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-build-262207051-released-with-ask-copilot-feature/",
    "date": "2025-11-01T16:17:22.000Z",
    "source": "Bleeping Computer",
    "summary": "Windows 11 Build 26220.7051 is now rolling out to testers in the Windows Insider Program, and there are at least three new features, including Ask Copilot in the taskbar. [...]..."
  },
  {
    "title": "China-linked hackers exploited Lanscope flaw as a zero-day in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/china-linked-hackers-exploited-lanscope-flaw-as-a-zero-day-in-attacks/",
    "date": "2025-11-01T14:16:26.000Z",
    "source": "Bleeping Computer",
    "summary": "China-linked cyber-espionage actors tracked as 'Bronze Butler' (Tick) exploited a Motex Lanscope Endpoint Manager vulnerability as a zero-day to deploy an updated version of their Gokcpdoor malware. [..."
  },
  {
    "title": "ASD Warns of Ongoing BADCANDY Attacks Exploiting Cisco IOS XE Vulnerability",
    "link": "https://thehackernews.com/2025/11/asd-warns-of-ongoing-badcandy-attacks.html",
    "date": "2025-11-01T13:43:00.000Z",
    "source": "The Hacker News",
    "summary": "The Australian Signals Directorate (ASD) has issued a bulletin about ongoing cyber attacks targeting unpatched Cisco IOS XE devices in the country with a previously undocumented implant known as BADCA..."
  },
  {
    "title": "Windows 11 tests shared Bluetooth audio support, but only for AI PCs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-tests-shared-bluetooth-audio-support-but-only-for-ai-pcs/",
    "date": "2025-10-31T20:59:02.000Z",
    "source": "Bleeping Computer",
    "summary": "If you have two headphones, speakers, earbuds, or any other Bluetooth hardware, you can now use both simultaneously on a Copilot+ PC. [...]..."
  },
  {
    "title": "UNC6384 Targets European Diplomatic Entities With Windows Exploit",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/unc6384-european-diplomat-windows",
    "date": "2025-10-31T20:07:58.000Z",
    "source": "Dark Reading",
    "summary": "The spear-phishing campaign uses fake European Commission and NATO-themed lures to trick diplomatic personnel into clicking malicious links...."
  },
  {
    "title": "Ribbon Communications Breach Marks Latest Telecom Attack",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/ribbon-communications-breach-latest-telecom-attack",
    "date": "2025-10-31T19:47:26.000Z",
    "source": "Dark Reading",
    "summary": "The US telecom company disclosed that suspected nation-state actors first gained access to its network in December of last year, though it's unclear if attackers obtained sensitive data...."
  },
  {
    "title": "‘We got hacked’ emails threaten to leak University of Pennsylvania data",
    "link": "https://www.bleepingcomputer.com/news/security/offensive-we-got-hacked-emails-sent-in-penn-security-incident/",
    "date": "2025-10-31T18:32:39.000Z",
    "source": "Bleeping Computer",
    "summary": "The University of Pennsylvania suffered a cybersecurity incident on Friday, where students and alumni received a series of offensive emails from various University email addresses, claiming that data ..."
  },
  {
    "title": "OpenAI Unveils Aardvark: GPT-5 Agent That Finds and Fixes Code Flaws Automatically",
    "link": "https://thehackernews.com/2025/10/openai-unveils-aardvark-gpt-5-agent.html",
    "date": "2025-10-31T17:19:00.000Z",
    "source": "The Hacker News",
    "summary": "OpenAI has announced the launch of an \"agentic security researcher\" that's powered by its GPT-5 large language model (LLM) and is programmed to emulate a human expert capable of scanning, understandin..."
  },
  {
    "title": "Microsoft Edge gets scareware sensor for faster scam detection",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-edge-gets-scareware-sensor-for-faster-scam-detection/",
    "date": "2025-10-31T17:15:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is introducing a new scareware sensor for the Microsoft Edge web browser, which helps detect scam pages more quickly and ensures that Defender SmartScreen blocks them faster. [...]..."
  },
  {
    "title": "Nation-State Hackers Deploy New Airstalk Malware in Suspected Supply Chain Attack",
    "link": "https://thehackernews.com/2025/10/nation-state-hackers-deploy-new.html",
    "date": "2025-10-31T16:08:00.000Z",
    "source": "The Hacker News",
    "summary": "A suspected nation-state threat actor has been linked to the distribution of a new malware called Airstalk as part of a likely supply chain attack.\nPalo Alto Networks Unit 42 said it's tracking the cl..."
  },
  {
    "title": "Australia warns of BadCandy infections on unpatched Cisco devices",
    "link": "https://www.bleepingcomputer.com/news/security/australia-warns-of-badcandy-infections-on-unpatched-cisco-devices/",
    "date": "2025-10-31T15:38:55.000Z",
    "source": "Bleeping Computer",
    "summary": "The Australian government is warning about ongoing cyberattacks against unpatched Cisco IOS XE devices in the country to infect routers with the BadCandy webshell. [...]..."
  },
  {
    "title": "Why password controls still matter in cybersecurity",
    "link": "https://www.bleepingcomputer.com/news/security/why-password-controls-still-matter-in-cybersecurity/",
    "date": "2025-10-31T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Passwords still matter — and weak policies leave the door wide open. Specops Software explains how longer passphrases, smarter banned-password lists, and adaptive rotation strategies can strengthen se..."
  },
  {
    "title": "China-Linked Hackers Exploit Windows Shortcut Flaw to Target European Diplomats",
    "link": "https://thehackernews.com/2025/10/china-linked-hackers-exploit-windows.html",
    "date": "2025-10-31T13:57:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-affiliated threat actor known as UNC6384 has been linked to a fresh set of attacks exploiting an unpatched Windows shortcut vulnerability to target European diplomatic and government entities ..."
  },
  {
    "title": "China-Linked Tick Group Exploits Lanscope Zero-Day to Hijack Corporate Systems",
    "link": "https://thehackernews.com/2025/10/china-linked-tick-group-exploits.html",
    "date": "2025-10-31T13:26:00.000Z",
    "source": "The Hacker News",
    "summary": "The exploitation of a recently disclosed critical security flaw in Motex Lanscope Endpoint Manager has been attributed to a cyber espionage group known as Tick.\nThe vulnerability, tracked as CVE-2025-..."
  },
  {
    "title": "The MSP Cybersecurity Readiness Guide: Turning Security into Growth",
    "link": "https://thehackernews.com/2025/10/the-msp-cybersecurity-readiness-guide.html",
    "date": "2025-10-31T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "MSPs are facing rising client expectations for strong cybersecurity and compliance outcomes, while threats grow more complex and regulatory demands evolve. Meanwhile, clients are increasingly seeking ..."
  },
  {
    "title": "Dark Reading Confidential: Cyber's Role in the Rapid Rise of Digital Authoritarianism",
    "link": "https://www.darkreading.com/cyber-risk/cybers-role-rapid-rise-digital-authoritarianism",
    "date": "2025-10-31T09:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading Confidential Episode 11: Enterprise cyber teams are in prime position to push back against our current \"Golden Age of Surveillance,\" according to our guests Ronald Deibert from Citizen La..."
  }
]