[
  {
    "title": "Explore Online Events",
    "link": "https://www.darkreading.com/events/dark-reading-online-events",
    "date": "2025-11-11T18:09:47.867Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "“Bitcoin Queen” gets 11 years in prison for $7.3 billion Bitcoin scam",
    "link": "https://www.bleepingcomputer.com/news/security/bitcoin-queen-gets-11-years-in-prison-for-73-billion-bitcoin-scam/",
    "date": "2025-11-11T17:07:44.000Z",
    "source": "Bleeping Computer",
    "summary": "A Chinese woman known as the \"Bitcoin Queen\" was sentenced in London to 11 years and eight months in jail for laundering Bitcoin from a £5.5 billion ($7.3 billion) cryptocurrency investment scheme. [...."
  },
  {
    "title": "GootLoader Is Back, Using a New Font Trick to Hide Malware on WordPress Sites",
    "link": "https://thehackernews.com/2025/11/gootloader-is-back-using-new-font-trick.html",
    "date": "2025-11-11T15:44:00.000Z",
    "source": "The Hacker News",
    "summary": "The malware known as GootLoader has resurfaced yet again after a brief spike in activity earlier this March, according to new findings from Huntress.\nThe cybersecurity company said it observed three G..."
  },
  {
    "title": "SAP fixes hardcoded credentials flaw in SQL Anywhere Monitor",
    "link": "https://www.bleepingcomputer.com/news/security/sap-fixes-hardcoded-credentials-flaw-in-sql-anywhere-monitor/",
    "date": "2025-11-11T15:38:55.000Z",
    "source": "Bleeping Computer",
    "summary": "SAP has released its November security updates that address multiple security vulnerabilities, including a maximum severity flaw in the non-GUI variant of the SQL Anywhere Monitor and a critical code ..."
  },
  {
    "title": "Grandparents to C-Suite: Elder Fraud Reveals Gaps in Human-Centered Cybersecurity",
    "link": "https://www.darkreading.com/cyber-risk/grandparents-to-c-suite-elder-fraud-reveals-gaps-in-human-centered-cybersecurity",
    "date": "2025-11-11T15:30:26.000Z",
    "source": "Dark Reading",
    "summary": "Cybercriminals are weaponizing AI voice cloning and publicly available data to craft social engineering scams that emotionally manipulate senior citizens—and drain billions from their savings...."
  },
  {
    "title": "GlobalLogic warns 10,000 employees of data theft after Oracle breach",
    "link": "https://www.bleepingcomputer.com/news/security/globallogic-warns-10-000-employees-of-data-theft-after-oracle-breach/",
    "date": "2025-11-11T15:24:23.000Z",
    "source": "Bleeping Computer",
    "summary": "GlobalLogic, a provider of digital engineering services part of the Hitachi group, is notifying over 10,000 current and former employees that their data was stolen in an Oracle E-Business Suite (EBS) ..."
  },
  {
    "title": "How a CPU spike led to uncovering a RansomHub ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/how-a-cpu-spike-led-to-uncovering-a-ransomhub-ransomware-attack/",
    "date": "2025-11-11T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "A sudden CPU spike turned out to be the first clue of an in-progress RansomHub ransomware attack. Varonis breaks down how their team traced the attack from fake browser updates to domain-admin takeove..."
  },
  {
    "title": "Bridging the Skills Gap: How Military Veterans Are Strengthening Cybersecurity",
    "link": "https://www.darkreading.com/cybersecurity-operations/military-veterans-strengthening-cybersecurity",
    "date": "2025-11-11T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "From intelligence analysts to surface warfare officers, military veterans of all backgrounds are successfully pivoting to cybersecurity careers and strengthening the industry's defense capabilities...."
  },
  {
    "title": "Webinar: Modern Patch Management – Strategies to patch faster with less risk",
    "link": "https://www.bleepingcomputer.com/news/security/webinar-modern-patch-management-strategies-to-patch-faster-with-less-risk/",
    "date": "2025-11-11T13:10:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Many organizations still struggle to patch fast enough to prevent breaches. Join us December 2 at 2PM ET to learn how modern patch management strategies can reduce risk and close the remediation gap. ..."
  },
  {
    "title": "CISO's Expert Guide To AI Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/11/cisos-expert-guide-to-ai-supply-chain.html",
    "date": "2025-11-11T11:58:00.000Z",
    "source": "The Hacker News",
    "summary": "AI-enabled supply chain attacks jumped 156% last year. Discover why traditional defenses are failing and what CISOs must do now to protect their organizations.\nDownload the full CISO’s expert guide to..."
  },
  {
    "title": "Researchers Detect Malicious npm Package Targeting GitHub-Owned Repositories",
    "link": "https://thehackernews.com/2025/11/researchers-detect-malicious-npm.html",
    "date": "2025-11-11T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a malicious npm package named \"@acitons/artifact\" that typosquats the legitimate \"@actions/artifact\" package with the intent to target GitHub-owned repositori..."
  },
  {
    "title": "Android Trojan 'Fantasy Hub' Malware Service Turns Telegram Into a Hub for Hackers",
    "link": "https://thehackernews.com/2025/11/android-trojan-fantasy-hub-malware.html",
    "date": "2025-11-11T11:44:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new Android remote access trojan (RAT) called Fantasy Hub that's sold on Russian-speaking Telegram channels under a Malware-as-a-Service (MaaS) mo..."
  },
  {
    "title": "Kimsuky APT Takes Over South Korean Androids, Abuses KakaoTalk",
    "link": "https://www.darkreading.com/remote-workforce/kimsuky-apt-south-korean-androids-abuses-kakaotalk",
    "date": "2025-11-11T11:40:59.000Z",
    "source": "Dark Reading",
    "summary": "Konni, a subset of the state-sponsored DPRK cyberespionage group, first exploits Google Find Hub, which ironically aims to protect lost Android devices, to remotely wipe devices...."
  },
  {
    "title": "APT37 hackers abuse Google Find Hub in Android data-wiping attacks",
    "link": "https://www.bleepingcomputer.com/news/security/apt37-hackers-abuse-google-find-hub-in-android-data-wiping-attacks/",
    "date": "2025-11-11T00:46:40.000Z",
    "source": "Bleeping Computer",
    "summary": "North Korean hackers from the KONNI activity cluster are abusing Google's Find Hub tool to track their targets' GPS positions and trigger remote factory resets of Android devices. [...]..."
  },
  {
    "title": "Mozilla Firefox gets new anti-fingerprinting defenses",
    "link": "https://www.bleepingcomputer.com/news/security/mozilla-firefox-gets-new-anti-fingerprinting-defenses/",
    "date": "2025-11-10T22:25:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Mozilla announced a major privacy upgrade in Firefox 145 that reduces even more the number of users vulnerable to digital fingerprinting. [...]..."
  },
  {
    "title": "OWASP Highlights Supply Chain Risks in New Top 10 List",
    "link": "https://www.darkreading.com/application-security/owasp-highlights-supply-chain-risks-new-top-10",
    "date": "2025-11-10T22:14:09.000Z",
    "source": "Dark Reading",
    "summary": "Security misconfiguration jumped to second place while injection vulnerabilities dropped, as organizations improve defenses against traditional coding flaws...."
  },
  {
    "title": "GlassWorm Returns, Slices Back into VS Code Extensions",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/glassworm-returns-vs-code-extensions",
    "date": "2025-11-10T21:53:50.000Z",
    "source": "Dark Reading",
    "summary": "GlassWorm, a self-propagating VS Code malware first found in the Open VSX marketplace, continues to infect developer devices around the world...."
  },
  {
    "title": "Quantum Route Redirect PhaaS targets Microsoft 365 users worldwide",
    "link": "https://www.bleepingcomputer.com/news/security/quantum-route-redirect-phaas-targets-microsoft-365-users-worldwide/",
    "date": "2025-11-10T21:29:03.000Z",
    "source": "Bleeping Computer",
    "summary": "A new phishing automation platform named Quantum Route Redirect is using around 1,000 domains to steal Microsoft 365 users' credentials. [...]..."
  },
  {
    "title": "Hackers Exploiting Triofox Flaw to Install Remote Access Tools via Antivirus Feature",
    "link": "https://thehackernews.com/2025/11/hackers-exploiting-triofox-flaw-to.html",
    "date": "2025-11-10T20:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Google's Mandiant Threat Defense on Monday said it discovered n-day exploitation of a now-patched security flaw in Gladinet's Triofox file-sharing and remote access platform.\nThe critical vulnerabilit..."
  },
  {
    "title": "Konni Hackers Turn Google’s Find Hub into a Remote Data-Wiping Weapon",
    "link": "https://thehackernews.com/2025/11/konni-hackers-turn-googles-find-hub.html",
    "date": "2025-11-10T20:29:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korea-affiliated threat actor known as Konni (aka Earth Imp, Opal Sleet, Osmium, TA406, and Vedalia) has been attributed to a new set of attacks targeting both Android and Windows devices fo..."
  },
  {
    "title": "CISA orders feds to patch Samsung zero-day used in spyware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-feds-to-patch-samsung-zero-day-used-in-spyware-attacks/",
    "date": "2025-11-10T20:00:34.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA ordered U.S. federal agencies today to patch a critical Samsung vulnerability that has been exploited in zero-day attacks to deploy LandFall spyware on devices running WhatsApp. [...]..."
  },
  {
    "title": "Yanluowang initial access broker pleaded guilty to ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/yanluowang-initial-access-broker-pleaded-guilty-to-ransomware-attacks/",
    "date": "2025-11-10T19:12:51.000Z",
    "source": "Bleeping Computer",
    "summary": "A Russian national will plead guilty to acting as an initial access broker (IAB) for Yanluowang ransomware attacks that targeted at least eight U.S. companies between July 2021 and November 2022. [......"
  },
  {
    "title": "Popular JavaScript library expr-eval vulnerable to RCE flaw",
    "link": "https://www.bleepingcomputer.com/news/security/popular-javascript-library-expr-eval-vulnerable-to-rce-flaw/",
    "date": "2025-11-10T18:32:29.000Z",
    "source": "Bleeping Computer",
    "summary": "A critical vulnerability in the popular expr-eval JavaScript library, with over 800,000 weekly downloads on NPM, can be exploited to execute code remotely through maliciously crafted input. [...]..."
  },
  {
    "title": "ClickFix Campaign Targets Hotels, Spurs Secondary Customer Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/clickfix-targets-hotels-secondary-customer-attacks",
    "date": "2025-11-10T15:16:58.000Z",
    "source": "Dark Reading",
    "summary": "Attackers compromise hospitality providers with an infostealer and RAT malware and then use stolen data to launch phishing attacks against customers via both email and WhatsApp...."
  },
  {
    "title": "5 reasons why attackers are phishing over LinkedIn",
    "link": "https://www.bleepingcomputer.com/news/security/5-reasons-why-attackers-are-phishing-over-linkedin/",
    "date": "2025-11-10T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers are increasingly phishing over LinkedIn to reach executives and bypass email security tools. Push Security explains how real-time browser protection detects and blocks phishing across apps a..."
  },
  {
    "title": "⚡ Weekly Recap: Hyper-V Malware, Malicious AI Bots, RDP Exploits, WhatsApp Lockdown and More",
    "link": "https://thehackernews.com/2025/11/weekly-recap-hyper-v-malware-malicious.html",
    "date": "2025-11-10T12:51:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyber threats didn’t slow down last week—and attackers are getting smarter. We’re seeing malware hidden in virtual machines, side-channel leaks exposing AI chats, and spyware quietly targeting Android..."
  },
  {
    "title": "New Browser Security Report Reveals Emerging Threats for Enterprises",
    "link": "https://thehackernews.com/2025/11/new-browser-security-report-reveals.html",
    "date": "2025-11-10T11:58:06.000Z",
    "source": "The Hacker News",
    "summary": "According to the new Browser Security Report 2025, security leaders are discovering that most identity, SaaS, and AI-related risks converge in a single place, the user’s browser. Yet traditional contr..."
  },
  {
    "title": "Large-Scale ClickFix Phishing Attacks Target Hotel Systems with PureRAT Malware",
    "link": "https://thehackernews.com/2025/11/large-scale-clickfix-phishing-attacks.html",
    "date": "2025-11-10T09:11:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have called attention to a massive phishing campaign targeting the hospitality industry that lures hotel managers to ClickFix-style pages and harvest their credentials by dep..."
  },
  {
    "title": "GlassWorm Malware Discovered in Three VS Code Extensions with Thousands of Installs",
    "link": "https://thehackernews.com/2025/11/glassworm-malware-discovered-in-three.html",
    "date": "2025-11-10T08:51:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a new set of three extensions associated with the GlassWorm campaign, indicating continued attempts on part of threat actors to target the Visual Studio Code (..."
  },
  {
    "title": "How to use the new Windows 11 Start menu, now rolling out",
    "link": "https://www.bleepingcomputer.com/news/microsoft/how-to-use-the-new-windows-11-start-menu-now-rolling-out/",
    "date": "2025-11-09T23:28:57.000Z",
    "source": "Bleeping Computer",
    "summary": "The Windows Start menu is getting its first major redesign since 2021 and will be rolled out to everyone with the November 11 Patch Tuesday update. [...]..."
  }
]