[
  {
    "title": "QNAP warns of critical ASP.NET flaw in its Windows backup software",
    "link": "https://www.bleepingcomputer.com/news/security/qnap-warns-its-windows-backup-software-is-also-affected-by-critical-aspnet-flaw/",
    "date": "2025-10-27T16:55:02.000Z",
    "source": "Bleeping Computer",
    "summary": "QNAP warned customers to patch a critical ASP.NET Core vulnerability that also impacts the company's NetBak PC Agent, a Windows utility for backing& up data to a QNAP network-attached storage (NAS) de..."
  },
  {
    "title": "Italian spyware vendor linked to Chrome zero-day attacks",
    "link": "https://www.bleepingcomputer.com/news/security/italian-spyware-vendor-linked-to-chrome-zero-day-attacks/",
    "date": "2025-10-27T16:37:28.000Z",
    "source": "Bleeping Computer",
    "summary": "A zero-day vulnerability in Google Chrome exploited in Operation ForumTroll earlier this year delivered malware linked to Italian spyware vendor Memento Labs, born after IntheCyber ​​Group acquired th..."
  },
  {
    "title": "X Warns Users With Security Keys to Re-Enroll Before November 10 to Avoid Lockouts",
    "link": "https://thehackernews.com/2025/10/x-warns-users-with-security-keys-to-re.html",
    "date": "2025-10-27T16:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Social media platform X is urging users who have enrolled for two-factor authentication (2FA) using passkeys and hardware security keys like Yubikeys to re-enroll their key to ensure continued access ..."
  },
  {
    "title": "Google says everyone will be able to vibe code video games ",
    "link": "https://www.bleepingcomputer.com/news/google/google-says-everyone-will-be-able-to-vibe-code-video-games/",
    "date": "2025-10-27T15:59:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Google AI Studio product lead teased that everyone will be able to vibe code video games by the end of the year. [...]..."
  },
  {
    "title": "Qilin Targets Windows Hosts With Linux-Based Ransomware",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/qilin-targets-windows-hosts-linux-based-ransomware",
    "date": "2025-10-27T15:18:34.000Z",
    "source": "Dark Reading",
    "summary": "The attack by the one of the most impactful RaaS groups active today demonstrates an evasion strategy that can stump defenses not equipped to detect cross-platform threats...."
  },
  {
    "title": "Microsoft: New policy removes pre-installed Microsoft Store apps",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-now-lets-admins-remove-pre-installed-microsoft-store-apps-via-policy/",
    "date": "2025-10-27T15:13:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft now allows IT administrators to remove pre-installed Microsoft Store apps (also known as in-box apps) using a new app management policy. [...]..."
  },
  {
    "title": "New ChatGPT Atlas Browser Exploit Lets Attackers Plant Persistent Hidden Commands",
    "link": "https://thehackernews.com/2025/10/new-chatgpt-atlas-browser-exploit-lets.html",
    "date": "2025-10-27T14:31:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new vulnerability in OpenAI's ChatGPT Atlas web browser that could allow malicious actors to inject nefarious instructions into the artificial intelligence ..."
  },
  {
    "title": "The State of Exposure Management in 2025: Insights From 3,000+ Organizations",
    "link": "https://www.bleepingcomputer.com/news/security/the-state-of-exposure-management-in-2025-insights-from-3-000-plus-organizations/",
    "date": "2025-10-27T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers are using AI to weaponize old vulnerabilities while security teams face expanding attack surfaces and limited resources. Intruder's 2025 Exposure Management Index reveals how 3,000+ organiza..."
  },
  {
    "title": "CISA orders feds to patch Windows Server WSUS flaw used in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-feds-to-patch-windows-server-wsus-flaw-exploited-in-attacks/",
    "date": "2025-10-27T13:27:35.000Z",
    "source": "Bleeping Computer",
    "summary": "The Cybersecurity and Infrastructure Security Agency (CISA) ordered U.S. government agencies to patch a critical-severity Windows Server Update Services (WSUS) vulnerability after adding it to its cat..."
  },
  {
    "title": "⚡ Weekly Recap: WSUS Exploited, LockBit 5.0 Returns, Telegram Backdoor, F5 Breach Widens",
    "link": "https://thehackernews.com/2025/10/weekly-recap-wsus-exploited-lockbit-50.html",
    "date": "2025-10-27T12:51:00.000Z",
    "source": "The Hacker News",
    "summary": "Security, trust, and stability — once the pillars of our digital world — are now the tools attackers turn against us. From stolen accounts to fake job offers, cybercriminals keep finding new ways to e..."
  },
  {
    "title": "Qilin Ransomware Combines Linux Payload With BYOVD Exploit in Hybrid Attack",
    "link": "https://thehackernews.com/2025/10/qilin-ransomware-combines-linux-payload.html",
    "date": "2025-10-27T08:55:00.000Z",
    "source": "The Hacker News",
    "summary": "The ransomware group known as Qilin (aka Agenda, Gold Feather, and Water Galura) has claimed more than 40 victims every month since the start of 2025, barring January, with the number of postings on i..."
  },
  {
    "title": "ChatGPT Atlas Browser Can Be Tricked by Fake URLs into Executing Hidden Commands",
    "link": "https://thehackernews.com/2025/10/chatgpt-atlas-browser-can-be-tricked-by.html",
    "date": "2025-10-27T07:29:00.000Z",
    "source": "The Hacker News",
    "summary": "The newly released OpenAI ChatGPT Atlas web browser has been found to be susceptible to a prompt injection attack where its omnibox can be jailbroken by disguising a malicious prompt as a seemingly ha..."
  },
  {
    "title": "Hackers steal Discord accounts with RedTiger-based infostealer",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-steal-discord-accounts-with-redtiger-based-infostealer/",
    "date": "2025-10-26T14:26:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers are using the open-source red-team tool RedTiger to build an infostealer that collects Discord account data and payment information. [...]..."
  },
  {
    "title": "New CoPhish attack steals OAuth tokens via Copilot Studio agents",
    "link": "https://www.bleepingcomputer.com/news/security/new-cophish-attack-steals-oauth-tokens-via-copilot-studio-agents/",
    "date": "2025-10-25T16:16:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A new phishing technique dubbed 'CoPhish' weaponizes Microsoft Copilot Studio agents to deliver fraudulent OAuth consent requests via legitimate and trusted Microsoft domains. [...]..."
  },
  {
    "title": "Microsoft Issues Emergency Patch for Critical Windows Server Bug",
    "link": "https://www.darkreading.com/vulnerabilities-threats/microsoft-emergency-patch-windows-server-bug",
    "date": "2025-10-24T19:34:00.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft initially fixed CVE-2025-59287 in the WSUS update mechanism in the October 2025 Patch Tuesday release, but the company has now issued a second, out-of-band update for the flaw, which is unde..."
  },
  {
    "title": "Hackers launch mass attacks exploiting outdated WordPress plugins",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-launch-mass-attacks-exploiting-outdated-wordpress-plugins/",
    "date": "2025-10-24T19:28:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A widespread exploitation campaign is targeting WordPress websites with GutenKit and Hunk Companion plugins vulnerable to critical-severity, old security issues that can be used to achieve remote code..."
  },
  {
    "title": "Smishing Triad Linked to 194,000 Malicious Domains in Global Phishing Operation",
    "link": "https://thehackernews.com/2025/10/smishing-triad-linked-to-194000.html",
    "date": "2025-10-24T18:35:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actors behind a large-scale, ongoing smishing campaign have been attributed to more than 194,000 malicious domains since January 1, 2024, targeting a broad range of services across the worl..."
  },
  {
    "title": "How CISA Layoffs Weaken Civilian Cyber Defense",
    "link": "https://www.darkreading.com/cybersecurity-operations/cisa-layoffs-weaken-civilian-cyber-defense",
    "date": "2025-10-24T17:41:33.000Z",
    "source": "Dark Reading",
    "summary": "Cyber teams need to get to work backfilling diminishing federal resources, according to Alexander Garcia-Tobar, who shares clear steps on a path forward for protecting enterprises with less CISA help...."
  },
  {
    "title": "Newly Patched Critical Microsoft WSUS Flaw Comes Under Active Exploitation",
    "link": "https://thehackernews.com/2025/10/microsoft-issues-emergency-patch-for.html",
    "date": "2025-10-24T16:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Thursday released out-of-band security updates to patch a critical-severity Windows Server Update Service (WSUS) vulnerability with a proof-of-concept (Poc) exploit publicly available and..."
  },
  {
    "title": "Critical WSUS flaw in Windows Server now exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-now-exploiting-critical-windows-server-wsus-flaw-in-attacks/",
    "date": "2025-10-24T16:28:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers are now exploiting a critical-severity Windows Server Update Services (WSUS) vulnerability, which already has publicly available proof-of-concept exploit code. [...]..."
  },
  {
    "title": "Shutdown Sparks 85% Increase in US Government Cyberattacks",
    "link": "https://www.darkreading.com/cybersecurity-operations/shutdown-increase-us-government-cyberattacks",
    "date": "2025-10-24T16:23:19.000Z",
    "source": "Dark Reading",
    "summary": "Attackers are pouncing on financially strapped US government agencies and furloughed employees. And the effects of this period might be felt for a long time hereafter...."
  },
  {
    "title": "Amazon: This week’s AWS outage caused by major DNS failure",
    "link": "https://www.bleepingcomputer.com/news/technology/amazon-this-weeks-aws-outage-caused-by-major-dns-failure/",
    "date": "2025-10-24T15:33:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Amazon says a major DNS failure was behind a massive AWS (Amazon Web Services) outage that took down many websites and online services on Monday. [...]..."
  },
  {
    "title": "Fake LastPass death claims used to breach password vaults",
    "link": "https://www.bleepingcomputer.com/news/security/fake-lastpass-death-claims-used-to-breach-password-vaults/",
    "date": "2025-10-24T14:47:48.000Z",
    "source": "Bleeping Computer",
    "summary": "LastPass is warning customers of a phishing campaign sending emails with an access request to the password vault as part of a legacy inheritance process. [...]..."
  },
  {
    "title": "APT36 Targets Indian Government with Golang-Based DeskRAT Malware Campaign",
    "link": "https://thehackernews.com/2025/10/apt36-targets-indian-government-with.html",
    "date": "2025-10-24T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A Pakistan-nexus threat actor has been observed targeting Indian government entities as part of spear-phishing attacks designed to deliver a Golang-based malware known as DeskRAT.\nThe activity, observ..."
  },
  {
    "title": "The Cybersecurity Perception Gap: Why Executives and Practitioners See Risk Differently",
    "link": "https://thehackernews.com/2025/10/the-cybersecurity-perception-gap-why.html",
    "date": "2025-10-24T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Does your organization suffer from a cybersecurity perception gap? Findings from the Bitdefender 2025 Cybersecurity Assessment suggest the answer is probably “yes” — and many leaders may not even real..."
  },
  {
    "title": "3,000 YouTube Videos Exposed as Malware Traps in Massive Ghost Network Operation",
    "link": "https://thehackernews.com/2025/10/3000-youtube-videos-exposed-as-malware.html",
    "date": "2025-10-24T10:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A malicious network of YouTube accounts has been observed publishing and promoting videos that lead to malware downloads, essentially abusing the popularity and trust associated with the video hosting..."
  },
  {
    "title": "Self-Spreading 'GlassWorm' Infects VS Code Extensions in Widespread Supply Chain Attack",
    "link": "https://thehackernews.com/2025/10/self-spreading-glassworm-infects-vs.html",
    "date": "2025-10-24T07:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a self-propagating worm that spreads via Visual Studio Code (VS Code) extensions on the Open VSX Registry and the Microsoft Extension Marketplace, underscorin..."
  },
  {
    "title": "US Crypto Bust Offers Hope in Battle Against Cybercrime Syndicates",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/us-crypto-bust-hope-battle-against-cybercrime-syndicates",
    "date": "2025-10-24T02:00:00.000Z",
    "source": "Dark Reading",
    "summary": "A $14 billion seizure by US investigators presents a warning for cybercriminals' reliance on bitcoin but is still a positive development for the cryptocurrency industry...."
  },
  {
    "title": "Fear the 'SessionReaper': Adobe Commerce Flaw Under Attack",
    "link": "https://www.darkreading.com/vulnerabilities-threats/sessionreaper-adobe-commerce-flaw-under-attack",
    "date": "2025-10-23T21:25:50.000Z",
    "source": "Dark Reading",
    "summary": "CVE-2025-54236 is a critical flaw in Adobe Commerce (formerly Magento) that allows attackers to remotely take over sessions on the e-commerce platform...."
  },
  {
    "title": "Tired of Unpaid Toll Texts? Blame the 'Smishing Triad'",
    "link": "https://www.darkreading.com/threat-intelligence/unpaid-toll-texts-smishing-triad",
    "date": "2025-10-23T20:19:43.000Z",
    "source": "Dark Reading",
    "summary": "Chinese smishers — the bane of every American with a phone — have been shifting to lower-frequency, possibly higher-impact government impersonation attacks...."
  }
]