[
  {
    "title": "Top Apple, Google VPN Apps May Help China Spy on Users",
    "link": "https://www.darkreading.com/cloud-security/apple-google-vpn-apps-china-spy-users",
    "date": "2025-06-27T20:50:45.000Z",
    "source": "Dark Reading",
    "summary": "Apple and Google espouse strong values about data privacy, but they allow programs from a Big Brother state to thrive on their app stores, researchers allege...."
  },
  {
    "title": "Cloudflare blocks largest DDoS attack - here's how to protect yourself",
    "link": "https://www.zdnet.com/article/cloudflare-blocks-largest-ddos-attack-heres-how-to-protect-yourself/",
    "date": "2025-06-27T20:23:39.000Z",
    "source": "ZDNet Security",
    "summary": "But, even bigger attacks are on their way. Here's what you can do to slow them down and hopefully stop them in their tracks...."
  },
  {
    "title": "'CitrixBleed 2' Shows Signs of Active Exploitation",
    "link": "https://www.darkreading.com/vulnerabilities-threats/citrixbleed-2-active-exploitation",
    "date": "2025-06-27T18:50:12.000Z",
    "source": "Dark Reading",
    "summary": "If exploited, the critical vulnerability allows attackers to maintain access for longer periods of time than the original CitrixBleed flaw, all while remaining undetected...."
  },
  {
    "title": "Scattered Spider hackers shift focus to aviation, transportation firms",
    "link": "https://www.bleepingcomputer.com/news/security/scattered-spider-hackers-shift-focus-to-aviation-transportation-firms/",
    "date": "2025-06-27T18:20:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers associated with Scattered Spider tactics have expanded their targeting to the aviation and transportation industries after previously attacking insurance and retail sectors [...]..."
  },
  {
    "title": "Anthropic has a plan to combat AI-triggered job losses predicted by its CEO",
    "link": "https://www.zdnet.com/article/anthropic-has-a-plan-to-combat-ai-triggered-job-losses-predicted-by-its-ceo/",
    "date": "2025-06-27T18:13:00.000Z",
    "source": "ZDNet Security",
    "summary": "The program, which includes research grants and public forums, follows its dire predictions about widespread job losses induced by AI...."
  },
  {
    "title": "How to turn off ACR on your TV (and why it make such a big difference)",
    "link": "https://www.zdnet.com/article/how-to-turn-off-acr-on-your-tv-and-why-it-make-such-a-big-difference/",
    "date": "2025-06-27T17:12:00.000Z",
    "source": "ZDNet Security",
    "summary": "Smarter TV operating systems make things more convenient - but they also come with new privacy risks, especially when it comes to automatic content recognition (ACR)...."
  },
  {
    "title": "Scattered Spider Taps CFO Credentials in 'Scorched Earth' Attack",
    "link": "https://www.darkreading.com/cloud-security/scattered-spider-cfo-scorched-earth-attack",
    "date": "2025-06-27T17:11:23.000Z",
    "source": "Dark Reading",
    "summary": "In a recent intrusion, the notorious cybercriminal collective accessed CyberArk vaults and obtained more 1,400 secrets, subverted Azure, VMware, and Snowflake environments, and for the first known tim..."
  },
  {
    "title": "How to turn on Android's Private DNS mode - and why turning it off is a big mistake",
    "link": "https://www.zdnet.com/article/how-to-turn-on-androids-private-dns-mode-and-why-turning-it-off-is-a-big-mistake/",
    "date": "2025-06-27T17:10:00.000Z",
    "source": "ZDNet Security",
    "summary": "Unencrypted DNS requests can reveal your browsing habits, but Android's Private DNS Mode helps keep that info hidden. Here's how to turn it on...."
  },
  {
    "title": "Over 1,000 SOHO Devices Hacked in China-linked LapDogs Cyber Espionage Campaign",
    "link": "https://thehackernews.com/2025/06/over-1000-soho-devices-hacked-in-china.html",
    "date": "2025-06-27T15:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters have discovered a network of more than 1,000 compromised small office and home office (SOHO) devices that have been used to facilitate a prolonged cyber espionage infrastructure campaig..."
  },
  {
    "title": "Russia’s throttling of Cloudflare makes sites inaccessible",
    "link": "https://www.bleepingcomputer.com/news/technology/russias-throttling-of-cloudflare-makes-sites-inaccessible/",
    "date": "2025-06-27T15:47:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Starting June 9, 2025, Russian internet service providers (ISPs) have begun throttling access to websites and services protected by Cloudflare, an American internet giant. [...]..."
  },
  {
    "title": "Hackers Make Hay? Smart Tractors Vulnerable to Full Takeover",
    "link": "https://www.darkreading.com/cloud-security/hackers-hay-smart-tractors-vulnerable-takeover",
    "date": "2025-06-27T15:33:29.000Z",
    "source": "Dark Reading",
    "summary": "Hackers can spy on tens of thousands of connected tractors in the latest IoT threat, and brick them too, thanks to poor security in an aftermarket steering system...."
  },
  {
    "title": "Is classic Outlook crashing when you open or start an email? There's now a fix for that",
    "link": "https://www.zdnet.com/article/is-classic-outlook-crashing-when-you-start-or-reply-to-an-email-a-fix-is-on-the-way/",
    "date": "2025-06-27T14:34:00.000Z",
    "source": "ZDNet Security",
    "summary": "A fix from Microsoft is available now. Here's how to get it...."
  },
  {
    "title": "Citrix Bleed 2 flaw now believed to be exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-bleed-2-flaw-now-believed-to-be-exploited-in-attacks/",
    "date": "2025-06-27T14:18:09.000Z",
    "source": "Bleeping Computer",
    "summary": "A critical NetScaler ADC and Gateway vulnerability dubbed \"Citrix Bleed 2\" (CVE-2025-5777) is now likely exploited in attacks, according to cybersecurity firm ReliaQuest, seeing an increase in suspici..."
  },
  {
    "title": "Vulnerability Debt: How Do You Put a Price on What to Fix?",
    "link": "https://www.darkreading.com/vulnerabilities-threats/vulnerability-debt-fix-price",
    "date": "2025-06-27T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Putting a vulnerability debt figure together involves work, but having vulnerability debt figures lets you measure real-world values against your overall security posture...."
  },
  {
    "title": "PUBLOAD and Pubshell Malware Used in Mustang Panda's Tibet-Specific Attack",
    "link": "https://thehackernews.com/2025/06/pubload-and-pubshell-malware-used-in.html",
    "date": "2025-06-27T13:25:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-linked threat actor known as Mustang Panda has been attributed to a new cyber espionage campaign directed against the Tibetan community.\nThe spear-phishing attacks leveraged topics related to ..."
  },
  {
    "title": "US Falling Behind China in Exploit Production",
    "link": "https://www.darkreading.com/cyber-risk/us-falling-behind-china-exploit-production",
    "date": "2025-06-27T13:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Cyber operations have become critical to national security, but the United States has fallen behind in one significant area — exploit production — while China has built up a significant lead...."
  },
  {
    "title": "Business Case for Agentic AI SOC Analysts",
    "link": "https://thehackernews.com/2025/06/business-case-for-agentic-ai-soc.html",
    "date": "2025-06-27T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Security operations centers (SOCs) are under pressure from both sides: threats are growing more complex and frequent, while security budgets are no longer keeping pace. Today’s security leaders are ex..."
  },
  {
    "title": "Chinese Group Silver Fox Uses Fake Websites to Deliver Sainbox RAT and Hidden Rootkit",
    "link": "https://thehackernews.com/2025/06/chinese-group-silver-fox-uses-fake.html",
    "date": "2025-06-27T10:25:00.000Z",
    "source": "The Hacker News",
    "summary": "A new campaign has been observed leveraging fake websites advertising popular software such as WPS Office, Sogou, and DeepSeek to deliver Sainbox RAT and the open-source Hidden rootkit.\nThe activity h..."
  },
  {
    "title": "Retail giant Ahold Delhaize says data breach affects 2.2 million people",
    "link": "https://www.bleepingcomputer.com/news/security/retail-giant-ahold-delhaize-says-data-breach-affects-22-million-people/",
    "date": "2025-06-27T09:12:43.000Z",
    "source": "Bleeping Computer",
    "summary": "Ahold Delhaize, one of the world's largest food retail chains, is notifying over 2.2 million individuals that their personal, financial, and health information was stolen in a November ransomware atta..."
  },
  {
    "title": "Your Android phone is getting a big security upgrade for free - here's what's new",
    "link": "https://www.zdnet.com/article/your-android-phone-is-getting-a-big-security-upgrade-for-free-heres-whats-new/",
    "date": "2025-06-27T08:45:12.000Z",
    "source": "ZDNet Security",
    "summary": "Google says its latest security features are designed to block scam calls and texts, shady apps, and even phone theft. Here's how they work...."
  },
  {
    "title": "MOVEit Transfer Faces Increased Threats as Scanning Surges and CVE Flaws Are Targeted",
    "link": "https://thehackernews.com/2025/06/moveit-transfer-faces-increased-threats.html",
    "date": "2025-06-27T07:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat intelligence firm GreyNoise is warning of a \"notable surge\" in scanning activity targeting Progress MOVEit Transfer systems starting May 27, 2025—suggesting that attackers may be preparing for ..."
  },
  {
    "title": "Windows 11 KB5060829 update released with 38 new changes, fixes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5060829-update-released-with-38-new-changes-fixes/",
    "date": "2025-06-27T07:28:59.000Z",
    "source": "Bleeping Computer",
    "summary": "​​Microsoft has released the KB5060829 preview cumulative update for Windows 11 24H2, which includes 38 changes, including improvements to the taskbar and a new PC-to-PC migration experience. [...]..."
  },
  {
    "title": "OneClik Malware Targets Energy Sector Using Microsoft ClickOnce and Golang Backdoors",
    "link": "https://thehackernews.com/2025/06/oneclik-malware-targets-energy-sector.html",
    "date": "2025-06-27T06:31:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have detailed a new campaign dubbed OneClik that leverages Microsoft's ClickOnce software deployment technology and bespoke Golang backdoors to compromise organizations withi..."
  },
  {
    "title": "Whole Foods supplier UNFI restores core systems after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/whole-foods-supplier-unfi-restores-core-systems-after-cyberattack/",
    "date": "2025-06-27T06:21:49.000Z",
    "source": "Bleeping Computer",
    "summary": "American grocery wholesale giant United Natural Foods (UNFI) reports that it has restored its core systems and brought online the electronic ordering and invoicing systems affected by a cyberattack. [..."
  },
  {
    "title": "'Cyber Fattah' Hacktivist Group Leaks Saudi Games Data",
    "link": "https://www.darkreading.com/threat-intelligence/cyber-fattah-hacktivist-leaks-saudi-games-data",
    "date": "2025-06-27T06:00:00.000Z",
    "source": "Dark Reading",
    "summary": "As tensions in the Middle East rise, hacktivist groups are coming out of the woodwork with their own agendas, leading to notable shifts in the hacktivist threat landscape...."
  },
  {
    "title": "Hawaiian Airlines discloses cyberattack, flights not affected",
    "link": "https://www.bleepingcomputer.com/news/security/hawaiian-airlines-discloses-cyberattack-flights-not-affected/",
    "date": "2025-06-27T05:37:04.000Z",
    "source": "Bleeping Computer",
    "summary": "Hawaiian Airlines, the tenth-largest commercial airline in the United States, is investigating a cyberattack that has disrupted access to some of its systems. [...]..."
  },
  {
    "title": "'IntelBroker' Suspect Arrested, Charged in High-Profile Breaches",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/intebroker-suspect-arrested-charged-breaches",
    "date": "2025-06-26T20:59:04.000Z",
    "source": "Dark Reading",
    "summary": "A British national arrested earlier this year in France was charged by the US Department of Justice in connection with a string of major cyberattacks...."
  },
  {
    "title": "FTC approves $126 million in Fortnite refunds over ‘dark patterns’",
    "link": "https://www.bleepingcomputer.com/news/legal/ftc-approves-126-million-in-fortnite-refunds-over-dark-patterns/",
    "date": "2025-06-26T20:27:08.000Z",
    "source": "Bleeping Computer",
    "summary": "The Federal Trade Commission (FTC) has approved $126,000,000 in refunds to be sent to 969,173 Fortnite players as part of a settlement over allegations that Epic Games tricked users into making unwant..."
  },
  {
    "title": "Brother printer bug in 689 models exposes default admin passwords",
    "link": "https://www.bleepingcomputer.com/news/security/brother-printer-bug-in-689-models-exposes-default-admin-passwords/",
    "date": "2025-06-26T18:10:25.000Z",
    "source": "Bleeping Computer",
    "summary": "A total of 689 printer models from Brother, along with 53 other models from Fujifilm, Toshiba, and Konica Minolta, come with a default administrator password that remote attackers can generate. Even w..."
  },
  {
    "title": "Critical Open VSX Registry Flaw Exposes Millions of Developers to Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/06/critical-open-vsx-registry-flaw-exposes.html",
    "date": "2025-06-26T16:46:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a critical vulnerability in the Open VSX Registry (\"open-vsx[.]org\") that, if successfully exploited, could have enabled attackers to take control of the entir..."
  }
]