[
  {
    "title": "Critical Cisco SD-WAN bug exploited in zero-day attacks since 2023",
    "link": "https://www.bleepingcomputer.com/news/security/critical-cisco-sd-wan-bug-exploited-in-zero-day-attacks-since-2023/",
    "date": "2026-02-25T18:01:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco is warning that a critical authentication bypass vulnerability in Cisco Catalyst SD-WAN, tracked as CVE-2026-20127, was actively exploited in zero-day attacks that allowed remote attackers to co..."
  },
  {
    "title": "Chinese cyberspies breached dozens of telecom firms, govt agencies",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-cyberspies-breached-dozens-of-telecom-firms-govt-agencies/",
    "date": "2026-02-25T17:00:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Google's Threat Intelligence Group (GTIG), Mandiant, and partners disrupted a global espionage campaign attributed to a suspected Chinese threat actor that used SaaS API calls to hide malicious traffi..."
  },
  {
    "title": "Claude Code Flaws Allow Remote Code Execution and API Key Exfiltration",
    "link": "https://thehackernews.com/2026/02/claude-code-flaws-allow-remote-code.html",
    "date": "2026-02-25T17:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed multiple security vulnerabilities in Anthropic's Claude Code, an artificial intelligence (AI)-powered coding assistant, that could result in remote code execut..."
  },
  {
    "title": "Malicious Next.js Repos Target Developers Via Fake Job Interviews",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/malicious-nextjs-repos-developers-fake-job-interviews",
    "date": "2026-02-25T16:42:00.000Z",
    "source": "Dark Reading",
    "summary": "Linked to North Korean fake job-recruitment campaigns, the poisoned repositories are aimed at establishing persistent access to infected machines...."
  },
  {
    "title": "Marquis sues SonicWall over backup breach that led to ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/marquis-sues-sonicwall-over-backup-breach-that-led-to-ransomware-attack/",
    "date": "2026-02-25T15:54:44.000Z",
    "source": "Bleeping Computer",
    "summary": "Marquis Software Solutions has filed a lawsuit against SonicWall, accusing the cybersecurity company of gross negligence and misrepresentation that allegedly led to a ransomware attack disrupting oper..."
  },
  {
    "title": "SLH Offers $500–$1,000 Per Call to Recruit Women for IT Help Desk Vishing Attacks",
    "link": "https://thehackernews.com/2026/02/slh-offers-5001000-per-call-to-recruit.html",
    "date": "2026-02-25T15:06:00.000Z",
    "source": "The Hacker News",
    "summary": "The notorious cybercrime collective known as Scattered LAPSUS$ Hunters (SLH) has been observed offering financial incentives to recruit women to pull off social engineering attacks.\nThe idea is to hir..."
  },
  {
    "title": "The OpenClaw Hype: Analysis of Chatter from Open-Source Deep and Dark Web",
    "link": "https://www.bleepingcomputer.com/news/security/the-openclaw-hype-analysis-of-chatter-from-open-source-deep-and-dark-web/",
    "date": "2026-02-25T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenClaw has sparked heavy Telegram and dark web chatter, but Flare's data shows more research hype than mass exploitation. Flare explains how its telemetry found real supply-chain risk in the skills ..."
  },
  {
    "title": "Top 5 Ways Broken Triage Increases Business Risk Instead of Reducing It",
    "link": "https://thehackernews.com/2026/02/top-5-ways-broken-triage-increases.html",
    "date": "2026-02-25T14:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Triage is supposed to make things simpler. In a lot of teams, it does the opposite.\nWhen you can’t reach a confident verdict early, alerts turn into repeat checks, back-and-forth, and “just escalate i..."
  },
  {
    "title": "Why 'Call This Number' TOAD Emails Beat Gateways",
    "link": "https://www.darkreading.com/threat-intelligence/why-call-this-number-toad-emails-beat-gateways",
    "date": "2026-02-25T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Attackers are bypassing email gateways through telephone-oriented attack delivery (TOAD), in which the only email payload is a phone number...."
  },
  {
    "title": "Zyxel warns of critical RCE flaw affecting over a dozen routers",
    "link": "https://www.bleepingcomputer.com/news/security/zyxel-warns-of-critical-rce-flaw-affecting-over-a-dozen-routers/",
    "date": "2026-02-25T12:53:02.000Z",
    "source": "Bleeping Computer",
    "summary": "Taiwan networking provider Zyxel has released security updates to address a critical vulnerability affecting over a dozen router models that can allow unauthenticated attackers to gain remote command ..."
  },
  {
    "title": "Malicious NuGet Packages Stole ASP.NET Data; npm Package Dropped Malware",
    "link": "https://thehackernews.com/2026/02/malicious-nuget-packages-stole-aspnet.html",
    "date": "2026-02-25T12:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered four malicious NuGet packages that are designed to target ASP.NET web application developers to steal sensitive data.\nThe campaign, discovered by Socket, exfi..."
  },
  {
    "title": "'Richter Scale' Model Measures Magnitude of OT Cyber Incidents",
    "link": "https://www.darkreading.com/ics-ot-security/richter-scale-model-measures-cyber-incidents",
    "date": "2026-02-25T12:00:00.000Z",
    "source": "Dark Reading",
    "summary": "ICS/OT experts have devised a scoring system for rating the severity and effects of cybersecurity events in operational technology environments...."
  },
  {
    "title": "Manual Processes Are Putting National Security at Risk",
    "link": "https://thehackernews.com/2026/02/manual-processes-are-putting-national.html",
    "date": "2026-02-25T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Why automating sensitive data transfers is now a mission-critical priority\nMore than half of national security organizations still rely on manual processes to transfer sensitive data, according to The..."
  },
  {
    "title": "US sanctions Russian broker for buying stolen zero-day exploits",
    "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-russian-exploit-broker-for-buying-stolen-zero-days/",
    "date": "2026-02-25T10:31:13.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Treasury Department has sanctioned a Russian exploit broker who bought stolen hacking tools from a former executive of a U.S. defense contractor. [...]..."
  },
  {
    "title": "Defense Contractor Employee Jailed for Selling 8 Zero-Days to Russian Broker",
    "link": "https://thehackernews.com/2026/02/defense-contractor-employee-jailed-for.html",
    "date": "2026-02-25T08:49:00.000Z",
    "source": "The Hacker News",
    "summary": "A 39-year-old Australian national who was previously employed at U.S. defense contractor L3Harris has been sentenced to a little over seven years in prison for selling eight zero-day exploits to Russi..."
  },
  {
    "title": "Ex-L3Harris exec jailed for selling zero-days to Russian exploit broker",
    "link": "https://www.bleepingcomputer.com/news/security/ex-l3harris-exec-jailed-for-selling-zero-days-to-russian-exploit-broker/",
    "date": "2026-02-25T08:21:40.000Z",
    "source": "Bleeping Computer",
    "summary": "The former head of Trenchant, a specialized U.S. defense contractor unit, was sentenced Tuesday to more than seven years in federal prison for stealing and selling zero-day exploits to a Russian broke..."
  },
  {
    "title": "Operation Red Card 2.0 Leads to 651 Arrests in Africa",
    "link": "https://www.darkreading.com/cybersecurity-operations/operation-red-card-2-0-leads-to-651-arrests-in-africa",
    "date": "2026-02-25T08:00:00.000Z",
    "source": "Dark Reading",
    "summary": "In the latest operation targeting cybercrime groups, African law enforcement agencies cooperated with Interpol and cybersecurity firms to recover more than $4.3 million...."
  },
  {
    "title": "Windows 11 KB5077241 update improves BitLocker, adds Sysmon tool",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5077241-update-improves-bitlocker-adds-sysmon-tool/",
    "date": "2026-02-25T07:51:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released the KB5077241 optional cumulative update for Windows 11, which comes with 29 changes, including improvements to BitLocker, a new network speed test tool, and native System Monit..."
  },
  {
    "title": "SolarWinds Patches 4 Critical Serv-U 15.5 Flaws Allowing Root Code Execution",
    "link": "https://thehackernews.com/2026/02/solarwinds-patches-4-critical-serv-u.html",
    "date": "2026-02-25T07:04:00.000Z",
    "source": "The Hacker News",
    "summary": "SolarWinds has released updates to address four critical security flaws in its Serv-U file transfer software that, if successfully exploited, could result in remote code execution.\nThe vulnerabilities..."
  },
  {
    "title": "CISA Confirms Active Exploitation of FileZen CVE-2026-25108 Vulnerability",
    "link": "https://thehackernews.com/2026/02/cisa-confirms-active-exploitation-of.html",
    "date": "2026-02-25T05:23:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added a recently disclosed vulnerability in FileZen to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of..."
  },
  {
    "title": "Phishing campaign targets freight and logistics orgs in the US, Europe",
    "link": "https://www.bleepingcomputer.com/news/security/phishing-campaign-targets-freight-and-logistics-orgs-in-the-us-europe/",
    "date": "2026-02-24T23:57:58.000Z",
    "source": "Bleeping Computer",
    "summary": "A financially motivated threat group dubbed \"Diesel Vortex\" is stealing credentials from freight and logistics operators in the U.S. and Europe in phishing attacks using 52 domains. [...]..."
  },
  {
    "title": "Wynn Resorts confirms employee data breach after extortion threat",
    "link": "https://www.bleepingcomputer.com/news/security/wynn-resorts-confirms-employee-data-breach-after-extortion-threat/",
    "date": "2026-02-24T21:51:20.000Z",
    "source": "Bleeping Computer",
    "summary": "Wynn Resorts has confirmed that a hacker stole employee data from its systems after the company was listed on the ShinyHunters extortion gang's data leak site. [...]..."
  },
  {
    "title": "1Campaign platform helps malicious Google ads evade detection",
    "link": "https://www.bleepingcomputer.com/news/security/1campaign-platform-helps-malicious-google-ads-evade-detection/",
    "date": "2026-02-24T21:45:05.000Z",
    "source": "Bleeping Computer",
    "summary": "A newly identified cybercrime service known as 1Campaign is enabling threat actors to run malicious Google Ads that remain online for extended periods while evading scrutiny from security researchers...."
  },
  {
    "title": "Attackers Now Need Just 29 Minutes to Own a Network",
    "link": "https://www.darkreading.com/cyber-risk/attackers-now-need-just-29-minutes-to-own-a-network",
    "date": "2026-02-24T21:38:15.000Z",
    "source": "Dark Reading",
    "summary": "Credential misuse, AI tools, and security blind spots help attackers move through breached networks faster than ever, CrowdStrike finds...."
  },
  {
    "title": "Lazarus Group Picks a New Poison: Medusa Ransomware",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/lazarus-group-new-position-medusa-ransomware",
    "date": "2026-02-24T21:18:04.000Z",
    "source": "Dark Reading",
    "summary": "The North Korean threat group also leveraged Comebacker backdoor, Blindingcan RAT, and info stealer Infohook in its recent attacks...."
  },
  {
    "title": "RoguePilot Flaw in GitHub Codespaces Enabled Copilot to Leak GITHUB_TOKEN",
    "link": "https://thehackernews.com/2026/02/roguepilot-flaw-in-github-codespaces.html",
    "date": "2026-02-24T18:52:00.000Z",
    "source": "The Hacker News",
    "summary": "A vulnerability in GitHub Codespaces could have been exploited by bad actors to seize control of repositories by injecting malicious Copilot instructions in a GitHub issue.\nThe artificial intelligence..."
  },
  {
    "title": "CarGurus data breach exposes information of 12.4 million accounts",
    "link": "https://www.bleepingcomputer.com/news/security/cargurus-data-breach-exposes-information-of-124-million-accounts/",
    "date": "2026-02-24T18:08:20.000Z",
    "source": "Bleeping Computer",
    "summary": "The ShinyHunters extortion group has published personal information in more than 12 million records allegedly stolen from CarGurus, a U.S.-based digital auto platform. [...]..."
  },
  {
    "title": "Microsoft adds Copilot data controls to all storage locations",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-adds-copilot-data-controls-to-all-storage-locations/",
    "date": "2026-02-24T17:30:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is expanding data loss prevention (DLP) controls to block the Microsoft 365 Copilot AI assistant from processing confidential Word, Excel, and PowerPoint documents, regardless of their locat..."
  },
  {
    "title": "Identity-First AI Security: Why CISOs Must Add Intent to the Equation",
    "link": "https://www.bleepingcomputer.com/news/security/identity-first-ai-security-why-cisos-must-add-intent-to-the-equation/",
    "date": "2026-02-24T15:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "AI agents now provision infrastructure and approve actions, but many inherit over-scoped privileges without proper governance. Token Security explains why CISOs must treat agents as identities and add..."
  },
  {
    "title": "UK fines Reddit $19 million for using children’s data unlawfully",
    "link": "https://www.bleepingcomputer.com/news/security/uk-fines-reddit-19-million-for-using-childrens-data-unlawfully/",
    "date": "2026-02-24T14:54:24.000Z",
    "source": "Bleeping Computer",
    "summary": "The UK Information Commissioner's Office (ICO) has fined Reddit £14.47 million (over $19.5 million) for collecting and using the personal information of children under 13 without adequate safeguards. ..."
  }
]