[
  {
    "title": "Campaign: Financially Motivated Actor Uses ClickFix Lures to Deploy ZAPCAT Backdoor and Provide Access to Ransomware Affiliate(s)",
    "link": "https://www.virustotal.com/gui/collection/campaign--d6131d2b-0549-5609-9333-c61deb5bc9f6",
    "date": "2025-09-15T21:59:47.000Z",
    "source": "VirusTotal TI",
    "summary": "Created: 2025-09-15 • This campaign was executed across multiple stages by two distinct threat actors: UNC6258 and UNC6259. The intrusions began with UNC6258 gaining initial access through a malicious PowerShell command that used msiexec.exe to deploy the first-stage trojan, BLACKWIDOW. Disguised as an NVIDIA executable, BLACKWIDOW utilized a DLL Search Order Hijack against libcef.dll to achieve execution and establish persistence. After securing a foothold and conducting credential theft from local browsers, the activity shifted, with the second actor, UNC6259, becoming active and deploying the second-stage implant, ZAPCAT, via rundll32.exe. ZAPCAT's primary function was to conduct extensive internal reconnaissance, focusing on Active Directory by enumerating domain trusts, Service Principal Names (SPNs), and Domain Administrator groups, alongside broader system discovery using WMI and PowerShell. This sophisticated multi-actor operation highlights the actors' proficiency in abusing legitimate system tools for malicious purposes, culminating in an attempt to pivot to other systems via SMB after obtaining necessary credentials. This handoff and methodical reconnaissance effort underscore a well-planned objective to maximize network visibility before proceeding with lateral movement.",
    "_vt_fallback_link": "https://www.virustotal.com/gui/search/campaign%3AFinancially%20Motivated%20Actor%20Uses%20ClickFix%20Lures%20to%20Deploy%20ZAPCAT%20Backdoor%20and%20Provide%20Access%20to%20Ransomware%20Affiliate(s)"
  },
  {
    "title": "[Dark Reading Virtual Event] Know Your Enemy: How cybercriminals and nation-state hackers operate",
    "link": "https://www.darkreading.com/events/-dark-reading-virtual-event-know-your-enemy-how-cybercriminals-and-nation-state-hackers-operate",
    "date": "2025-09-25T19:40:58.979Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Chinese APT Drops 'Brickstorm' Backdoors on Edge Devices",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/chinese-apt-brickstorm-backdoors-edge-devices",
    "date": "2025-09-25T19:05:29.000Z",
    "source": "Dark Reading",
    "summary": "The China-linked cyber-espionage group UNC5221 is compromising network appliances that cannot run traditional EDR agents to deploy new versions of the \"Brickstorm\" backdoor...."
  },
  {
    "title": "Urgent: Cisco ASA Zero-Day Duo Under Attack; CISA Triggers Emergency Mitigation Directive",
    "link": "https://thehackernews.com/2025/09/urgent-cisco-asa-zero-day-duo-under.html",
    "date": "2025-09-25T18:17:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco is urging customers to patch two security flaws impacting the VPN web server of Cisco Secure Firewall Adaptive Security Appliance (ASA) Software and Cisco Secure Firewall Threat Defense (FTD) So..."
  },
  {
    "title": "Co-op says it lost $107 million after Scattered Spider attack",
    "link": "https://www.bleepingcomputer.com/news/security/co-op-says-it-lost-107-million-after-scattered-spider-attack/",
    "date": "2025-09-25T18:05:14.000Z",
    "source": "Bleeping Computer",
    "summary": "The Co-operative Group in the U.K. released its interim financial results report for the first half of 2025 with a massive loss in operating profit of £80 million ($107 million) due to the cyberattack..."
  },
  {
    "title": "CISA orders agencies to patch Cisco flaws exploited in zero-day attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-agencies-to-patch-cisco-flaws-exploited-in-zero-day-attacks/",
    "date": "2025-09-25T17:52:55.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA has issued a new emergency directive ordering U.S. federal agencies to secure their Cisco firewall devices against two flaws that have been exploited in zero-day attacks. [...]..."
  },
  {
    "title": "Threatsday Bulletin: Rootkit Patch, Federal Breach, OnePlus SMS Leak, TikTok Scandal & More",
    "link": "https://thehackernews.com/2025/09/threatsday-bulletin-rootkit-patch.html",
    "date": "2025-09-25T17:24:00.000Z",
    "source": "The Hacker News",
    "summary": "/* ===== Container ===== */\n.td-wrap {}\n\n/* ===== Section ===== */\n.td-section {\n}\n.td-title { margin: 16px 0 4px; font-size: 32px; line-height: 1.2; font-weight: 800; }\n.td-subtitle { margin: 0 0 24p..."
  },
  {
    "title": "Vane Viper Generates 1 Trillion DNS Queries to Power Global Malware and Ad Fraud Network",
    "link": "https://thehackernews.com/2025/09/vane-viper-generates-1-trillion-dns.html",
    "date": "2025-09-25T17:22:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Vane Viper has been outed as a purveyor of malicious ad technology (adtech), while relying on a tangled web of shell companies and opaque ownership structures to deliberately..."
  },
  {
    "title": "Cisco warns of ASA firewall zero-days exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-asa-firewall-zero-days-exploited-in-attacks/",
    "date": "2025-09-25T16:49:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco warned customers today to patch two zero-day vulnerabilities that are actively being exploited in attacks and impact the company's firewall software. [...]..."
  },
  {
    "title": "Amazon pays $2.5 billion to settle Prime memberships lawsuit",
    "link": "https://www.bleepingcomputer.com/news/technology/amazon-pays-25-billion-to-settle-prime-memberships-lawsuit/",
    "date": "2025-09-25T16:21:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Amazon will pay $2.5 billion to settle claims by the U.S. Federal Trade Commission (FTC) that it used dark patterns to trick millions of users into enrolling in its Prime program and made it as diffic..."
  },
  {
    "title": "Malicious Rust packages on Crates.io steal crypto wallet keys",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-rust-packages-on-cratesio-steal-crypto-wallet-keys/",
    "date": "2025-09-25T15:43:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Two malicious packages with nearly 8,500 downloads in Rust's official crate repository scanned developers' systems to steal cryptocurrency private keys and other secrets. [...]..."
  },
  {
    "title": "Salesforce Patches Critical ForcedLeak Bug Exposing CRM Data via AI Prompt Injection",
    "link": "https://thehackernews.com/2025/09/salesforce-patches-critical-forcedleak.html",
    "date": "2025-09-25T15:17:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a critical flaw impacting Salesforce Agentforce, a platform for building artificial intelligence (AI) agents, that could allow attackers to potentially exfiltr..."
  },
  {
    "title": "How secure are passkeys, really? Here's what you need to know",
    "link": "https://www.bleepingcomputer.com/news/security/how-secure-are-passkeys-really-heres-what-you-need-to-know/",
    "date": "2025-09-25T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Passwords are weak links—88% of breaches involve stolen creds. Learn more from Specops Software about how passkeys deliver phishing resistance, simpler logins & lower support costs (with some hurdles ..."
  },
  {
    "title": "How Cloud Service Disruptions Are Making Resilience Critical for Developers",
    "link": "https://www.darkreading.com/application-security/cloud-service-disruptions-make-resilience-critical-developers",
    "date": "2025-09-25T13:39:22.000Z",
    "source": "Dark Reading",
    "summary": "Outages affecting DevOps tools threaten to leave developers coding like it's 1999. How serious is the threat and what can companies do?..."
  },
  {
    "title": "North Korean Hackers Use New AkdoorTea Backdoor to Target Global Crypto Developers",
    "link": "https://thehackernews.com/2025/09/north-korean-hackers-use-new-akdoortea.html",
    "date": "2025-09-25T13:14:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korea-linked threat actors associated with the Contagious Interview campaign have been attributed to a previously undocumented backdoor called AkdoorTea, along with tools like TsunamiKit and..."
  },
  {
    "title": "Teen suspected of Vegas casino cyberattacks released to parents",
    "link": "https://www.bleepingcomputer.com/news/security/teen-suspected-of-vegas-casino-cyberattacks-released-to-parents/",
    "date": "2025-09-25T12:51:18.000Z",
    "source": "Bleeping Computer",
    "summary": "A 17-year-old hacker who surrendered to face charges over cyberattacks targeting Vegas casinos in 2023 has been released into the custody of his parents, a family court judge ruled. [...]..."
  },
  {
    "title": "Microsoft will offer free Windows 10 extended security updates in Europe",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-will-offer-free-windows-10-security-updates-in-europe/",
    "date": "2025-09-25T12:45:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft will offer free extended security updates for Windows 10 users in the European Economic Area (EEA), which includes Iceland, Liechtenstein, Norway, and all 27 European Union member states. [...."
  },
  {
    "title": "CTEM's Core: Prioritization and Validation",
    "link": "https://thehackernews.com/2025/09/ctems-core-prioritization-and-validation.html",
    "date": "2025-09-25T11:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Despite a coordinated investment of time, effort, planning, and resources, even the most up-to-date cybersecurity systems continue to fail. Every day. Why? \nIt’s not because security teams can't see e..."
  },
  {
    "title": "Tech Overtakes Gaming as Top DDoS Attack Target, New Gcore Radar Report Finds",
    "link": "https://thehackernews.com/2025/09/tech-overtakes-gaming-as-top-ddos.html",
    "date": "2025-09-25T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "The latest Gcore Radar report analyzing attack data from Q1–Q2 2025, reveals a 41% year-on-year increase in total attack volume. The largest attack peaked at 2.2 Tbps, surpassing the 2 Tbps record in ..."
  },
  {
    "title": "Malicious Rust Crates Steal Solana and Ethereum Keys — 8,424 Downloads Confirmed",
    "link": "https://thehackernews.com/2025/09/malicious-rust-crates-steal-solana-and.html",
    "date": "2025-09-25T07:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered two malicious Rust crates impersonating a legitimate library called fast_log to steal Solana and Ethereum wallet keys from source code.\nThe crates, named fast..."
  },
  {
    "title": "Cisco Warns of Actively Exploited SNMP Vulnerability Allowing RCE or DoS in IOS Software",
    "link": "https://thehackernews.com/2025/09/cisco-warns-of-actively-exploited-snmp.html",
    "date": "2025-09-25T06:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has warned of a high-severity security flaw in IOS Software and IOS XE Software that could allow a remote attacker to execute arbitrary code or trigger a denial-of-service (DoS) condition under ..."
  },
  {
    "title": "CISA: Attackers Breach Federal Agency via Critical GeoServer Flaw",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/cisa-attackers-breach-federal-agency-critical-geoserver-flaw",
    "date": "2025-09-24T21:20:37.000Z",
    "source": "Dark Reading",
    "summary": "Threat actors exploited CVE-2024-36401 less than two weeks after it was initially disclosed and used it to gain access to a large federal civilian executive branch (FCEB) agency that uses the geospati..."
  },
  {
    "title": "The Fall of Scattered Spider? Teen Member Surrenders Amid Group's Shutdown Claims",
    "link": "https://www.darkreading.com/cybersecurity-operations/scattered-spider-surrenders-shutdown",
    "date": "2025-09-24T20:21:31.000Z",
    "source": "Dark Reading",
    "summary": "The cybercrime group continues to gain attention despite its apparent shutdown last week...."
  },
  {
    "title": "New Supermicro BMC flaws can create persistent backdoors",
    "link": "https://www.bleepingcomputer.com/news/security/new-supermicro-bmc-flaws-can-create-persistent-backdoors/",
    "date": "2025-09-24T20:13:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Two vulnerabilities affecting the firmware of Supermicro hardware, including Baseboard Management Controller (BMC) allow attackers to update systems with maliciously crafted images. [...]..."
  },
  {
    "title": "OpenAI is testing a new GPT-5-based AI agent \"GPT-Alpha\"",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-testing-a-new-gpt-5-based-ai-agent-gpt-alpha/",
    "date": "2025-09-24T20:09:25.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is internally testing a new version of its AI agent, which uses a special version of GPT-5 dubbed \"GPT-Alpha.\" [...]..."
  },
  {
    "title": "Russia Targets Moldovan Election in Disinformation Play",
    "link": "https://www.darkreading.com/cybersecurity-operations/russia-moldovan-election-disinformation",
    "date": "2025-09-24T20:01:47.000Z",
    "source": "Dark Reading",
    "summary": "Researchers have tracked a Russian disinformation campaign against upcoming Moldovan elections, linking it to a previous campaign that began in 2022...."
  },
  {
    "title": "Kali Linux 2025.3 released with 10 new tools, Wi-Fi enhancements",
    "link": "https://www.bleepingcomputer.com/news/security/kali-linux-20253-released-with-10-new-tools-wifi-enhancements/",
    "date": "2025-09-24T18:30:02.000Z",
    "source": "Bleeping Computer",
    "summary": "Kali Linux has released version 2025.3, the third version of 2025, featuring ten new tools, Nexmon support, and NetHunter improvements. [...]..."
  },
  {
    "title": "Cisco warns of IOS zero-day vulnerability exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-ios-zero-day-vulnerability-exploited-in-attacks/",
    "date": "2025-09-24T16:52:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco has released security updates to address a high-severity zero-day vulnerability in Cisco IOS and IOS XE Software that is currently being exploited in attacks. [...]..."
  },
  {
    "title": "Chinese Hackers RedNovember Target Global Governments Using Pantegana and Cobalt Strike",
    "link": "https://thehackernews.com/2025/09/chinese-hackers-rednovember-target.html",
    "date": "2025-09-24T16:36:00.000Z",
    "source": "The Hacker News",
    "summary": "A suspected cyber espionage activity cluster that was previously found targeting global government and private sector organizations spanning Africa, Asia, North America, South America, and Oceania has..."
  },
  {
    "title": "UNC5221 Uses BRICKSTORM Backdoor to Infiltrate U.S. Legal and Technology Sectors",
    "link": "https://thehackernews.com/2025/09/unc5221-uses-brickstorm-backdoor-to.html",
    "date": "2025-09-24T14:33:00.000Z",
    "source": "The Hacker News",
    "summary": "Companies in the legal services, software-as-a-service (SaaS) providers, Business Process Outsourcers (BPOs), and technology sectors in the U.S. have been targeted by a suspected China-nexus cyber esp..."
  }
]