[
  {
    "title": "ThreatsDay Bulletin: GhostAd Drain, macOS Attacks, Proxy Botnets, Cloud Exploits, and 12+ Stories",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-ghostad-drain-macos.html",
    "date": "2026-01-01T15:52:00.000Z",
    "source": "The Hacker News",
    "summary": "The first ThreatsDay Bulletin of 2026 lands on a day that already feels symbolic — new year, new breaches, new tricks. If the past twelve months taught defenders anything, it’s that threat actors don’..."
  },
  {
    "title": "RondoDox Botnet Exploits Critical React2Shell Flaw to Hijack IoT Devices and Web Servers",
    "link": "https://thehackernews.com/2026/01/rondodox-botnet-exploits-critical.html",
    "date": "2026-01-01T09:19:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a persistent nine-month-long campaign that has targeted Internet of Things (IoT) devices and web applications to enroll them into a botnet known as ..."
  },
  {
    "title": "How To Browse Faster and Get More Done Using Adapt Browser",
    "link": "https://thehackernews.com/2026/01/how-to-browse-fast-using-a-lightweight-browser.html",
    "date": "2026-01-01T05:47:00.000Z",
    "source": "The Hacker News",
    "summary": "As web browsers evolve into all-purpose platforms, performance and productivity often suffer. \nFeature overload, excessive background processes, and fragmented workflows can slow down browsing session..."
  },
  {
    "title": "NYC mayoral inauguration bans Flipper Zero, Raspberry Pi devices ",
    "link": "https://www.bleepingcomputer.com/news/security/nyc-mayoral-inauguration-bans-flipper-zero-raspberry-pi-devices/",
    "date": "2025-12-31T22:52:44.000Z",
    "source": "Bleeping Computer",
    "summary": "New York City's 2026 mayoral inauguration of Zohran Mamdani has published a list of banned items for the event, specifically prohibiting the Flipper Zero and Raspberry Pi devices. [...]..."
  },
  {
    "title": "Sunken Ships: Will Orgs Learn From Ivanti EPMM Attacks?",
    "link": "https://www.darkreading.com/cyber-risk/sunken-ships-ivanti-epmm-attacks",
    "date": "2025-12-31T17:35:27.000Z",
    "source": "Dark Reading",
    "summary": "The April/May zero-day exploitations of Ivanti's mobile device management platform meant unprecedented pwning of thousands of orgs by a Chinese APT — and history will probably repeat itself...."
  },
  {
    "title": "Trust Wallet Chrome Extension Hack Drains $8.5M via Shai-Hulud Supply Chain Attack",
    "link": "https://thehackernews.com/2025/12/trust-wallet-chrome-extension-hack.html",
    "date": "2025-12-31T16:29:00.000Z",
    "source": "The Hacker News",
    "summary": "Trust Wallet on Tuesday revealed that the second iteration of the Shai-Hulud (aka Sha1-Hulud) supply chain outbreak in November 2025 was likely responsible for the hack of its Google Chrome extension,..."
  },
  {
    "title": "DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide",
    "link": "https://thehackernews.com/2025/12/darkspectre-browser-extension-campaigns.html",
    "date": "2025-12-31T16:14:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor behind two malicious browser extension campaigns, ShadyPanda and GhostPoster, has been attributed to a third attack campaign codenamed DarkSpectre that has impacted 2.2 million users ..."
  },
  {
    "title": "Hackers drain $3.9M from Unleash Protocol after multisig hijack",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-drain-39m-from-unleash-protocol-after-multisig-hijack/",
    "date": "2025-12-31T15:54:17.000Z",
    "source": "Bleeping Computer",
    "summary": "The decentralized intellectual property platform Unleash Protocol has lost around $3.9 million worth of cryptocurrency after someone executed an unauthorized contract upgrade that allowed asset withdr..."
  },
  {
    "title": "RondoDox botnet exploits React2Shell flaw to breach Next.js servers",
    "link": "https://www.bleepingcomputer.com/news/security/rondodox-botnet-exploits-react2shell-flaw-to-breach-nextjs-servers/",
    "date": "2025-12-31T14:58:51.000Z",
    "source": "Bleeping Computer",
    "summary": "The RondoDox botnet has been observed exploiting the critical React2Shell flaw (CVE-2025-55182) to infect vulnerable Next.js servers with malware and cryptominers. [...]..."
  },
  {
    "title": "When the Cloud Rains on Everyone's IoT Parade",
    "link": "https://www.darkreading.com/iot/when-cloud-rains-on-everyone-iot-parade",
    "date": "2025-12-31T14:31:37.000Z",
    "source": "Dark Reading",
    "summary": "What happens to all of those always-connected devices when the cloud goes down? Disruptions to sleep, school, and smart homes, just to name a few issues...."
  },
  {
    "title": "Identity Security 2026: Four Predictions &amp; Recommendations",
    "link": "https://www.darkreading.com/identity-access-management-security/identity-security-2026-predictions-and-recommendations",
    "date": "2025-12-31T14:00:58.000Z",
    "source": "Dark Reading",
    "summary": "Agentic AI adoption and identity security risks, IGA expands in mid-market, SOC-identity team collaboration, and identity platform consolidation—this 2026 predictions post previews identity trends...."
  },
  {
    "title": "Contrarians No More: AI Skepticism Is on the Rise",
    "link": "https://www.darkreading.com/cybersecurity-operations/contrarians-no-more-ai-skepticism",
    "date": "2025-12-31T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Concerns about an economic bubble bursting, along with doubts regarding return on investment, suggest the tide may be turning for the artificial intelligence industry...."
  },
  {
    "title": "Critical CVSS 9.8 Flaw Found in IBM API Connect Authentication System",
    "link": "https://thehackernews.com/2025/12/ibm-warns-of-critical-api-connect-bug.html",
    "date": "2025-12-31T13:37:00.000Z",
    "source": "The Hacker News",
    "summary": "IBM has disclosed details of a critical security flaw in API Connect that could allow attackers to gain remote access to the application.\nThe vulnerability, tracked as CVE-2025-13915, is rated 9.8 out..."
  },
  {
    "title": "Researchers Spot Modified Shai-Hulud Worm Testing Payload on npm Registry",
    "link": "https://thehackernews.com/2025/12/researchers-spot-modified-shai-hulud.html",
    "date": "2025-12-31T13:29:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of what appears to be a new strain of Shai Hulud on the npm registry with slight modifications from the previous wave observed last month.\nThe npm pack..."
  },
  {
    "title": "IBM warns of critical API Connect auth bypass vulnerability",
    "link": "https://www.bleepingcomputer.com/news/security/ibm-warns-of-critical-api-connect-auth-bypass-vulnerability/",
    "date": "2025-12-31T10:34:38.000Z",
    "source": "Bleeping Computer",
    "summary": "IBM urged customers to patch a critical authentication bypass vulnerability in its API Connect enterprise platform that could allow attackers to access apps remotely. [...]..."
  },
  {
    "title": "Disney will pay $10 million to settle children's data privacy lawsuit",
    "link": "https://www.bleepingcomputer.com/news/security/disney-will-pay-10m-to-settle-claims-of-childrens-privacy-violations-on-youtube/",
    "date": "2025-12-31T09:43:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Disney has agreed to pay a $10 million civil penalty to settle claims that it violated the Children's Online Privacy Protection Act by mislabeling videos and allowing data collection for targeted adve..."
  },
  {
    "title": "U.S. Treasury Lifts Sanctions on Three Individuals Linked to Intellexa and Predator Spyware",
    "link": "https://thehackernews.com/2025/12/us-treasury-lifts-sanctions-on-three.html",
    "date": "2025-12-31T05:17:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) on Tuesday removed three individuals linked to the Intellexa Consortium, the holding company behind a commercial spyware k..."
  },
  {
    "title": "New ErrTraffic service enables ClickFix attacks via fake browser glitches",
    "link": "https://www.bleepingcomputer.com/news/security/new-errtraffic-service-enables-clickfix-attacks-via-fake-browser-glitches/",
    "date": "2025-12-30T21:08:28.000Z",
    "source": "Bleeping Computer",
    "summary": "A new cybercrime tool called ErrTraffic allows threat actors to automate ClickFix attacks by generating 'fake glitches' on compromised websites to lure users into downloading payloads or following mal..."
  },
  {
    "title": "CSA Issues Alert on Critical SmarterMail Bug Allowing Remote Code Execution",
    "link": "https://thehackernews.com/2025/12/csa-issues-alert-on-critical.html",
    "date": "2025-12-30T16:28:00.000Z",
    "source": "The Hacker News",
    "summary": "The Cyber Security Agency of Singapore (CSA) has issued a bulletin warning of a maximum-severity security flaw in SmarterTools SmarterMail email software that could be exploited to achieve remote code..."
  },
  {
    "title": "European Space Agency confirms breach of \"external servers\"",
    "link": "https://www.bleepingcomputer.com/news/security/european-space-agency-confirms-breach-of-external-servers/",
    "date": "2025-12-30T16:26:56.000Z",
    "source": "Bleeping Computer",
    "summary": "The European Space Agency (ESA) confirmed that attackers recently breached servers outside its corporate network, which contained what it described as \"unclassified\" information on collaborative engin..."
  },
  {
    "title": "Zoom Stealer browser extensions harvest corporate meeting intelligence",
    "link": "https://www.bleepingcomputer.com/news/security/zoom-stealer-browser-extensions-harvest-corporate-meeting-intelligence/",
    "date": "2025-12-30T15:41:53.000Z",
    "source": "Bleeping Computer",
    "summary": "A newly discovered campaign, which researchers call Zoom Stealer, is affecting 2.2 million Chrome, Firefox, and Microsoft Edge users through 18 extensions that collect online meeting-related data like..."
  },
  {
    "title": "US cybersecurity experts plead guilty to BlackCat ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/us-cybersecurity-experts-plead-guilty-to-blackcat-alphv-ransomware-attacks/",
    "date": "2025-12-30T15:25:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Two former employees of cybersecurity incident response companies Sygnia and DigitalMint have pleaded guilty to targeting U.S. companies in BlackCat (ALPHV) ransomware attacks in 2023. [...]..."
  },
  {
    "title": "CISA orders feds to patch MongoBleed flaw exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-federal-agencies-to-patch-mongobleed-flaw-actively-exploited-in-attacks/",
    "date": "2025-12-30T14:40:13.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA ordered U.S. federal agencies to patch an actively exploited MongoDB vulnerability (MongoBleed) that can be exploited to steal credentials, API keys, and other sensitive data. [...]..."
  },
  {
    "title": "Cybersecurity Predictions 2026: An AI Arms Race and Malware Autonomy",
    "link": "https://www.darkreading.com/cyber-risk/cybersecurity-predictions-2026-an-ai-arms-race-and-malware-autonomy",
    "date": "2025-12-30T14:00:25.000Z",
    "source": "Dark Reading",
    "summary": "The year ahead will see an intensified AI-driven cybersecurity arms race, with attackers leveraging autonomous malware and advanced AI technologies to outpace defenders, while security teams adopt inc..."
  },
  {
    "title": "New Tech Deployments That Cyber Insurers Recommend for 2026",
    "link": "https://www.darkreading.com/cyber-risk/cybersecurity-tech-recommended-by-cyber-insurer-claims-data",
    "date": "2025-12-30T13:56:23.000Z",
    "source": "Dark Reading",
    "summary": "An analysis of cyber-insurance claims data shows which cyber defenses actually work for policyholders. Here are six technologies that will pay off for companies in 2026...."
  },
  {
    "title": "Silver Fox Targets Indian Users With Tax-Themed Emails Delivering ValleyRAT Malware",
    "link": "https://thehackernews.com/2025/12/silver-fox-targets-indian-users-with.html",
    "date": "2025-12-30T10:46:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Silver Fox has turned its focus to India, using income tax-themed lures in phishing campaigns to distribute a modular remote access trojan called ValleyRAT (aka Winos 4.0).\n\"..."
  },
  {
    "title": "How to Integrate AI into Modern SOC Workflows",
    "link": "https://thehackernews.com/2025/12/how-to-integrate-ai-into-modern-soc.html",
    "date": "2025-12-30T09:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence (AI) is making its way into security operations quickly, but many practitioners are still struggling to turn early experimentation into consistent operational value. This is be..."
  },
  {
    "title": "Mustang Panda Uses Signed Kernel-Mode Rootkit to Load TONESHELL Backdoor",
    "link": "https://thehackernews.com/2025/12/mustang-panda-uses-signed-kernel-driver.html",
    "date": "2025-12-30T08:35:00.000Z",
    "source": "The Hacker News",
    "summary": "The Chinese hacking group known as Mustang Panda has leveraged a previously undocumented kernel-mode rootkit driver to deliver a new variant of backdoor dubbed TONESHELL in a cyber attack detected in ..."
  },
  {
    "title": "Chinese state hackers use rootkit to hide ToneShell malware activity",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-state-hackers-use-rootkit-to-hide-toneshell-malware-activity/",
    "date": "2025-12-30T00:08:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A new sample of the ToneShell backdoor, typically seen in Chinese cyberespionage campaigns, has been delivered through a kernel-mode loader in attacks against government organizations. [...]..."
  },
  {
    "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
    "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
    "date": "2025-12-29T20:23:26.000Z",
    "source": "Krebs on Security",
    "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been t..."
  }
]