[
  {
    "title": "[Virtual Event] Shields Up: Key Technologies Reshaping Cybersecurity Defenses",
    "link": "https://www.darkreading.com/events/shields-up-key-technologies-reshaping-cybersecurity-defenses",
    "date": "2026-02-21T09:11:40.273Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Anthropic Launches Claude Code Security for AI-Powered Vulnerability Scanning",
    "link": "https://thehackernews.com/2026/02/anthropic-launches-claude-code-security.html",
    "date": "2026-02-21T07:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence (AI) company Anthropic has begun to roll out a new security feature for Claude Code that can scan a user's software codebase for vulnerabilities and suggest patches.\nThe capabi..."
  },
  {
    "title": "CISA Adds Two Actively Exploited Roundcube Flaws to KEV Catalog",
    "link": "https://thehackernews.com/2026/02/cisa-adds-two-actively-exploited.html",
    "date": "2026-02-21T07:21:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added two security flaws impacting Roundcube webmail software to its Known Exploited Vulnerabilities (KEV) catalog, citing ev..."
  },
  {
    "title": "EC-Council Expands AI Certification Portfolio to Strengthen U.S. AI Workforce Readiness and Security",
    "link": "https://thehackernews.com/2026/02/ec-council-expands-ai-certification.html",
    "date": "2026-02-21T04:30:00.000Z",
    "source": "The Hacker News",
    "summary": "With $5.5 trillion in global AI risk exposure and 700,000 U.S. workers needing reskilling, four new AI certifications and Certified CISO v4 help close the gap between AI adoption and workforce readine..."
  },
  {
    "title": "Attackers Use New Tool to Scan for React2Shell Exposure",
    "link": "https://www.darkreading.com/application-security/attackers-new-tool-scan-react2shell-exposure",
    "date": "2026-02-20T21:07:07.000Z",
    "source": "Dark Reading",
    "summary": "Researchers say threat actors wielded the sophisticated — and unfortunately named — toolkit to target high-value networks for React2Shell exploitation...."
  },
  {
    "title": "‘Starkiller’ Phishing Service Proxies Real Login Pages, MFA",
    "link": "https://krebsonsecurity.com/2026/02/starkiller-phishing-service-proxies-real-login-pages-mfa/",
    "date": "2026-02-20T20:00:30.000Z",
    "source": "Krebs on Security",
    "summary": "Most phishing websites are little more than static copies of login pages for popular online destinations, and they are often quickly taken down by anti-abuse activists and security firms. But a stealt..."
  },
  {
    "title": "'God-Like' Attack Machines: AI Agents Ignore Security Policies",
    "link": "https://www.darkreading.com/application-security/ai-agents-ignore-security-policies",
    "date": "2026-02-20T18:31:58.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft Copilot recently summarized and leaked user emails; but any AI agent will go above and beyond to complete assigned tasks, even breaking through their carefully designed guardrails...."
  },
  {
    "title": "Japanese tech giant Advantest hit by ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/japanese-tech-giant-advantest-hit-by-ransomware-attack/",
    "date": "2026-02-20T18:30:44.000Z",
    "source": "Bleeping Computer",
    "summary": "Advantest Corporation disclosed that its corporate network has been targeted in a ransomware attack that may have affected customer or employee data. [...]..."
  },
  {
    "title": "Lessons From AI Hacking: Every Model, Every Layer Is Risky",
    "link": "https://www.darkreading.com/application-security/lessons-ai-hacking-model-every-layer-risky",
    "date": "2026-02-20T18:02:02.000Z",
    "source": "Dark Reading",
    "summary": "After two years of finding flaws in AI infrastructure, two Wiz researchers advise security pros to worry less about prompt injection and more about vulnerabilities...."
  },
  {
    "title": "CISA: BeyondTrust RCE flaw now exploited in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-beyondtrust-rce-flaw-now-exploited-in-ransomware-attacks/",
    "date": "2026-02-20T17:02:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are actively exploiting the CVE-2026-1731 vulnerability in the BeyondTrust Remote Support product, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) warns. [...]..."
  },
  {
    "title": "Data breach at French bank registry impacts 1.2 million accounts",
    "link": "https://www.bleepingcomputer.com/news/security/data-breach-at-french-bank-registry-impacts-12-million-accounts/",
    "date": "2026-02-20T16:20:40.000Z",
    "source": "Bleeping Computer",
    "summary": "The French Ministry of Finance has published an announcement informing of a cybersecurity incident that has impacted 1.2 million accounts. [...]..."
  },
  {
    "title": "BeyondTrust Flaw Used for Web Shells, Backdoors, and Data Exfiltration",
    "link": "https://thehackernews.com/2026/02/beyondtrust-flaw-used-for-web-shells.html",
    "date": "2026-02-20T15:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed exploiting a recently disclosed critical security flaw impacting BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) products to conduct a wide range of..."
  },
  {
    "title": "Why the shift left dream has become a nightmare for security and developers",
    "link": "https://www.bleepingcomputer.com/news/security/why-the-shift-left-dream-has-become-a-nightmare-for-security-and-developers/",
    "date": "2026-02-20T14:45:54.000Z",
    "source": "Bleeping Computer",
    "summary": "The \"shift left\" approach has increased pressure on developers, as speed demands override security checks in modern CI pipelines. Qualys explains how analyzing 34,000 public container images revealed ..."
  },
  {
    "title": "Cline CLI 2.3.0 Supply Chain Attack Installed OpenClaw on Developer Systems",
    "link": "https://thehackernews.com/2026/02/cline-cli-230-supply-chain-attack.html",
    "date": "2026-02-20T14:20:00.000Z",
    "source": "The Hacker News",
    "summary": "In yet another software supply chain attack, the open-source, artificial intelligence (AI)-powered coding assistant Cline CLI was updated to stealthily install OpenClaw, a self-hosted autonomous AI ag..."
  },
  {
    "title": "Latin America's Cyber Maturity Lags Threat Landscape",
    "link": "https://www.darkreading.com/threat-intelligence/latin-americas-cyber-maturity-lags-threat-landscape",
    "date": "2026-02-20T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The slower pace of upgrades has the unintended impact of creating a haven for attackers, especially for initial access brokers and ransomware gangs...."
  },
  {
    "title": "PayPal discloses data breach that exposed user info for 6 months",
    "link": "https://www.bleepingcomputer.com/news/security/paypal-discloses-data-breach-exposing-users-personal-information/",
    "date": "2026-02-20T13:12:01.000Z",
    "source": "Bleeping Computer",
    "summary": "PayPal is notifying customers of a data breach after a software error in a loan application exposed their sensitive personal information, including Social Security numbers, for nearly 6 months last ye..."
  },
  {
    "title": "ClickFix Campaign Abuses Compromised Sites to Deploy MIMICRAT Malware",
    "link": "https://thehackernews.com/2026/02/clickfix-campaign-abuses-compromised.html",
    "date": "2026-02-20T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new ClickFix campaign that abuses compromised legitimate sites to deliver a previously undocumented remote access trojan (RAT) called MIMICRAT (ak..."
  },
  {
    "title": "Mississippi medical center closes all clinics after ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-mississippi-medical-center-closes-clinics-after-ransomware-attack/",
    "date": "2026-02-20T11:50:14.000Z",
    "source": "Bleeping Computer",
    "summary": "The University of Mississippi Medical Center (UMMC) closed all its clinic locations statewide on Thursday following a ransomware attack. [...]..."
  },
  {
    "title": "Identity Cyber Scores: The New Metric Shaping Cyber Insurance in 2026",
    "link": "https://thehackernews.com/2026/02/identity-cyber-scores-new-metric.html",
    "date": "2026-02-20T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "With one in three cyber-attacks now involving compromised employee accounts, insurers and regulators are placing far greater emphasis on identity posture when assessing cyber risk. \nFor many organizat..."
  },
  {
    "title": "FBI: Over $20 million stolen in surge of ATM malware attacks in 2025",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-over-20-million-stolen-in-surge-of-atm-malware-attacks-in-2025/",
    "date": "2026-02-20T10:08:49.000Z",
    "source": "Bleeping Computer",
    "summary": "The FBI warned that Americans lost more than $20 million last year amid a massive surge in ATM \"jackpotting\" attacks, in which criminals use malware to force cash machines to dispense money. [...]..."
  },
  {
    "title": "Ukrainian National Sentenced to 5 Years in North Korea IT Worker Fraud Case",
    "link": "https://thehackernews.com/2026/02/ukrainian-national-sentenced-to-5-years.html",
    "date": "2026-02-20T09:52:00.000Z",
    "source": "The Hacker News",
    "summary": "A 29-year-old Ukrainian national has been sentenced to five years in prison in the U.S. for his role in facilitating North Korea's fraudulent information technology (IT) worker scheme.\nIn November 202..."
  },
  {
    "title": "Ukrainian gets 5 years for helping North Koreans infiltrate US firms",
    "link": "https://www.bleepingcomputer.com/news/security/ukrainian-gets-5-years-for-helping-north-koreans-infiltrate-us-firms/",
    "date": "2026-02-20T09:00:15.000Z",
    "source": "Bleeping Computer",
    "summary": "A Ukrainian national was sentenced to five years in prison for providing North Korean IT workers with stolen identities that helped them infiltrate U.S. companies. [...]..."
  },
  {
    "title": "FBI Reports 1,900 ATM Jackpotting Incidents Since 2020, $20M Lost in 2025",
    "link": "https://thehackernews.com/2026/02/fbi-reports-1900-atm-jackpotting.html",
    "date": "2026-02-20T08:05:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Federal Bureau of Investigation (FBI) has warned of an increase in ATM jackpotting incidents across the country, leading to losses of more than $20 million in 2025.\nThe agency said 1,900 ATM ..."
  },
  {
    "title": "Former Google Engineers Indicted Over Trade Secret Transfers to Iran",
    "link": "https://thehackernews.com/2026/02/three-former-google-engineers-indicted.html",
    "date": "2026-02-20T05:27:00.000Z",
    "source": "The Hacker News",
    "summary": "Two former Google engineers and one of their husbands have been indicted in the U.S. for allegedly committing trade secret theft from the search giant and other tech firms and transferring the informa..."
  },
  {
    "title": "Emerging Chiplet Designs Spark Fresh Cybersecurity Challenges",
    "link": "https://www.darkreading.com/cyber-risk/emerging-chiplet-designs-spark-fresh-cybersecurity-challenges",
    "date": "2026-02-19T23:17:19.000Z",
    "source": "Dark Reading",
    "summary": "As scaled-down circuits with limited functions redefine computing for AI systems and autonomous vehicles, their flexibility demands new approaches to safeguard critical infrastructure...."
  },
  {
    "title": "PromptSpy is the first known Android malware to use generative AI at runtime",
    "link": "https://www.bleepingcomputer.com/news/security/promptspy-is-the-first-known-android-malware-to-use-generative-ai-at-runtime/",
    "date": "2026-02-19T22:36:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Researchers have discovered the first known Android malware to use generative AI in its execution flow, using Google's Gemini model to adapt its persistence across different devices. [...]..."
  },
  {
    "title": "Supply Chain Attack Secretly Installs OpenClaw for Cline Users",
    "link": "https://www.darkreading.com/application-security/supply-chain-attack-openclaw-cline-users",
    "date": "2026-02-19T22:33:59.000Z",
    "source": "Dark Reading",
    "summary": "The malicious version of Cline's npm package — 2.3.0 — was downloaded more than 4,000 times before it was removed...."
  },
  {
    "title": "Best-in-Class 'Starkiller' Phishing Kit Bypasses MFA",
    "link": "https://www.darkreading.com/threat-intelligence/starkiller-phishing-kit-mfa",
    "date": "2026-02-19T22:06:58.000Z",
    "source": "Dark Reading",
    "summary": "A user-friendly PhaaS tool beats standard methods for detecting phishing attacks by live-proxying legitimate login sites...."
  },
  {
    "title": "Abu Dhabi Finance Week Exposed VIP Passport Details",
    "link": "https://www.darkreading.com/cyber-risk/abu-dhabi-finance-week-leaked-vip-passport-details",
    "date": "2026-02-19T20:50:14.000Z",
    "source": "Dark Reading",
    "summary": "Unprotected cloud data sends the wrong signal at a time when the emirate's trying to attract investors and establish itself as a global financial center...."
  },
  {
    "title": "PromptSpy Android Malware Abuses Gemini AI to Automate Recent-Apps Persistence",
    "link": "https://thehackernews.com/2026/02/promptspy-android-malware-abuses-google.html",
    "date": "2026-02-19T17:52:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered what they say is the first Android malware that abuses Gemini, Google's generative artificial intelligence (AI) chatbot, as part of its execution flow and ach..."
  }
]