[
  {
    "title": "Aisuru Botnet Shifts from DDoS to Residential Proxies",
    "link": "https://krebsonsecurity.com/2025/10/aisuru-botnet-shifts-from-ddos-to-residential-proxies/",
    "date": "2025-10-29T00:51:05.000Z",
    "source": "Krebs on Security",
    "summary": "Aisuru, the botnet responsible for a series of record-smashing distributed denial-of-service (DDoS) attacks this year, recently was overhauled to support a more low-key, lucrative and sustainable busi..."
  },
  {
    "title": "Windows 11 KB5067036 update rolls out Administrator Protection feature",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5067036-update-rolls-out-administrator-protection-feature/",
    "date": "2025-10-28T23:31:28.000Z",
    "source": "Bleeping Computer",
    "summary": "​​Microsoft has released the KB5067036 preview cumulative update for Windows 11 24H2 and 25H2, which begins the rollout of the Administrator Protection cybersecurity feature and an updated Start Menu...."
  },
  {
    "title": "Python rejects $1.5M grant from U.S. govt. fearing ethical compromise",
    "link": "https://www.bleepingcomputer.com/news/software/python-rejects-15m-grant-from-us-govt-fearing-ethical-compromise/",
    "date": "2025-10-28T22:16:37.000Z",
    "source": "Bleeping Computer",
    "summary": "The Python Software Foundation (PSF) has withdrawn its $1.5 million grant proposal to the U.S. National Science Foundation (NSF) due to funding terms forcing a compromise on its commitment to diversit..."
  },
  {
    "title": "Advertising giant Dentsu reports data breach at subsidiary Merkle",
    "link": "https://www.bleepingcomputer.com/news/security/advertising-giant-dentsu-reports-data-breach-at-subsidiary-merkle/",
    "date": "2025-10-28T21:16:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Japanese advertising giant Dentsu has disclosed that its U.S.-based subsidiary Merkle suffered a cybersecurity incident  that exposed staff and client data. [...]..."
  },
  {
    "title": "From Chef to CISO: An Empathy-First Approach to Cybersecurity Leadership",
    "link": "https://www.darkreading.com/cybersecurity-operations/chef-ciso-empathy-first-cybersecurity-leadership",
    "date": "2025-10-28T20:51:11.000Z",
    "source": "Dark Reading",
    "summary": "Myke Lyons, CISO at data-processing SaaS company Cribl, shares how he cooked up an unconventional journey from culinary school to cybersecurity leadership...."
  },
  {
    "title": "YouTube Ghost Network Utilizes Spooky Tactics to Target Users",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/youtube-ghost-network-target-users",
    "date": "2025-10-28T20:22:39.000Z",
    "source": "Dark Reading",
    "summary": "The malware operation uses compromised accounts and bot networks to distribute infostealers and has tripled its output in 2025...."
  },
  {
    "title": "Oracle EBS Attack Victims May Be More Numerous Than Expected",
    "link": "https://www.darkreading.com/vulnerabilities-threats/oracle-ebs-attack-victims-more-numerous-expected",
    "date": "2025-10-28T20:08:01.000Z",
    "source": "Dark Reading",
    "summary": "Numerous organizations have been attacked via Oracle EBS zero-day CVE-2025-61882, and evidence suggests more like Schneider Electric could be on that list...."
  },
  {
    "title": "New TEE.Fail Side-Channel Attack Extracts Secrets from Intel and AMD DDR5 Secure Enclaves",
    "link": "https://thehackernews.com/2025/10/new-teefail-side-channel-attack.html",
    "date": "2025-10-28T19:16:00.000Z",
    "source": "The Hacker News",
    "summary": "A group of academic researchers from Georgia Tech, Purdue University, and Synkhronix have developed a side-channel attack called TEE.Fail that allows for the extraction of secrets from the trusted exe..."
  },
  {
    "title": "Qilin ransomware abuses WSL to run Linux encryptors in Windows",
    "link": "https://www.bleepingcomputer.com/news/security/qilin-ransomware-abuses-wsl-to-run-linux-encryptors-in-windows/",
    "date": "2025-10-28T19:11:33.000Z",
    "source": "Bleeping Computer",
    "summary": "The Qilin ransomware operation was spotted executing Linux encryptors in Windows using Windows Subsystem for Linux (WSL) to evade detection by traditional security tools. [...]..."
  },
  {
    "title": "CISA warns of two more actively exploited Dassault vulnerabilities",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-two-more-actively-exploited-dassault-vulnerabilities/",
    "date": "2025-10-28T18:59:49.000Z",
    "source": "Bleeping Computer",
    "summary": "The Cybersecurity & Infrastructure Security Agency (CISA) warned today that attackers are actively exploiting two vulnerabilities in Dassault Systèmes' DELMIA Apriso, a manufacturing operations manage..."
  },
  {
    "title": "Microsoft: Copilot now lets you build apps, automate workflows",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-copilot-now-lets-you-build-apps-automate-workflows/",
    "date": "2025-10-28T17:59:18.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft announced today a new Microsoft 365 Copilot agent called App Builder that can help users create and deploy apps \"in minutes.\" [...]..."
  },
  {
    "title": "Microsoft sued for allegedly tricking millions into Copilot M365 subscriptions",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-sued-for-allegedly-tricking-millions-into-copilot-m365-subscriptions/",
    "date": "2025-10-28T17:59:05.000Z",
    "source": "Bleeping Computer",
    "summary": "The Australian Competition and Consumer Commission (ACCC) is suing Microsoft for allegedly misleading 2.7 million Australians into paying for the Copilot AI assistant in the Microsoft 365 service. [....."
  },
  {
    "title": "TEE.Fail attack breaks confidential computing on Intel, AMD, NVIDIA CPUs",
    "link": "https://www.bleepingcomputer.com/news/security/teefail-attack-breaks-confidential-computing-on-intel-amd-nvidia-cpus/",
    "date": "2025-10-28T17:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Academic researchers developed a side-channel attack called TEE.Fail, which allows extracting secrets from the trusted execution environment in the CPU, the highly secure area of a system, such as Int..."
  },
  {
    "title": "Google Chrome to warn users before opening insecure HTTP sites",
    "link": "https://www.bleepingcomputer.com/news/google/google-chrome-to-warn-users-before-opening-insecure-http-sites/",
    "date": "2025-10-28T17:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google announced today that the Chrome web browser will ask for permission by default before connecting to public, insecure HTTP websites, beginning with Chrome 154 in October 2026. [...]..."
  },
  {
    "title": "New Android Trojan 'Herodotus' Outsmarts Anti-Fraud Systems by Typing Like a Human",
    "link": "https://thehackernews.com/2025/10/new-android-trojan-herodotus-outsmarts.html",
    "date": "2025-10-28T16:33:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new Android banking trojan called Herodotus that has been observed in active campaigns targeting Italy and Brazil to conduct device takeover (DTO)..."
  },
  {
    "title": "Researchers Expose GhostCall and GhostHire: BlueNoroff's New Malware Chains",
    "link": "https://thehackernews.com/2025/10/researchers-expose-ghostcall-and.html",
    "date": "2025-10-28T16:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors tied to North Korea have been observed targeting the Web3 and blockchain sectors as part of twin campaigns tracked as GhostCall and GhostHire.\nAccording to Kaspersky, the campaigns are p..."
  },
  {
    "title": "North Korea's BlueNoroff Expands Scope of Crypto Heists",
    "link": "https://www.darkreading.com/threat-intelligence/north-korea-bluenoroff-expands-crypto-heists",
    "date": "2025-10-28T16:10:39.000Z",
    "source": "Dark Reading",
    "summary": "Two campaigns targeting fintech execs and Web3 developers show the APT going cross-platform in financially motivated campaigns that use fake business collaboration and job recruitment lures...."
  },
  {
    "title": "BiDi Swap: The bidirectional text trick that makes fake URLs look real",
    "link": "https://www.bleepingcomputer.com/news/security/bidi-swap-the-bidirectional-text-trick-that-makes-fake-urls-look-real/",
    "date": "2025-10-28T14:05:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers are abusing bidirectional text to make fake URLs look real, reviving a decade-old browser flaw now fueling new phishing tricks. Varonis reveals how the \"BiDi Swap\" technique works and what o..."
  },
  {
    "title": "New Atroposia malware comes with a local vulnerability scanner",
    "link": "https://www.bleepingcomputer.com/news/security/new-atroposia-malware-comes-with-a-local-vulnerability-scanner/",
    "date": "2025-10-28T13:15:11.000Z",
    "source": "Bleeping Computer",
    "summary": "A new malware-as-a-service (MaaS) platform named Atroposia provides cybercriminals a remote access trojan that combines capabilities for persistent access, evasion, data theft, and local vulnerability..."
  },
  {
    "title": "Why Early Threat Detection Is a Must for Long-Term Business Growth",
    "link": "https://thehackernews.com/2025/10/why-early-threat-detection-is-must-for.html",
    "date": "2025-10-28T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "In cybersecurity, speed isn’t just a win — it’s a multiplier. The faster you learn about emerging threats, the faster you adapt your defenses, the less damage you suffer, and the more confidently your..."
  },
  {
    "title": "Is Your Google Workspace as Secure as You Think it is?",
    "link": "https://thehackernews.com/2025/10/is-your-google-workspace-as-secure-as.html",
    "date": "2025-10-28T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "The New Reality for Lean Security Teams\nIf you’re the first security or IT hire at a fast-growing startup, you’ve likely inherited a mandate that’s both simple and maddeningly complex: secure the busi..."
  },
  {
    "title": "New Herodotus Android malware fakes human typing to avoid detection",
    "link": "https://www.bleepingcomputer.com/news/security/new-herodotus-android-malware-fakes-human-typing-to-avoid-detection/",
    "date": "2025-10-28T10:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A new Android malware family, Herodotus, uses random delay injection in its input routines to mimic human behavior on mobile devices and evade timing-based detection by security software. [...]..."
  },
  {
    "title": "Chrome Zero-Day Exploited to Deliver Italian Memento Labs' LeetAgent Spyware",
    "link": "https://thehackernews.com/2025/10/chrome-zero-day-exploited-to-deliver.html",
    "date": "2025-10-28T08:22:00.000Z",
    "source": "The Hacker News",
    "summary": "The zero-day exploitation of a now-patched security flaw in Google Chrome led to the distribution of an espionage-related tool from Italian information technology and services provider Memento Labs, a..."
  },
  {
    "title": "SideWinder Adopts New ClickOnce-Based Attack Chain Targeting South Asian Diplomats",
    "link": "https://thehackernews.com/2025/10/sidewinder-adopts-new-clickonce-based.html",
    "date": "2025-10-28T04:01:00.000Z",
    "source": "The Hacker News",
    "summary": "A European embassy located in the Indian capital of New Delhi, as well as multiple organizations in Sri Lanka, Pakistan, and Bangladesh, have emerged as the target of a new campaign orchestrated by a ..."
  },
  {
    "title": "'Jingle Thief' Highlights Retail Cyber Threats",
    "link": "https://www.darkreading.com/cyber-risk/jingle-thief-highlights-retail-cyber-threats",
    "date": "2025-10-27T21:10:10.000Z",
    "source": "Dark Reading",
    "summary": "A Morocco-based gift card fraud campaign is a sign of what retailers can expect this holiday season...."
  },
  {
    "title": "Google disputes false claims of massive Gmail data breach",
    "link": "https://www.bleepingcomputer.com/news/security/google-disputes-false-claims-of-massive-gmail-data-breach/",
    "date": "2025-10-27T20:32:01.000Z",
    "source": "Bleeping Computer",
    "summary": "Google was once again forced to announce that it had not suffered a data breach after numerous news outlets published sensational stories about a fake breach that purportedly exposed 183 million accou..."
  },
  {
    "title": "Memento Spyware Tied to Chrome Zero-Day Attacks",
    "link": "https://www.darkreading.com/vulnerabilities-threats/memento-spyware-chrome-zero-day-attacks",
    "date": "2025-10-27T20:02:02.000Z",
    "source": "Dark Reading",
    "summary": "While investigating the cyberattacks, researchers uncovered a new spyware product from Memento Labs, the successor to the infamous Hacking Team...."
  },
  {
    "title": "CISOs Finally Get a Seat at the Board's Table — But There's a Catch",
    "link": "https://www.darkreading.com/cybersecurity-operations/cisos-finally-get-seat-board-table",
    "date": "2025-10-27T19:30:08.000Z",
    "source": "Dark Reading",
    "summary": "AI's explosive growth has lifted cybersecurity to the top of the board's agenda. Here's how CISOs can seize the moment, according to Diana Kelley...."
  },
  {
    "title": "Attackers Sell Turnkey Remote Access Trojan 'Atroposia'",
    "link": "https://www.darkreading.com/vulnerabilities-threats/attackers-sell-turnkey-remote-access-trojan-atroposia",
    "date": "2025-10-27T19:10:22.000Z",
    "source": "Dark Reading",
    "summary": "Atroposia, a new RAT malware, offers low-level cybercriminal affiliates the ability to utilize sophisticated stealth and persistence capabilities...."
  },
  {
    "title": "X Warns Users With Security Keys to Re-Enroll Before November 10 to Avoid Lockouts",
    "link": "https://thehackernews.com/2025/10/x-warns-users-with-security-keys-to-re.html",
    "date": "2025-10-27T16:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Social media platform X is urging users who have enrolled for two-factor authentication (2FA) using passkeys and hardware security keys like Yubikeys to re-enroll their key to ensure continued access ..."
  }
]