[
  {
    "title": "OpenAI's ChatGPT-powered browser is codenamed 'Aura'",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-chatgpt-powered-browser-is-codenamed-aura/",
    "date": "2025-07-15T11:30:21.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is following Perplexity and is working on its own AI-powered browser codenamed \"Aura.\" [...]..."
  },
  {
    "title": "State-Backed HazyBeacon Malware Uses AWS Lambda to Steal Data from SE Asian Governments",
    "link": "https://thehackernews.com/2025/07/state-backed-hazybeacon-malware-uses.html",
    "date": "2025-07-15T11:08:00.000Z",
    "source": "The Hacker News",
    "summary": "Governmental organizations in Southeast Asia are the target of a new campaign that aims to collect sensitive information by means of a previously undocumented Windows backdoor dubbed HazyBeacon.\nThe a..."
  },
  {
    "title": "Securing Agentic AI: How to Protect the Invisible Identity Access",
    "link": "https://thehackernews.com/2025/07/securing-agentic-ai-how-to-protect.html",
    "date": "2025-07-15T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "AI agents promise to automate everything from financial reconciliations to incident response. Yet every time an AI agent spins up a workflow, it has to authenticate somewhere; often with a high-privil..."
  },
  {
    "title": "AsyncRAT's Open-Source Code Sparks Surge in Dangerous Malware Variants Across the Globe",
    "link": "https://thehackernews.com/2025/07/asyncrats-open-source-code-sparks-surge.html",
    "date": "2025-07-15T10:53:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have charted the evolution of a widely used remote access trojan called AsyncRAT, which was first released on GitHub in January 2019 and has since served as the foundation fo..."
  },
  {
    "title": "North Korean Hackers Flood npm Registry with XORIndex Malware in Ongoing Attack Campaign",
    "link": "https://thehackernews.com/2025/07/north-korean-hackers-flood-npm-registry.html",
    "date": "2025-07-15T07:17:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korean threat actors linked to the Contagious Interview campaign have been observed publishing another set of 67 malicious packages to the npm registry, underscoring ongoing attempts to pois..."
  },
  {
    "title": "DOGE Denizen Marko Elez Leaked API Key for xAI",
    "link": "https://krebsonsecurity.com/2025/07/doge-denizen-marko-elez-leaked-api-key-for-xai/",
    "date": "2025-07-15T01:23:43.000Z",
    "source": "Krebs on Security",
    "summary": "Marko Elez, a 25-year-old employee at Elon Musk's Department of Government Efficiency (DOGE), has been granted access to sensitive databases at the U.S. Social Security Administration, the Treasury an..."
  },
  {
    "title": "Web-Inject Campaign Debuts Fresh Interlock RAT Variant",
    "link": "https://www.darkreading.com/threat-intelligence/web-inject-campaign-interlock-rat-variant",
    "date": "2025-07-14T21:43:15.000Z",
    "source": "Dark Reading",
    "summary": "A cyber-threat campaign is using legitimate websites to inject victims with remote access Trojans belonging to the Interlock ransomware group, in order to gain control of devices...."
  },
  {
    "title": "UK launches vulnerability research program for external experts",
    "link": "https://www.bleepingcomputer.com/news/security/uk-launches-vulnerability-research-program-for-external-experts/",
    "date": "2025-07-14T20:21:22.000Z",
    "source": "Bleeping Computer",
    "summary": "UK's National Cyber Security Centre (NCSC) has announced a new Vulnerability Research Initiative (VRI) that aims to strengthen relations with external cybersecurity experts. [...]..."
  },
  {
    "title": "Military Veterans May Be What Cybersecurity Is Looking For",
    "link": "https://www.darkreading.com/remote-workforce/military-veterans-cybersecurity",
    "date": "2025-07-14T19:43:45.000Z",
    "source": "Dark Reading",
    "summary": "As the field struggles with a shortage, programs that aim to provide veterans with the technical skills needed to succeed in cybersecurity may be the solution for everyone...."
  },
  {
    "title": "Google Gemini AI Bug Allows Invisible, Malicious Prompts",
    "link": "https://www.darkreading.com/remote-workforce/google-gemini-ai-bug-invisible-malicious-prompts",
    "date": "2025-07-14T19:13:45.000Z",
    "source": "Dark Reading",
    "summary": "A prompt-injection vulnerability in the AI assistant allows attackers to create messages that appear to be legitimate Google Security alerts but instead can be used to target users across various Goog..."
  },
  {
    "title": "Interlock ransomware adopts FileFix method to deliver malware",
    "link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-adopts-filefix-method-to-deliver-malware/",
    "date": "2025-07-14T18:36:30.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers have adopted the new technique called 'FileFix' in Interlock ransomware attacks to drop a remote access trojan (RAT) on targeted systems. [...]..."
  },
  {
    "title": "Two new Android 16 security features protect you better - how to switch them on now",
    "link": "https://www.zdnet.com/article/two-new-android-16-security-features-protect-you-better-how-to-switch-them-on-now/",
    "date": "2025-07-14T17:59:00.000Z",
    "source": "ZDNet Security",
    "summary": "I highly recommend you take advantage of both of these features as soon as your phone is upgraded to Android 16...."
  },
  {
    "title": "I found 5 AI content detectors that can correctly identify AI text 100% of the time",
    "link": "https://www.zdnet.com/article/i-found-5-ai-content-detectors-that-can-correctly-identify-ai-text-100-of-the-time/",
    "date": "2025-07-14T17:28:00.000Z",
    "source": "ZDNet Security",
    "summary": "I've been testing AI content detectors for two years now. They're getting more and more reliable. These are the ones you can count on...."
  },
  {
    "title": "The Unusual Suspect: Git Repos",
    "link": "https://thehackernews.com/2025/07/the-unusual-suspect-git-repos.html",
    "date": "2025-07-14T17:06:00.000Z",
    "source": "The Hacker News",
    "summary": "While phishing and ransomware dominate headlines, another critical risk quietly persists across most enterprises: exposed Git repositories leaking sensitive data. A risk that silently creates shadow a..."
  },
  {
    "title": "New PHP-Based Interlock RAT Variant Uses FileFix Delivery Mechanism to Target Multiple Industries",
    "link": "https://thehackernews.com/2025/07/new-php-based-interlock-rat-variant.html",
    "date": "2025-07-14T16:52:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors behind the Interlock ransomware group have unleashed a new PHP variant of its bespoke remote access trojan (RAT) as part of a widespread campaign using a variant of ClickFix called FileF..."
  },
  {
    "title": "Gigabyte motherboards vulnerable to UEFI malware bypassing Secure Boot",
    "link": "https://www.bleepingcomputer.com/news/security/gigabyte-motherboards-vulnerable-to-uefi-malware-bypassing-secure-boot/",
    "date": "2025-07-14T16:30:32.000Z",
    "source": "Bleeping Computer",
    "summary": "Dozens of Gigabyte motherboard models run on UEFI firmware vulnerable to security issues that allow planting bootkit malware that is invisible to the operating system and can survive reinstalls. [...]..."
  },
  {
    "title": "How I easily set up passkeys through my password manager - and why you should too",
    "link": "https://www.zdnet.com/article/how-i-easily-set-up-passkeys-through-my-password-manager-and-why-you-should-too/",
    "date": "2025-07-14T14:25:00.000Z",
    "source": "ZDNet Security",
    "summary": "Using a password manager is a quick and convenient way to store and synchronize passkeys. Here's how it works for me...."
  },
  {
    "title": "The Dark Side of Global Power Shifts &amp; Demographic Decline",
    "link": "https://www.darkreading.com/vulnerabilities-threats/dark-side-global-power-shifts-demographic-decline",
    "date": "2025-07-14T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "As global power realigns and economies falter, the rise in cybercrime is no longer hypothetical — it's inevitable...."
  },
  {
    "title": "⚡ Weekly Recap: Scattered Spider Arrests, Car Exploits, macOS Malware, Fortinet RCE and More",
    "link": "https://thehackernews.com/2025/07/weekly-recap-scattered-spider-arrests.html",
    "date": "2025-07-14T12:52:00.000Z",
    "source": "The Hacker News",
    "summary": "In cybersecurity, precision matters—and there’s little room for error. A small mistake, missed setting, or quiet misconfiguration can quickly lead to much bigger problems. The signs we’re seeing this ..."
  },
  {
    "title": "Malicious VSCode extension in Cursor IDE led to $500K crypto theft",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-vscode-extension-in-cursor-ide-led-to-500k-crypto-theft/",
    "date": "2025-07-14T12:26:34.000Z",
    "source": "Bleeping Computer",
    "summary": "A fake extension for the Cursor AI IDE code editor infected devices with remote access tools and infostealers, which, in one case, led to the theft of $500,000 in cryptocurrency from a Russian crypto ..."
  },
  {
    "title": "CBI Shuts Down £390K U.K. Tech Support Scam, Arrests Key Operatives in Noida Call Center",
    "link": "https://thehackernews.com/2025/07/cbi-shuts-down-390k-uk-tech-support.html",
    "date": "2025-07-14T08:00:00.000Z",
    "source": "The Hacker News",
    "summary": "India's Central Bureau of Investigation (CBI) has announced that it has taken steps to dismantle what it said was a transnational cybercrime syndicate that carried out \"sophisticated\" tech support sca..."
  },
  {
    "title": "eSIM Vulnerability in Kigen's eUICC Cards Exposes Billions of IoT Devices to Malicious Attacks",
    "link": "https://thehackernews.com/2025/07/esim-vulnerability-in-kigens-euicc.html",
    "date": "2025-07-14T05:27:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new hacking technique that exploits weaknesses in the eSIM technology used in modern smartphones, exposing users to severe risks.\nThe issues impact the Kige..."
  },
  {
    "title": "Windows 10 KB5062554 update breaks emoji panel search feature",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-kb5062554-update-breaks-emoji-panel-search-feature/",
    "date": "2025-07-13T18:15:25.000Z",
    "source": "Bleeping Computer",
    "summary": "The search feature for the Windows 10 emoji panel is broken after installing the KB5062554 cumulative update released Tuesday, making it not possible to look up emojis by name or keyword. [...]..."
  },
  {
    "title": "Google Gemini flaw hijacks email summaries for phishing",
    "link": "https://www.bleepingcomputer.com/news/security/google-gemini-flaw-hijacks-email-summaries-for-phishing/",
    "date": "2025-07-13T14:38:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google Gemini for Workspace can be exploited to generate email summaries that appear legitimate but include malicious instructions or warnings that direct users to phishing sites without using attachm..."
  },
  {
    "title": "GPUHammer: New RowHammer Attack Variant Degrades AI Models on NVIDIA GPUs",
    "link": "https://thehackernews.com/2025/07/gpuhammer-new-rowhammer-attack-variant.html",
    "date": "2025-07-12T17:14:00.000Z",
    "source": "The Hacker News",
    "summary": "NVIDIA is urging customers to enable System-level Error Correction Codes (ECC) as a defense against a variant of a RowHammer attack demonstrated against its graphics processing units (GPUs).\n\"Risk of ..."
  },
  {
    "title": "Hackers are exploiting critical RCE flaw in Wing FTP Server",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-are-exploiting-critical-rce-flaw-in-wing-ftp-server/",
    "date": "2025-07-12T14:13:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers have started to exploit a critical remote code execution vulnerability in Wing FTP Server just one day after technical details on the flaw became public. [...]..."
  },
  {
    "title": "Over 600 Laravel Apps Exposed to Remote Code Execution Due to Leaked APP_KEYs on GitHub",
    "link": "https://thehackernews.com/2025/07/over-600-laravel-apps-exposed-to-remote.html",
    "date": "2025-07-12T12:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a serious security issue that allows leaked Laravel APP_KEYs to be weaponized to gain remote code execution capabilities on hundreds of applications.\n\"Laravel..."
  },
  {
    "title": "How passkeys work: Going passwordless with public key cryptography",
    "link": "https://www.zdnet.com/article/how-passkeys-work-going-passwordless-with-public-key-cryptography/",
    "date": "2025-07-12T02:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "What's the Achilles' heel of passwords? Shared secrets. Here's how we eliminate them...."
  },
  {
    "title": "'123456' password exposed chats for 64 million McDonald’s job chatbot applications",
    "link": "https://www.bleepingcomputer.com/news/security/123456-password-exposed-chats-for-64-million-mcdonalds-job-chatbot-applications/",
    "date": "2025-07-11T20:26:52.000Z",
    "source": "Bleeping Computer",
    "summary": "Cybersecurity researchers discovered a vulnerability in McHire, McDonald's chatbot job application platform, that exposed the chats of more than 64 million job applications across the United States. [..."
  },
  {
    "title": "Pay2Key Ransomware Gang Resurfaces With Incentives to Attack US, Israel",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/pay2key-ransomware-gang-incentives-attack-us-israel",
    "date": "2025-07-11T20:25:12.000Z",
    "source": "Dark Reading",
    "summary": "The ransomware-as-a-service (RaaS) operation, which has been tied to an Iranian advanced persistent threat (APT) group, recently boosted its affiliate profit share to 80% for attacks on Western target..."
  }
]