[
  {
    "title": "How Google's AI combats new scam tactics - and how you can stay one step ahead",
    "link": "https://www.zdnet.com/article/how-googles-ai-combats-new-scam-tactics-and-how-you-can-stay-one-step-ahead/",
    "date": "2025-05-08T17:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "Google is trying to lock down Search, Chrome, and Android, but ultimately, you're the last line of defense...."
  },
  {
    "title": "Operation PowerOFF Takes Down 9 DDoS-for-Hire Domains",
    "link": "https://www.darkreading.com/threat-intelligence/operation-poweroff-takes-down-nine-ddos-domains",
    "date": "2025-05-08T16:43:12.000Z",
    "source": "Dark Reading",
    "summary": "Four different countries, including the United States and Germany, were included in the latest international operation alongside Europol's support...."
  },
  {
    "title": "Kickidler employee monitoring software abused in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/kickidler-employee-monitoring-software-abused-in-ransomware-attacks/",
    "date": "2025-05-08T16:05:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Ransomware operations are using legitimate Kickidler employee monitoring software for reconnaissance, tracking their victims' activity, and harvesting credentials after breaching their networks. [...]..."
  },
  {
    "title": "38,000+ FreeDrain Subdomains Found Exploiting SEO to Steal Crypto Wallet Seed Phrases",
    "link": "https://thehackernews.com/2025/05/38000-freedrain-subdomains-found.html",
    "date": "2025-05-08T15:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have exposed what they say is an \"industrial-scale, global cryptocurrency phishing operation\" engineered to steal digital assets from cryptocurrency wallets for several years..."
  },
  {
    "title": "VC giant Insight Partners confirms investor data stolen in breach",
    "link": "https://www.bleepingcomputer.com/news/security/vc-giant-insight-partners-confirms-investor-data-stolen-in-breach/",
    "date": "2025-05-08T15:01:39.000Z",
    "source": "Bleeping Computer",
    "summary": "Venture capital firm Insight Partners has confirmed that sensitive data for employees and limited partners was stolen in a January 2025 cyberattack. [...]..."
  },
  {
    "title": "Security Tools Alone Don't Protect You — Control Effectiveness Does",
    "link": "https://thehackernews.com/2025/05/security-tools-alone-dont-protect-you.html",
    "date": "2025-05-08T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "61% of security leaders reported suffering a breach due to failed or misconfigured controls over the past 12 months. This is despite having an average of 43 cybersecurity tools in place.\nThis massive ..."
  },
  {
    "title": "Life Without CVEs? It's Time to Act",
    "link": "https://www.darkreading.com/vulnerabilities-threats/life-without-cves-time-act",
    "date": "2025-05-08T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Despite all MITRE has done for cybersecurity, it is clear we should not wait 11 months to discuss the future of the CVE database. It's simply too important for that...."
  },
  {
    "title": "SonicWall Patches 3 Flaws in SMA 100 Devices Allowing Attackers to Run Code as Root",
    "link": "https://thehackernews.com/2025/05/sonicwall-patches-3-flaws-in-sma-100.html",
    "date": "2025-05-08T13:56:00.000Z",
    "source": "The Hacker News",
    "summary": "SonicWall has released patches to address three security flaws affecting SMA 100 Secure Mobile Access (SMA) appliances that could be fashioned to result in remote code execution.\nThe vulnerabilities a..."
  },
  {
    "title": "Qilin Ransomware Ranked Highest in April 2025 with Over 45 Data Leak Disclosures",
    "link": "https://thehackernews.com/2025/05/qilin-leads-april-2025-ransomware-spike.html",
    "date": "2025-05-08T13:47:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with ties to the Qilin ransomware family have leveraged malware known as SmokeLoader along with a previously undocumented .NET compiled loader codenamed NETXLOADER as part of a campaign ..."
  },
  {
    "title": "Google links new LostKeys data theft malware to Russian cyberspies",
    "link": "https://www.bleepingcomputer.com/news/security/google-links-new-lostkeys-data-theft-malware-to-russian-cyberspies/",
    "date": "2025-05-08T13:39:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Since the start of the year, the Russian state-backed ColdRiver hacking group has been using new LostKeys malware to steal files in espionage attacks targeting Western governments, journalists, think ..."
  },
  {
    "title": "SonicWall urges admins to patch VPN flaw exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-urges-admins-to-patch-vpn-flaw-exploited-in-attacks/",
    "date": "2025-05-08T11:19:58.000Z",
    "source": "Bleeping Computer",
    "summary": "SonicWall has urged its customers to patch three security vulnerabilities affecting its Secure Mobile Access (SMA) appliances, one of them tagged as exploited in attacks [...]..."
  },
  {
    "title": "MirrorFace Targets Japan and Taiwan with ROAMINGMOUSE and Upgraded ANEL Malware",
    "link": "https://thehackernews.com/2025/05/mirrorface-targets-japan-and-taiwan.html",
    "date": "2025-05-08T10:32:00.000Z",
    "source": "The Hacker News",
    "summary": "The nation-state threat actor known as MirrorFace has been observed deploying malware dubbed ROAMINGMOUSE as part of a cyber espionage campaign directed against government agencies and public institut..."
  },
  {
    "title": "Russian Hackers Using ClickFix Fake CAPTCHA to Deploy New LOSTKEYS Malware",
    "link": "https://thehackernews.com/2025/05/russian-hackers-using-clickfix-fake.html",
    "date": "2025-05-08T06:57:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russia-linked threat actor known as COLDRIVER has been observed distributing a new malware called LOSTKEYS as part of an espionage-focused campaign using ClickFix-like social engineering lures.\n\"L..."
  },
  {
    "title": "'Lemon Sandstorm' Underscores Risks to Middle East Infrastructure",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/lemon-sandstorm-risks-middle-east-infrastructure",
    "date": "2025-05-08T05:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The Iranian state-backed group targeted the operational technology of a critical national infrastructure (CNI) network and persisted in its network for years, but ultimately failed...."
  },
  {
    "title": "Cisco Patches CVE-2025-20188 (10.0 CVSS) in IOS XE That Enables Root Exploits via JWT",
    "link": "https://thehackernews.com/2025/05/cisco-patches-cve-2025-20188-100-cvss.html",
    "date": "2025-05-08T04:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has released software fixes to address a maximum-severity security flaw in its IOS XE Wireless Controller that could enable an unauthenticated, remote attacker to upload arbitrary files to a sus..."
  },
  {
    "title": "LockBit ransomware gang hacked, victim negotiations exposed",
    "link": "https://www.bleepingcomputer.com/news/security/lockbit-ransomware-gang-hacked-victim-negotiations-exposed/",
    "date": "2025-05-08T00:06:32.000Z",
    "source": "Bleeping Computer",
    "summary": "The LockBit ransomware gang has suffered a data breach after its dark web affiliate panels were defaced and replaced with a message linking to a MySQL database dump. [...]..."
  },
  {
    "title": "'CoGUI' Phishing Kit Helps Chinese Hackers Target Japan",
    "link": "https://www.darkreading.com/threat-intelligence/cogui-phishing-kit-chinese-hackers-japan",
    "date": "2025-05-08T00:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Japan is being peppered with an overwhelming volume of spam, thanks to a new platform popular across the East China Sea...."
  },
  {
    "title": "AI Agents Fail in Novel Ways, Put Businesses at Risk",
    "link": "https://www.darkreading.com/vulnerabilities-threats/ai-agents-fail-novel-put-businesses-at-risk",
    "date": "2025-05-07T22:54:19.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft researchers identify 10 new potential pitfalls for companies that are developing or deploying agentic AI systems, with failures potentially leading to the AI becoming a malicious insider...."
  },
  {
    "title": "Pakistani Firm Shipped Fentanyl Analogs, Scams to US",
    "link": "https://krebsonsecurity.com/2025/05/pakistani-firm-shipped-fentanyl-analogs-scams-to-us/",
    "date": "2025-05-07T22:22:48.000Z",
    "source": "Krebs on Security",
    "summary": "A Texas firm recently charged with conspiring to distribute synthetic opioids in the United States is at the center of a vast network of companies in the U.S. and Pakistan whose employees are accused ..."
  },
  {
    "title": "Countries Begin NATO's Locked Shields Cyber-Defense Exercise",
    "link": "https://www.darkreading.com/cybersecurity-operations/countries-nato-locked-shields-cyber-defense-exercise",
    "date": "2025-05-07T21:59:32.000Z",
    "source": "Dark Reading",
    "summary": "The 15th annual event helps countries test and develop defenses against current and emerging cyber threats, including disinformation, quantum computing, and AI...."
  },
  {
    "title": "TikTok Fined €530 Million Over Chinese Access to EU Data",
    "link": "https://www.darkreading.com/cybersecurity-operations/tiktok-fined-530-million-eu-data-servers-china",
    "date": "2025-05-07T21:32:29.000Z",
    "source": "Dark Reading",
    "summary": "European regulators sent an unmistakable message about messing around with GDPR-protected data. How can organizations avoid similar compliance hassles?..."
  },
  {
    "title": "Meta Wins Lawsuit Against Spyware Vendor NSO Group",
    "link": "https://www.darkreading.com/vulnerabilities-threats/meta-wins-lawsuit-spyware-vendor-nso",
    "date": "2025-05-07T21:20:05.000Z",
    "source": "Dark Reading",
    "summary": "The spyware company must pay the tech giant $168 million in punitive and compensatory damages after a 2019 attack targeting 1,400 devices...."
  },
  {
    "title": "5 Chromecast features you're not using enough on your TV (including a smart home hack)",
    "link": "https://www.zdnet.com/article/5-chromecast-features-youre-not-using-enough-on-your-tv-including-a-smart-home-hack/",
    "date": "2025-05-07T20:22:00.000Z",
    "source": "ZDNet Security",
    "summary": "Google's popular casting device has been around for some time, but it still does more than just stream your favorite shows...."
  },
  {
    "title": "Play Ransomware Group Used Windows Zero-Day",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/play-ransomware-group-windows-zero-day",
    "date": "2025-05-07T20:08:42.000Z",
    "source": "Dark Reading",
    "summary": "Previously, Microsoft reported that Storm-2460 had also used the privilege escalation bug to deploy ransomware on organizations in several countries...."
  },
  {
    "title": "'Bring Your Own Installer' Attack Targets SentinelOne EDR",
    "link": "https://www.darkreading.com/vulnerabilities-threats/bring-your-own-installer-attack-sentinelone-edr",
    "date": "2025-05-07T18:36:39.000Z",
    "source": "Dark Reading",
    "summary": "Researchers from Aon's Stroz Friedberg incident response firm discovered a new attack type, known as \"Bring Your Own Installer,\" targeting misconfigured SentinelOne EDR installs...."
  },
  {
    "title": "PowerSchool hacker now extorting individual school districts",
    "link": "https://www.bleepingcomputer.com/news/security/powerschool-hacker-now-extorting-individual-school-districts/",
    "date": "2025-05-07T18:25:39.000Z",
    "source": "Bleeping Computer",
    "summary": "PowerSchool is warning that the hacker behind its December cyberattack is now individually extorting schools, threatening to release the previously stolen student and teacher data if a ransom is not p..."
  },
  {
    "title": "CoGUI phishing platform sent 580 million emails to steal credentials",
    "link": "https://www.bleepingcomputer.com/news/security/cogui-phishing-platform-sent-580-million-emails-to-steal-credentials/",
    "date": "2025-05-07T18:02:16.000Z",
    "source": "Bleeping Computer",
    "summary": "A new phishing kit named 'CoGUI' sent over 580 million emails to targets between January and April 2025, aiming to steal account credentials and payment data. [...]..."
  },
  {
    "title": "Hackers exploit OttoKit WordPress plugin flaw to add admin accounts",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-ottokit-wordpress-plugin-flaw-to-add-admin-accounts/",
    "date": "2025-05-07T15:37:48.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are exploiting a critical unauthenticated privilege escalation vulnerability in the OttoKit WordPress plugin to create rogue admin accounts on targeted sites. [...]..."
  },
  {
    "title": "T-Mobile's data breach settlement payments are finally rolling out - how to see if you qualify",
    "link": "https://www.zdnet.com/article/t-mobiles-data-breach-settlement-payments-are-finally-rolling-out-how-to-see-if-you-qualify/",
    "date": "2025-05-07T15:15:00.000Z",
    "source": "ZDNet Security",
    "summary": "After a 2021 data breach exposed the data of 76 million customers, settlement checks are finally being sent out this month. Here's what you need to know...."
  },
  {
    "title": "Play ransomware exploited Windows logging flaw in zero-day attacks",
    "link": "https://www.bleepingcomputer.com/news/security/play-ransomware-exploited-windows-logging-flaw-in-zero-day-attacks/",
    "date": "2025-05-07T14:45:19.000Z",
    "source": "Bleeping Computer",
    "summary": "The Play ransomware gang has exploited a high-severity Windows Common Log File System flaw in zero-day attacks to gain SYSTEM privileges and deploy malware on compromised systems. [...]..."
  }
]