[
  {
    "title": "Secure Your Spot at RSAC 2026 Conference",
    "link": "https://www.darkreading.com/events/rsac-2026-conference",
    "date": "2026-01-26T21:29:27.546Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Microsoft patches actively exploited Office zero-day vulnerability",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-patches-actively-exploited-office-zero-day-vulnerability/",
    "date": "2026-01-26T18:20:35.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released emergency security updates to patch a high-severity Office zero-day vulnerability exploited in attacks. [...]..."
  },
  {
    "title": "Cloudflare misconfiguration behind recent BGP route leak",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-misconfiguration-behind-recent-bgp-route-leak/",
    "date": "2026-01-26T17:50:35.000Z",
    "source": "Bleeping Computer",
    "summary": "Cloudflare has shared more details about a recent 25-minute Border Gateway Protocol (BGP) route leak affecting IPv6 traffic, which caused measurable congestion, packet loss, and approximately 12 Gbps ..."
  },
  {
    "title": "EU launches investigation into X over Grok-generated sexual images",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/eu-launches-investigation-into-x-over-grok-generated-sexual-images/",
    "date": "2026-01-26T17:14:29.000Z",
    "source": "Bleeping Computer",
    "summary": "The European Commission is now investigating whether X properly assessed risks before deploying its Grok artificial intelligence tool, following its use to generate sexually explicit images. [...]..."
  },
  {
    "title": "Indian Users Targeted in Tax Phishing Campaign Delivering Blackmoon Malware",
    "link": "https://thehackernews.com/2026/01/indian-users-targeted-in-tax-phishing.html",
    "date": "2026-01-26T17:01:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered an ongoing campaign that's targeting Indian users with a multi-stage backdoor as part of a suspected cyber espionage campaign.\nThe activity, per the eSentire ..."
  },
  {
    "title": "Who Operates the Badbox 2.0 Botnet?",
    "link": "https://krebsonsecurity.com/2026/01/who-operates-the-badbox-2-0-botnet/",
    "date": "2026-01-26T16:11:38.000Z",
    "source": "Krebs on Security",
    "summary": "The cybercriminals in control of Kimwolf -- a disruptive botnet that has infected more than 2 million devices -- recently shared a screenshot indicating they'd compromised the control panel for Badbox..."
  },
  {
    "title": "DPRK's Konni Targets Blockchain Developers With AI-Generated Backdoor",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/dprks-konni-targets-blockchain-developers-ai-generated-backdoor",
    "date": "2026-01-26T15:47:40.000Z",
    "source": "Dark Reading",
    "summary": "The North Korean threat group is using a new PowerShell backdoor to compromise development environments and target cryptocurrency holdings, according to researchers...."
  },
  {
    "title": "Malicious VS Code AI Extensions with 1.5 Million Installs Steal Developer Source Code",
    "link": "https://thehackernews.com/2026/01/malicious-vs-code-ai-extensions-with-15.html",
    "date": "2026-01-26T15:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered two malicious Microsoft Visual Studio Code (VS Code) extensions that are advertised as artificial intelligence (AI)-powered coding assistants, but also harbor..."
  },
  {
    "title": "Nearly 800,000 Telnet servers exposed to remote attacks",
    "link": "https://www.bleepingcomputer.com/news/security/nearly-800-000-telnet-servers-exposed-to-remote-attacks/",
    "date": "2026-01-26T15:19:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Internet security watchdog Shadowserver tracks nearly 800,000 IP addresses with Telnet fingerprints amid ongoing attacks exploiting a critical authentication bypass vulnerability in the GNU InetUtils ..."
  },
  {
    "title": "6 Okta security settings you might have overlooked",
    "link": "https://www.bleepingcomputer.com/news/security/6-okta-security-settings-you-might-have-overlooked/",
    "date": "2026-01-26T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Okta misconfigurations can quietly weaken identity security as SaaS environments evolve. Nudge Security shows six Okta security settings teams often overlook and how to fix them. [...]..."
  },
  {
    "title": "Hackers can bypass npm’s Shai-Hulud defenses via Git dependencies",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-can-bypass-npms-shai-hulud-defenses-via-git-dependencies/",
    "date": "2026-01-26T14:02:48.000Z",
    "source": "Bleeping Computer",
    "summary": "The defense mechanisms that NPM introduced after the 'Shai-Hulud' supply-chain attacks have weaknesses that allow threat actors to bypass them via Git dependencies. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Firewall Flaws, AI-Built Malware, Browser Traps, Critical CVEs & More",
    "link": "https://thehackernews.com/2026/01/weekly-recap-firewall-flaws-ai-built.html",
    "date": "2026-01-26T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Security failures rarely arrive loudly. They slip in through trusted tools, half-fixed problems, and habits people stop questioning. This week’s recap shows that pattern clearly.\nAttackers are moving ..."
  },
  {
    "title": "CISA says critical VMware RCE flaw now actively exploited",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-says-critical-vmware-rce-flaw-now-actively-exploited/",
    "date": "2026-01-26T11:49:41.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA has flagged a critical VMware vCenter Server vulnerability as actively exploited and ordered U.S. federal agencies to secure their servers within three weeks. [...]..."
  },
  {
    "title": "Winning Against AI-Based Attacks Requires a Combined Defensive Approach",
    "link": "https://thehackernews.com/2026/01/winning-against-ai-based-attacks.html",
    "date": "2026-01-26T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "If there’s a constant in cybersecurity, it’s that adversaries are always innovating. The rise of offensive AI is transforming attack strategies and making them harder to detect. Google’s Threat Intell..."
  },
  {
    "title": "Konni Hackers Deploy AI-Generated PowerShell Backdoor Against Blockchain Developers",
    "link": "https://thehackernews.com/2026/01/konni-hackers-deploy-ai-generated.html",
    "date": "2026-01-26T08:54:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korean threat actor known as Konni has been observed using PowerShell malware generated using artificial intelligence (AI) tools to target developers and engineering teams in the blockchain ..."
  },
  {
    "title": "ChatGPT Temporary chat feature is getting a much-needed upgrade",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-temporary-chat-feature-is-getting-a-much-needed-upgrade/",
    "date": "2026-01-26T01:01:12.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is testing a big upgrade for ChatGPT's temporary chat feature. The update will allow you to retain personalization in temporary chat, and still block temporary chat from influencing your accoun..."
  },
  {
    "title": "1Password adds pop-up warnings for suspected phishing sites",
    "link": "https://www.bleepingcomputer.com/news/security/1password-adds-pop-up-warnings-for-suspected-phishing-sites/",
    "date": "2026-01-25T15:17:12.000Z",
    "source": "Bleeping Computer",
    "summary": "The 1Password digital vault and password manager has added built-in protection against phishing URLs to help users identify malicious pages and prevent them from sharing account credentials with threa..."
  },
  {
    "title": "Microsoft investigates Windows 11 boot failures after January updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-windows-11-boot-failures-after-january-updates/",
    "date": "2026-01-25T13:20:28.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating reports that some Windows 11 devices are failing to boot with \"UNMOUNTABLE_BOOT_VOLUME\" errors after installing the January 2026 Patch Tuesday security updates. [...]..."
  },
  {
    "title": "Microsoft releases emergency OOB update to fix Outlook freezes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-emergency-oob-update-to-fix-outlook-freezes/",
    "date": "2026-01-25T01:59:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released emergency, out-of-band updates on Saturday for Windows 10, Windows 11, and Windows Server to fix an issue that prevented Microsoft Outlook classic from opening when using PSTs s..."
  },
  {
    "title": "Sandworm hackers linked to failed wiper attack on Poland’s energy systems",
    "link": "https://www.bleepingcomputer.com/news/security/sandworm-hackers-linked-to-failed-wiper-attack-on-polands-energy-systems/",
    "date": "2026-01-24T21:58:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A cyberattack targeting Poland's power grid in late December 2025 has been linked to the Russian state-sponsored hacking group Sandworm, which attempted to deploy a new destructive data-wiping malware..."
  },
  {
    "title": "Konni hackers target blockchain engineers with AI-built malware",
    "link": "https://www.bleepingcomputer.com/news/security/konni-hackers-target-blockchain-engineers-with-ai-built-malware/",
    "date": "2026-01-24T15:23:46.000Z",
    "source": "Bleeping Computer",
    "summary": "The North Korean hacker group Konni (Opal Sleet, TA406) is using AI-generated PowerShell malware to target developers and engineers in the blockchain sector. [...]..."
  },
  {
    "title": "Multi-Stage Phishing Campaign Targets Russia with Amnesia RAT and Ransomware",
    "link": "https://thehackernews.com/2026/01/multi-stage-phishing-campaign-targets.html",
    "date": "2026-01-24T11:09:00.000Z",
    "source": "The Hacker News",
    "summary": "A new multi-stage phishing campaign has been observed targeting users in Russia with ransomware and a remote access trojan called Amnesia RAT.\n\"The attack begins with social engineering lures delivere..."
  },
  {
    "title": "New DynoWiper Malware Used in Attempted Sandworm Attack on Polish Power Sector",
    "link": "https://thehackernews.com/2026/01/new-dynowiper-malware-used-in-attempted.html",
    "date": "2026-01-24T08:21:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russian nation-state hacking group known as Sandworm has been attributed to what has been described as the \"largest cyber attack\" targeting Poland's power system in the last week of December 2025...."
  },
  {
    "title": "Who Approved This Agent? Rethinking Access, Accountability, and Risk in the Age of AI Agents",
    "link": "https://thehackernews.com/2026/01/who-approved-this-agent-rethinking.html",
    "date": "2026-01-24T08:20:00.000Z",
    "source": "The Hacker News",
    "summary": "AI agents are accelerating how work gets done. They schedule meetings, access data, trigger workflows, write code, and take action in real time, pushing productivity beyond human speed across the ente..."
  },
  {
    "title": "CISA Adds Actively Exploited VMware vCenter Flaw CVE-2024-37079 to KEV Catalog",
    "link": "https://thehackernews.com/2026/01/cisa-adds-actively-exploited-vmware.html",
    "date": "2026-01-24T08:09:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added a critical security flaw affecting Broadcom VMware vCenter Server that was patched in June 2024 to its Known Exploited ..."
  },
  {
    "title": "2025 Was a Wake-up Call to Protect Human Decisions, Not Just Systems",
    "link": "https://www.darkreading.com/cyber-risk/wake-up-call-to-protect-human-decisions-not-just-systems",
    "date": "2026-01-24T00:55:56.000Z",
    "source": "Dark Reading",
    "summary": "Cybersecurity must shift from solely protecting systems to safeguarding human decision-making under uncertainty and system failures...."
  },
  {
    "title": "ShinyHunters claim hacks of Okta, Microsoft SSO accounts for data theft",
    "link": "https://www.bleepingcomputer.com/news/security/shinyhunters-claim-to-be-behind-sso-account-data-theft-attacks/",
    "date": "2026-01-23T23:35:03.000Z",
    "source": "Bleeping Computer",
    "summary": "The ShinyHunters extortion gang claims it is behind a wave of ongoing voice phishing attacks targeting single sign-on (SSO) accounts at Okta, Microsoft, and Google, enabling threat actors to breach co..."
  },
  {
    "title": "Swipe, Plug-in, Pwned: Researchers Find New Ways to Hack Vehicles",
    "link": "https://www.darkreading.com/endpoint-security/researchers-find-new-ways-hack-vehicles",
    "date": "2026-01-23T21:04:17.000Z",
    "source": "Dark Reading",
    "summary": "Security researchers exploited dozens of vulnerabilities in vehicle infotainment systems and EV chargers during the latest Pwn2Own contest at Automotive World 2026...."
  },
  {
    "title": "Exploited Zero-Day Flaw in Cisco UC Could Affect Millions",
    "link": "https://www.darkreading.com/endpoint-security/exploited-zero-day-flaw-cisco-uc-affect-millions",
    "date": "2026-01-23T20:56:42.000Z",
    "source": "Dark Reading",
    "summary": "Mass scanning is underway for CVE-2026-20045, which Cisco tagged as critical because successful exploitation could lead to a complete system takeover...."
  },
  {
    "title": "Europe's GCVE Raises Concerns Over Fragmentation in Vulnerability Databases",
    "link": "https://www.darkreading.com/cyber-risk/gcve-raises-concerns-fragmentation-vulnerability-database",
    "date": "2026-01-23T20:31:58.000Z",
    "source": "Dark Reading",
    "summary": "GCVE would enhance global collaboration, flexibility, and efficiency in tracking security flaws. Duplicate entries and a decentralization policy may create more chaos for defenders...."
  }
]