[
  {
    "title": "Secure Your Spot at RSAC 2026 Conference",
    "link": "https://www.darkreading.com/events/rsac-2026-conference",
    "date": "2026-01-28T15:38:28.872Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "AI Is Rewriting Compliance Controls and CISOs Must Take Notice",
    "link": "https://www.bleepingcomputer.com/news/security/ai-is-rewriting-compliance-controls-and-cisos-must-take-notice/",
    "date": "2026-01-28T15:00:10.000Z",
    "source": "Bleeping Computer",
    "summary": "AI agents are now executing regulated actions, reshaping how compliance controls actually work. Token Security explains why CISOs must rethink identity, access, and auditability as AI becomes a digita..."
  },
  {
    "title": "SolarWinds warns of critical Web Help Desk RCE, auth bypass flaws",
    "link": "https://www.bleepingcomputer.com/news/security/solarwinds-warns-of-critical-web-help-desk-rce-auth-bypass-flaws/",
    "date": "2026-01-28T14:39:02.000Z",
    "source": "Bleeping Computer",
    "summary": "SolarWinds has released security updates to patch critical authentication bypass and remote command execution vulnerabilities in its Web Help Desk IT help desk software. [...]..."
  },
  {
    "title": "Critical vm2 Node.js Flaw Allows Sandbox Escape and Arbitrary Code Execution",
    "link": "https://thehackernews.com/2026/01/critical-vm2-nodejs-flaw-allows-sandbox.html",
    "date": "2026-01-28T14:01:00.000Z",
    "source": "The Hacker News",
    "summary": "A critical sandbox escape vulnerability has been disclosed in the popular vm2 Node.js library that, if successfully exploited, could allow attackers to run arbitrary code on the underlying operating s..."
  },
  {
    "title": "Surging Cyberattacks Boost Latin America to Riskiest Region",
    "link": "https://www.darkreading.com/cyber-risk/surging-cyberattacks-latin-america-riskiest-region",
    "date": "2026-01-28T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The region is up against tactics like data-leak extortion, credential-stealing campaigns, edge-device exploitation, and attackers leveraging AI...."
  },
  {
    "title": "Hackers hijack exposed LLM endpoints in Bizarre Bazaar operation",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-hijack-exposed-llm-endpoints-in-bizarre-bazaar-operation/",
    "date": "2026-01-28T13:15:03.000Z",
    "source": "Bleeping Computer",
    "summary": "A malicious campaign is actively targeting exposed LLM (Large Language Model) service endpoints to commercialize unauthorized access to AI infrastructure. [...]..."
  },
  {
    "title": "Slovakian man pleads guilty to operating darknet marketplace",
    "link": "https://www.bleepingcomputer.com/news/security/slovakian-man-pleads-guilty-to-operating-kingdown-market-cybercrime-marketplace/",
    "date": "2026-01-28T12:49:05.000Z",
    "source": "Bleeping Computer",
    "summary": "A Slovakian national admitted on Tuesday to helping operate a darknet marketplace that sold narcotics, cybercrime tools and services, fake government IDs, and stolen personal information for more than..."
  },
  {
    "title": "Two High-Severity n8n Flaws Allow Authenticated Remote Code Execution",
    "link": "https://thehackernews.com/2026/01/two-high-severity-n8n-flaws-allow.html",
    "date": "2026-01-28T12:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed two new security flaws in the n8n workflow automation platform, including a crucial vulnerability that could result in remote code execution.\nThe weaknesses, d..."
  },
  {
    "title": "From Triage to Threat Hunts: How AI Accelerates SecOps",
    "link": "https://thehackernews.com/2026/01/from-triage-to-threat-hunts-how-ai.html",
    "date": "2026-01-28T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "If you work in security operations, the concept of the AI SOC agent is likely familiar. Early narratives promised total autonomy. Vendors seized on the idea of the \"Autonomous SOC\" and suggested a fut..."
  },
  {
    "title": "New WhatsApp lockdown feature protects high-risk users from hackers",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-gets-new-lockdown-feature-that-blocks-cyberattacks/",
    "date": "2026-01-28T11:48:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Meta has started rolling out a new WhatsApp lockdown-style security feature designed to protect journalists, public figures, and other high-risk individuals from sophisticated threats, including spywa..."
  },
  {
    "title": "Mustang Panda Deploys Updated COOLCLIENT Backdoor in Government Cyber Attacks",
    "link": "https://thehackernews.com/2026/01/mustang-panda-deploys-updated.html",
    "date": "2026-01-28T11:40:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with ties to China have been observed using an updated version of a backdoor called COOLCLIENT in cyber espionage attacks in 2025 to facilitate comprehensive data theft from infected end..."
  },
  {
    "title": "Password Reuse in Disguise: An Often-Missed Risky Workaround",
    "link": "https://thehackernews.com/2026/01/password-reuse-in-disguise-often-missed.html",
    "date": "2026-01-28T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "When security teams discuss credential-related risk, the focus typically falls on threats such as phishing, malware, or ransomware. These attack methods continue to evolve and rightly command attentio..."
  },
  {
    "title": "Google Warns of Active Exploitation of WinRAR Vulnerability CVE-2025-8088",
    "link": "https://thehackernews.com/2026/01/google-warns-of-active-exploitation-of.html",
    "date": "2026-01-28T09:46:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Tuesday revealed that multiple threat actors, including nation-state adversaries and financially motivated groups, are exploiting a now-patched critical security flaw in RARLAB WinRAR to est..."
  },
  {
    "title": "Fake Python Spellchecker Packages on PyPI Delivered Hidden Remote Access Trojan",
    "link": "https://thehackernews.com/2026/01/fake-python-spellchecker-packages-on.html",
    "date": "2026-01-28T09:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered two malicious packages in the Python Package Index (PyPI) repository that masquerade as spellcheckers but contain functionality to deliver a remote access tro..."
  },
  {
    "title": "Fortinet Patches CVE-2026-24858 After Active FortiOS SSO Exploitation Detected",
    "link": "https://thehackernews.com/2026/01/fortinet-patches-cve-2026-24858-after.html",
    "date": "2026-01-28T04:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortinet has begun releasing security updates to address a critical flaw impacting FortiOS that has come under active exploitation in the wild.\nThe vulnerability, assigned the CVE identifier CVE-2026-..."
  },
  {
    "title": "OpenAI's ChatGPT ad costs are on par with live NFL broadcasts",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-chatgpt-ad-costs-are-on-par-with-live-nfl-broadcasts/",
    "date": "2026-01-28T00:04:45.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI plans to begin rolling out ads on ChatGPT in the United States if you have a free or $8 Go subscription, but the catch is that the ads could be very expensive for advertisers. [...]..."
  },
  {
    "title": "Fortinet blocks exploited FortiCloud SSO zero day until patch is ready",
    "link": "https://www.bleepingcomputer.com/news/security/fortinet-blocks-exploited-forticloud-sso-zero-day-until-patch-is-ready/",
    "date": "2026-01-27T23:19:42.000Z",
    "source": "Bleeping Computer",
    "summary": "Fortinet has confirmed a new, actively exploited critical FortiCloud single sign-on (SSO) authentication bypass vulnerability, tracked as CVE-2026-24858, and says it has mitigated the zero-day attacks..."
  },
  {
    "title": "AI &amp; the Death of Accuracy: What It Means for Zero-Trust",
    "link": "https://www.darkreading.com/application-security/ai-death-accuracy-zero-trust",
    "date": "2026-01-27T22:31:48.000Z",
    "source": "Dark Reading",
    "summary": "AI \"model collapse,\" where LLMs over time train on more and more AI-generated data and become degraded as a result, can introduce inaccuracies, promulgate malicious activity, and impact PII protection..."
  },
  {
    "title": "Chinese Mustang Panda hackers deploy infostealers via CoolClient backdoor",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-mustang-panda-hackers-deploy-infostealers-via-coolclient-backdoor/",
    "date": "2026-01-27T22:26:26.000Z",
    "source": "Bleeping Computer",
    "summary": "The Chinese espionage threat group Mustang Panda has updated its CoolClient backdoor to a new variant that can steal login data from browsers and monitor the clipboard. [...]..."
  },
  {
    "title": "Vibe-Coded 'Sicarii' Ransomware Can't Be Decrypted",
    "link": "https://www.darkreading.com/endpoint-security/vibe-coded-sicarii-ransomware-decrypted",
    "date": "2026-01-27T22:15:39.000Z",
    "source": "Dark Reading",
    "summary": "A new ransomware strain that entered the scene last year has poorly designed code and uses Hebrew language that might be a false flag...."
  },
  {
    "title": "Critical Telnet Server Flaw Exposes Forgotten Attack Surface",
    "link": "https://www.darkreading.com/ics-ot-security/critical-telnet-server-flaw-forgotten-attack-surface",
    "date": "2026-01-27T21:00:21.000Z",
    "source": "Dark Reading",
    "summary": "While telnet is considered obsolete, the network protocol is still used by hundreds of thousands of legacy systems and IoT devices for remote access...."
  },
  {
    "title": "Microsoft Rushes Emergency Patch for Office Zero-Day",
    "link": "https://www.darkreading.com/vulnerabilities-threats/microsoft-rushes-emergency-patch-office-zero-day",
    "date": "2026-01-27T20:07:03.000Z",
    "source": "Dark Reading",
    "summary": "To exploit the vulnerability, an attacker would need either system access or be able to convince a user to open a malicious Office file...."
  },
  {
    "title": "WinRAR path traversal flaw still exploited by numerous hackers",
    "link": "https://www.bleepingcomputer.com/news/security/winrar-path-traversal-flaw-still-exploited-by-numerous-hackers/",
    "date": "2026-01-27T19:38:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Multiple threat actors, both state-sponsored and financially motivated, are exploiting the CVE-2025-8088 high-severity vulnerability in WinRAR for initial access and to deliver various malicious paylo..."
  },
  {
    "title": "'Stanley' Toolkit Turns Chrome Into Undetectable Phishing Vector",
    "link": "https://www.darkreading.com/remote-workforce/stanley-toolkit-chrome-undetectable-phishing",
    "date": "2026-01-27T18:20:28.000Z",
    "source": "Dark Reading",
    "summary": "The malware-as-a-service kit enables malicious extensions to overlay pages on real websites without changing the visible URL, signaling a fresh challenge for enterprise security...."
  },
  {
    "title": "WhatsApp Rolls Out Lockdown-Style Security Mode to Protect Targeted Users From Spyware",
    "link": "https://thehackernews.com/2026/01/whatsapp-rolls-out-lockdown-style.html",
    "date": "2026-01-27T16:54:00.000Z",
    "source": "The Hacker News",
    "summary": "Meta on Tuesday announced it's adding Strict Account Settings on WhatsApp to secure certain users against advanced cyber attacks because of who they are and what they do.\nThe feature, similar to Lockd..."
  },
  {
    "title": "Nike investigates data breach after extortion gang leaks files",
    "link": "https://www.bleepingcomputer.com/news/security/nike-investigates-data-breach-after-extortion-gang-leaks-files/",
    "date": "2026-01-27T16:45:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Nike is investigating what it described as a \"potential cyber security incident\" after the World Leaks ransomware gang leaked 1.4 TB of files allegedly stolen from the sportswear giant. [...]..."
  },
  {
    "title": "Experts Detect Pakistan-Linked Cyber Campaigns Aimed at Indian Government Entities",
    "link": "https://thehackernews.com/2026/01/experts-detect-pakistan-linked-cyber.html",
    "date": "2026-01-27T16:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Indian government entities have been targeted in two campaigns undertaken by a threat actor that operates in Pakistan using previously undocumented tradecraft.\nThe campaigns have been codenamed Gopher..."
  },
  {
    "title": "WorldLeaks Extortion Group Claims It Stole 1.4TB of Nike Data",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/worldeaks-extortion-group-stole-1.4tb-nike-data",
    "date": "2026-01-27T16:41:40.000Z",
    "source": "Dark Reading",
    "summary": "The sportswear brand is investigating an alleged breach of its network that exposed some 188,347 files of highly sensitive corporate data...."
  },
  {
    "title": "Critical sandbox escape flaw found in popular vm2 NodeJS library",
    "link": "https://www.bleepingcomputer.com/news/security/critical-sandbox-escape-flaw-discovered-in-popular-vm2-nodejs-library/",
    "date": "2026-01-27T16:35:29.000Z",
    "source": "Bleeping Computer",
    "summary": "A critical-severity vulnerability in the vm2 Node.js sandbox library, tracked as CVE-2026-22709, allows escaping the sandbox and executing arbitrary code on the underlying host system. [...]..."
  },
  {
    "title": "US charges 31 more suspects linked to ATM malware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/us-charges-31-more-suspects-linked-to-atm-malware-attacks/",
    "date": "2026-01-27T16:27:04.000Z",
    "source": "Bleeping Computer",
    "summary": "A Nebraska federal grand jury charged 31 additional defendants for their involvement in an ATM jackpotting operation allegedly orchestrated by members of the Venezuelan gang Tren de Aragua. [...]..."
  }
]