[
  {
    "title": "New ShadowV2 botnet malware used AWS outage as a test opportunity",
    "link": "https://www.bleepingcomputer.com/news/security/new-shadowv2-botnet-malware-used-aws-outage-as-a-test-opportunity/",
    "date": "2025-11-26T22:24:14.000Z",
    "source": "Bleeping Computer",
    "summary": "A new Mirai-based botnet malware named 'ShadowV2' has been observed targeting IoT devices from D-Link, TP-Link, and other vendors with exploits for known vulnerabilities. [...]..."
  },
  {
    "title": "NordVPN Black Friday Deal: Unlock 77% off VPN plans in 2025",
    "link": "https://www.bleepingcomputer.com/news/security/nordvpn-black-friday-deal-unlock-77-percent-off-vpn-plans-in-2025/",
    "date": "2025-11-26T20:00:37.000Z",
    "source": "Bleeping Computer",
    "summary": "The NordVPN Black Friday Deal is now live, and you can get the best discount available: 77% off that applies automatically when you follow our link. If you've been waiting for the right moment to upgr..."
  },
  {
    "title": "Popular Forge library gets fix for signature verification bypass flaw",
    "link": "https://www.bleepingcomputer.com/news/security/popular-forge-library-gets-fix-for-signature-verification-bypass-flaw/",
    "date": "2025-11-26T19:32:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A vulnerability in the 'node-forge' package, a popular JavaScript cryptography library, could be exploited to bypass signature verifications by crafting data that appears valid. [...]..."
  },
  {
    "title": "Comcast to pay $1.5M fine for vendor breach affecting 270K customers",
    "link": "https://www.bleepingcomputer.com/news/security/comcast-to-pay-15-million-fine-after-a-vendor-data-breach-affecting-270-000-customers/",
    "date": "2025-11-26T18:30:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Comcast will pay a $1.5 million fine to settle a Federal Communications Commission investigation into a February 2024 vendor data breach that exposed the personal information of nearly 275,000 custome..."
  },
  {
    "title": "Shai-Hulud v2 Campaign Spreads From npm to Maven, Exposing Thousands of Secrets",
    "link": "https://thehackernews.com/2025/11/shai-hulud-v2-campaign-spreads-from-npm.html",
    "date": "2025-11-26T18:08:00.000Z",
    "source": "The Hacker News",
    "summary": "The second wave of the Shai-Hulud supply chain attack has spilled over to the Maven ecosystem after compromising more than 830 packages in the npm registry.\nThe Socket Research Team said it identified..."
  },
  {
    "title": "Multiple London councils' IT systems disrupted by cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/multiple-london-councils-it-systems-disrupted-by-cyberattack/",
    "date": "2025-11-26T17:26:11.000Z",
    "source": "Bleeping Computer",
    "summary": "The Royal Borough of Kensington and Chelsea (RBKC) and the Westminster City Council (WCC) announced that they are experiencing service disruptions following a cybersecurity issue. [...]..."
  },
  {
    "title": "Meet Rey, the Admin of ‘Scattered Lapsus$ Hunters’",
    "link": "https://krebsonsecurity.com/2025/11/meet-rey-the-admin-of-scattered-lapsus-hunters/",
    "date": "2025-11-26T17:22:36.000Z",
    "source": "Krebs on Security",
    "summary": "A prolific cybercriminal group that calls itself \"Scattered LAPSUS$ Hunters\" made headlines regularly this year by stealing data from and publicly mass extorting dozens of major corporations. But the ..."
  },
  {
    "title": "Microsoft: Security keys may prompt for PIN after recent updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fido2-security-keys-may-prompt-for-pin-after-recent-windows-updates/",
    "date": "2025-11-26T14:43:57.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft warned users on Tuesday that FIDO2 security keys may prompt them to enter a PIN when signing in after installing Windows updates released since the September 2025 preview update. [...]..."
  },
  {
    "title": "Qilin Ransomware Turns South Korean MSP Breach Into 28-Victim 'Korean Leaks' Data Heist",
    "link": "https://thehackernews.com/2025/11/qilin-ransomware-turns-south-korean-msp.html",
    "date": "2025-11-26T14:31:00.000Z",
    "source": "The Hacker News",
    "summary": "South Korea's financial sector has been targeted by what has been described as a sophisticated supply chain attack that led to the deployment of Qilin ransomware.\n\"This operation combined the capabili..."
  },
  {
    "title": "Microsoft to secure Entra ID sign-ins from script injection attacks",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-secure-entra-id-sign-ins-from-external-script-injection-attacks/",
    "date": "2025-11-26T13:26:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Starting in mid-to-late October 2026, Microsoft will enhance the security of the Entra ID authentication system against external script injection attacks. [...]..."
  },
  {
    "title": "When Your $2M Security Detection Fails: Can your SOC Save You?",
    "link": "https://thehackernews.com/2025/11/when-your-2m-security-detection-fails.html",
    "date": "2025-11-26T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Enterprises today are expected to have at least 6-8 detection tools, as detection is considered a standard investment and the first line of defense. Yet security leaders struggle to justify dedicating..."
  },
  {
    "title": "ASUS warns of new critical auth bypass flaw in AiCloud routers",
    "link": "https://www.bleepingcomputer.com/news/security/asus-warns-of-new-critical-auth-bypass-flaw-in-aicloud-routers/",
    "date": "2025-11-26T11:41:00.000Z",
    "source": "Bleeping Computer",
    "summary": "ASUS has released new firmware to patch nine security vulnerabilities, including a critical authentication bypass flaw in routers with AiCloud enabled. [...]..."
  },
  {
    "title": "Webinar: Learn to Spot Risks and Patch Safely with Community-Maintained Tools",
    "link": "https://thehackernews.com/2025/11/webinar-learn-to-spot-risks-and-patch.html",
    "date": "2025-11-26T11:10:00.000Z",
    "source": "The Hacker News",
    "summary": "If you're using community tools like Chocolatey or Winget to keep systems updated, you're not alone. These platforms are fast, flexible, and easy to work with—making them favorites for IT teams. But t..."
  },
  {
    "title": "Chrome Extension Caught Injecting Hidden Solana Transfer Fees Into Raydium Swaps",
    "link": "https://thehackernews.com/2025/11/chrome-extension-caught-injecting.html",
    "date": "2025-11-26T11:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new malicious extension on the Chrome Web Store that's capable of injecting a stealthy Solana transfer into a swap transaction and transferring the funds to..."
  },
  {
    "title": "Passwork 7: Self-hosted password and secrets manager for enterprise teams",
    "link": "https://www.bleepingcomputer.com/news/security/passwork-7-self-hosted-password-and-secrets-manager-for-enterprise-teams/",
    "date": "2025-11-26T10:12:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Passwork 7 unifies enterprise password and secrets management in a self-hosted platform. Organizations can automate credential workflows and test the full system with a free trial and up to 50% Black ..."
  },
  {
    "title": "RomCom Uses SocGholish Fake Update Attacks to Deliver Mythic Agent Malware",
    "link": "https://thehackernews.com/2025/11/romcom-uses-socgholish-fake-update.html",
    "date": "2025-11-26T08:28:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actors behind a malware family known as RomCom targeted a U.S.-based civil engineering company via a JavaScript loader dubbed SocGholish to deliver the Mythic Agent.\n\"This is the first time..."
  },
  {
    "title": "FBI Reports $262M in ATO Fraud as Researchers Cite Growing AI Phishing and Holiday Scams",
    "link": "https://thehackernews.com/2025/11/fbi-reports-262m-in-ato-fraud-as.html",
    "date": "2025-11-26T04:29:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Federal Bureau of Investigation (FBI) has warned that cybercriminals are impersonating financial institutions with an aim to steal money or sensitive information to facilitate account takeove..."
  },
  {
    "title": "OnSolve CodeRED cyberattack disrupts emergency alert systems nationwide",
    "link": "https://www.bleepingcomputer.com/news/security/onsolve-codered-cyberattack-disrupts-emergency-alert-systems-nationwide/",
    "date": "2025-11-25T21:48:40.000Z",
    "source": "Bleeping Computer",
    "summary": "Risk management company Crisis24 has confirmed its OnSolve CodeRED platform suffered a cyberattack that disrupted emergency notification systems used by state and local governments, police departments..."
  },
  {
    "title": "The Black Friday 2025 Cybersecurity, IT, VPN, & Antivirus Deals",
    "link": "https://www.bleepingcomputer.com/news/security/the-black-friday-2025-cybersecurity-it-vpn-and-antivirus-deals/",
    "date": "2025-11-25T19:14:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Black Friday 2025 is almost here, and early deals are already live across security software, online courses, system administration tools, antivirus products, and VPN services. These discounts are limi..."
  },
  {
    "title": "FBI: Cybercriminals stole $262M by impersonating bank support teams",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-cybercriminals-stole-262-million-by-impersonating-bank-support-teams-since-january/",
    "date": "2025-11-25T17:23:23.000Z",
    "source": "Bleeping Computer",
    "summary": "The FBI warns of a surge in account takeover (ATO) fraud schemes and says that cybercriminals impersonating various financial institutions have stolen over $262 million in ATO attacks since the start ..."
  },
  {
    "title": "Years of JSONFormatter and CodeBeautify Leaks Expose Thousands of Passwords and API Keys",
    "link": "https://thehackernews.com/2025/11/years-of-jsonformatter-and-codebeautify.html",
    "date": "2025-11-25T16:49:00.000Z",
    "source": "The Hacker News",
    "summary": "New research has found that organizations in various sensitive sectors, including governments, telecoms, and critical infrastructure, are pasting passwords and credentials into online tools like JSONf..."
  },
  {
    "title": "JackFix Uses Fake Windows Update Pop-Ups on Adult Sites to Deliver Multiple Stealers",
    "link": "https://thehackernews.com/2025/11/jackfix-uses-fake-windows-update-pop.html",
    "date": "2025-11-25T14:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a new campaign that's leveraging a combination of ClickFix lures and fake adult websites to deceive users into running malicious commands under the g..."
  },
  {
    "title": "ToddyCat’s New Hacking Tools Steal Outlook Emails and Microsoft 365 Access Tokens",
    "link": "https://thehackernews.com/2025/11/toddycats-new-hacking-tools-steal.html",
    "date": "2025-11-25T11:36:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as ToddyCat has been observed adopting new methods to obtain access to corporate email data belonging to target companies, including using a custom tool dubbed TCSectorCopy.\n\"Th..."
  },
  {
    "title": "3 SOC Challenges You Need to Solve Before 2026",
    "link": "https://thehackernews.com/2025/11/3-soc-challenges-you-need-to-solve.html",
    "date": "2025-11-25T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "2026 will mark a pivotal shift in cybersecurity. Threat actors are moving from experimenting with AI to making it their primary weapon, using it to scale attacks, automate reconnaissance, and craft hy..."
  },
  {
    "title": "Hackers Hijack Blender 3D Assets to Deploy StealC V2 Data-Stealing Malware",
    "link": "https://thehackernews.com/2025/11/hackers-hijack-blender-3d-assets-to.html",
    "date": "2025-11-25T11:28:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign that has leveraged Blender Foundation files to deliver an information stealer known as StealC V2.\n\"This ongoing operation, active for..."
  },
  {
    "title": "CISA Warns of Active Spyware Campaigns Hijacking High-Value Signal and WhatsApp Users",
    "link": "https://thehackernews.com/2025/11/cisa-warns-of-active-spyware-campaigns.html",
    "date": "2025-11-25T06:42:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday issued an alert warning of bad actors actively leveraging commercial spyware and remote access trojans (RATs) to target users..."
  },
  {
    "title": "Is Your Android TV Streaming Box Part of a Botnet?",
    "link": "https://krebsonsecurity.com/2025/11/is-your-android-tv-streaming-box-part-of-a-botnet/",
    "date": "2025-11-24T18:44:52.000Z",
    "source": "Krebs on Security",
    "summary": "On the surface, the Superbox media streaming devices for sale at retailers like BestBuy and Walmart may seem like a steal: They offer unlimited access to more than 2,200 pay-per-view and streaming ser..."
  },
  {
    "title": "New Fluent Bit Flaws Expose Cloud to RCE and Stealthy Infrastructure Intrusions",
    "link": "https://thehackernews.com/2025/11/new-fluent-bit-flaws-expose-cloud-to.html",
    "date": "2025-11-24T15:03:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered five vulnerabilities in Fluent Bit, an open-source and lightweight telemetry agent, that could be chained to compromise and take over cloud infrastructures.\nT..."
  },
  {
    "title": "Second Sha1-Hulud Wave Affects 25,000+ Repositories via npm Preinstall Credential Theft",
    "link": "https://thehackernews.com/2025/11/second-sha1-hulud-wave-affects-25000.html",
    "date": "2025-11-24T13:03:00.000Z",
    "source": "The Hacker News",
    "summary": "Multiple security vendors are sounding the alarm about a second wave of attacks targeting the npm registry in a manner that's reminiscent of the Shai-Hulud attack.\nThe new supply chain campaign, dubbe..."
  },
  {
    "title": "⚡ Weekly Recap: Fortinet Exploit, Chrome 0-Day, BadIIS Malware, Record DDoS, SaaS Breach & More",
    "link": "https://thehackernews.com/2025/11/weekly-recap-fortinet-exploit-chrome-0.html",
    "date": "2025-11-24T12:32:00.000Z",
    "source": "The Hacker News",
    "summary": "This week saw a lot of new cyber trouble. Hackers hit Fortinet and Chrome with new 0-day bugs. They also broke into supply chains and SaaS tools. Many hid inside trusted apps, browser alerts, and soft..."
  }
]