[
  {
    "title": "Uzbek Users Under Attack by Android SMS Stealers",
    "link": "https://www.darkreading.com/cyber-risk/uzbek-users-android-sms-stealers",
    "date": "2025-12-22T17:07:10.000Z",
    "source": "Dark Reading",
    "summary": "Telegram users in Uzbekistan are being targeted with Android SMS stealer malware, and what's worse, the attackers are improving their methods...."
  },
  {
    "title": "Fake WhatsApp API Package on npm Steals Messages, Contacts, and Login Tokens",
    "link": "https://thehackernews.com/2025/12/fake-whatsapp-api-package-on-npm-steals.html",
    "date": "2025-12-22T16:28:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new malicious package on the npm repository that works as a fully functional WhatsApp API, but also contains the ability to intercept every messag..."
  },
  {
    "title": "Malicious npm package steals WhatsApp accounts and messages",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-npm-package-steals-whatsapp-accounts-and-messages/",
    "date": "2025-12-22T16:08:46.000Z",
    "source": "Bleeping Computer",
    "summary": "A malicious package in the Node Package Manager (NPM) registry poses as a legitimate WhatsApp Web API library to steal WhatsApp messages, collect contacts, and gain access to the account. [...]..."
  },
  {
    "title": "Romanian water authority hit by ransomware attack over weekend",
    "link": "https://www.bleepingcomputer.com/news/security/romanian-water-authority-hit-by-ransomware-attack-over-weekend/",
    "date": "2025-12-22T15:25:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Romanian Waters (Administrația Națională Apele Române), the country's water management authority, was hit by a ransomware attack over the weekend. [...]..."
  },
  {
    "title": "University of Phoenix data breach impacts nearly 3.5 million individuals",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-phoenix-data-breach-impacts-nearly-35-million-individuals/",
    "date": "2025-12-22T14:18:55.000Z",
    "source": "Bleeping Computer",
    "summary": "The Clop ransomware gang has stolen the data of nearly 3.5 million University of Phoenix (UoPX) students, staff, and suppliers after breaching the university's network in August. [...]..."
  },
  {
    "title": "Coupang breach affecting 33.7 million users raises data protection questions",
    "link": "https://www.bleepingcomputer.com/news/security/coupang-breach-affecting-337-million-users-raises-data-protection-questions/",
    "date": "2025-12-22T14:00:09.000Z",
    "source": "Bleeping Computer",
    "summary": "Coupang disclosed a data breach affecting 33.7 million customers after unauthorized access to personal data went undetected for nearly five months. Penta Security explains how the incident highlights ..."
  },
  {
    "title": "⚡ Weekly Recap: Firewall Exploits, AI Data Theft, Android Hacks, APT Attacks, Insider Leaks & More",
    "link": "https://thehackernews.com/2025/12/weekly-recap-firewall-exploits-ai-data.html",
    "date": "2025-12-22T12:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyber threats last week showed how attackers no longer need big hacks to cause big damage. They’re going after the everyday tools we trust most — firewalls, browser add-ons, and even smart TVs — turni..."
  },
  {
    "title": "How to Browse the Web More Sustainably With a Green Browser",
    "link": "https://thehackernews.com/2025/12/how-to-browse-sustainably-with-a-green-browser.html",
    "date": "2025-12-22T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "As the internet becomes an essential part of daily life, its environmental footprint continues to grow. \nData centers, constant connectivity, and resource-heavy browsing habits all contribute to energ..."
  },
  {
    "title": "Not all CISA-linked alerts are urgent: ASUS Live Update CVE-2025-59374",
    "link": "https://www.bleepingcomputer.com/news/security/not-all-cisa-linked-alerts-are-urgent-asus-live-update-cve-2025-59374/",
    "date": "2025-12-22T11:09:17.000Z",
    "source": "Bleeping Computer",
    "summary": "An ASUS Live Update vulnerability tracked as CVE-2025-59374 has been making the rounds in infosec feeds, with some headlines implying recent or ongoing exploitation. A closer look, however, shows the ..."
  },
  {
    "title": "Ukrainian hacker admits affiliate role in Nefilim ransomware gang",
    "link": "https://www.bleepingcomputer.com/news/security/ukrainian-hacker-admits-affiliate-role-in-nefilim-ransomware-gang/",
    "date": "2025-12-22T09:46:45.000Z",
    "source": "Bleeping Computer",
    "summary": "A Ukrainian national pleaded guilty on Friday to conducting Nefilim ransomware attacks that targeted high-revenue businesses across the United States and other countries. [...]..."
  },
  {
    "title": "Critical RCE flaw impacts over 115,000 WatchGuard firewalls",
    "link": "https://www.bleepingcomputer.com/news/security/over-115-000-watchguard-firewalls-vulnerable-to-ongoing-rce-attacks/",
    "date": "2025-12-22T09:00:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Over 115,000 WatchGuard Firebox devices exposed online remain unpatched against a critical remote code execution (RCE) vulnerability actively exploited in attacks. [...]..."
  },
  {
    "title": "Android Malware Operations Merge Droppers, SMS Theft, and RAT Capabilities at Scale",
    "link": "https://thehackernews.com/2025/12/android-malware-operations-merge.html",
    "date": "2025-12-22T06:11:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed leveraging malicious dropper apps masquerading as legitimate applications to deliver an Android SMS stealer dubbed Wonderland in mobile attacks targeting users in Uzbe..."
  },
  {
    "title": "Docker Hardened Images now open source and available for free",
    "link": "https://www.bleepingcomputer.com/news/security/docker-hardened-images-now-open-source-and-available-for-free/",
    "date": "2025-12-21T15:12:14.000Z",
    "source": "Bleeping Computer",
    "summary": "More than a 1,000 Docker Hardened Images (DHI) are now freely available and open source for software builders, under the Apache 2.0 license. [...]..."
  },
  {
    "title": "Iranian Infy APT Resurfaces with New Malware Activity After Years of Silence",
    "link": "https://thehackernews.com/2025/12/iranian-infy-apt-resurfaces-with-new.html",
    "date": "2025-12-21T04:22:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters have discerned new activity associated with an Iranian threat actor known as Infy (aka Prince of Persia), nearly five years after the hacking group was observed targeting victims in Swe..."
  },
  {
    "title": "RansomHouse upgrades encryption with multi-layered data processing",
    "link": "https://www.bleepingcomputer.com/news/security/ransomhouse-upgrades-encryption-with-multi-layered-data-processing/",
    "date": "2025-12-20T15:23:34.000Z",
    "source": "Bleeping Computer",
    "summary": "The RansomHouse ransomware-as-a-service (RaaS) has recently upgraded its encryptor, switching from a relatively simple single-phase linear technique to a more complex, multi-layered method. [...]..."
  },
  {
    "title": "U.S. DOJ Charges 54 in ATM Jackpotting Scheme Using Ploutus Malware",
    "link": "https://thehackernews.com/2025/12/us-doj-charges-54-in-atm-jackpotting.html",
    "date": "2025-12-20T13:48:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of Justice (DoJ) this week announced the indictment of 54 individuals in connection with a multi-million dollar ATM jackpotting scheme.\nThe large-scale conspiracy involved deployin..."
  },
  {
    "title": "Cisco VPNs, Email Services Hit in Separate Threat Campaigns",
    "link": "https://www.darkreading.com/endpoint-security/cisco-vpns-email-services-threat-campaigns",
    "date": "2025-12-19T20:05:38.000Z",
    "source": "Dark Reading",
    "summary": "The company suffered one sophisticated five-alarm campaign and one messy spray-and-pray attack, mere days apart...."
  },
  {
    "title": "Microsoft confirms Teams is down and messages are delayed",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-teams-is-down-and-messages-are-delayed/",
    "date": "2025-12-19T20:04:28.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft Teams is experiencing issues, with thousands reporting problems sending messages, including delays. [...]..."
  },
  {
    "title": "Nigeria arrests dev of Microsoft 365 'Raccoon0365' phishing platform",
    "link": "https://www.bleepingcomputer.com/news/security/nigeria-arrests-dev-of-microsoft-365-raccoon0365-phishing-platform/",
    "date": "2025-12-19T19:05:32.000Z",
    "source": "Bleeping Computer",
    "summary": "The Nigerian police have arrested three individuals linked to targeted Microsoft 365 cyberattacks via Raccoon0365 phishing-as-a-service. [...]..."
  },
  {
    "title": "Russia-Linked Hackers Use Microsoft 365 Device Code Phishing for Account Takeovers",
    "link": "https://thehackernews.com/2025/12/russia-linked-hackers-use-microsoft-365.html",
    "date": "2025-12-19T17:54:00.000Z",
    "source": "The Hacker News",
    "summary": "A suspected Russia-aligned group has been attributed to a phishing campaign that employs device code authentication workflows to steal victims' Microsoft 365 credentials and conduct account takeover a..."
  },
  {
    "title": "Microsoft 365 accounts targeted in wave of OAuth phishing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-365-accounts-targeted-in-wave-of-oauth-phishing-attacks/",
    "date": "2025-12-19T17:19:04.000Z",
    "source": "Bleeping Computer",
    "summary": "Multiple threat actors are compromising Microsoft 365 accounts in phishing attacks that leverage the OAuth device code authorization mechanism. [...]..."
  },
  {
    "title": "LongNosedGoblin Caught Snooping on Asian Governments",
    "link": "https://www.darkreading.com/threat-intelligence/longnosedgoblin-caught-snooping-on-asian-governments",
    "date": "2025-12-19T16:38:48.000Z",
    "source": "Dark Reading",
    "summary": "New China-aligned APT group is deploying Group Policy to sniff through government networks across Southeast Asia and Japan...."
  },
  {
    "title": "Cracked Software and YouTube Videos Spread CountLoader and GachiLoader Malware",
    "link": "https://thehackernews.com/2025/12/cracked-software-and-youtube-videos.html",
    "date": "2025-12-19T15:34:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign that has used cracked software distribution sites as a distribution vector for a new version of a modular and stealthy loader known a..."
  },
  {
    "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
    "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
    "date": "2025-12-19T15:14:55.000Z",
    "source": "Krebs on Security",
    "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenge..."
  },
  {
    "title": "Identity Fraud Among Home-Care Workers Puts Patients at Risk",
    "link": "https://www.darkreading.com/identity-access-management-security/identity-fraud-among-home-care-workers-puts-patients-at-risk",
    "date": "2025-12-19T15:04:50.000Z",
    "source": "Dark Reading",
    "summary": "Reports of patients being cared for by unqualified home-care aides with fake identities continue to emerge, highlighting a need for more stringent identity authentication...."
  },
  {
    "title": "A Cybersecurity Playbook for AI Adoption",
    "link": "https://www.darkreading.com/cyber-risk/cybersecurity-playbook-ai-adoption",
    "date": "2025-12-19T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "AI adds real value to cybersecurity today, but it cannot yet serve as a single security guardian. Here's how organizations can safely combine AI-driven analysis with deterministic rules and proven sec..."
  },
  {
    "title": "A Good Year for North Korean Cybercriminals",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/good-year-north-korean-cybercriminals",
    "date": "2025-12-19T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "North Korea shifted its strategy to patiently target \"bigger fish\" for larger payouts, using sophisticated methods to execute attacks at opportune times...."
  },
  {
    "title": "WatchGuard Warns of Active Exploitation of Critical Fireware OS VPN Vulnerability",
    "link": "https://thehackernews.com/2025/12/watchguard-warns-of-active-exploitation.html",
    "date": "2025-12-19T11:23:00.000Z",
    "source": "The Hacker News",
    "summary": "WatchGuard has released fixes to address a critical security flaw in Fireware OS that it said has been exploited in real-world attacks.\nTracked as CVE-2025-14733 (CVSS score: 9.3), the vulnerability h..."
  },
  {
    "title": "Nigeria Arrests RaccoonO365 Phishing Developer Linked to Microsoft 365 Attacks",
    "link": "https://thehackernews.com/2025/12/nigeria-arrests-raccoono365-phishing.html",
    "date": "2025-12-19T10:26:00.000Z",
    "source": "The Hacker News",
    "summary": "Authorities in Nigeria have announced the arrest of three \"high-profile internet fraud suspects\" who are alleged to have been involved in phishing attacks targeting major corporations, including the m..."
  },
  {
    "title": "New UEFI Flaw Enables Early-Boot DMA Attacks on ASRock, ASUS, GIGABYTE, MSI Motherboards",
    "link": "https://thehackernews.com/2025/12/new-uefi-flaw-enables-early-boot-dma.html",
    "date": "2025-12-19T08:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Certain motherboard models from vendors like ASRock, ASUSTeK Computer, GIGABYTE, and MSI are affected by a security vulnerability that leaves them susceptible to early-boot direct memory access (DMA) ..."
  }
]