[
  {
    "title": "Why Organizations Are Abandoning Static Secrets for Managed Identities",
    "link": "https://thehackernews.com/2025/10/why-organizations-are-abandoning-static.html",
    "date": "2025-10-23T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "As machine identities explode across cloud environments, enterprises report dramatic productivity gains from eliminating static credentials. And only legacy systems remain the weak link.\nFor decades, ..."
  },
  {
    "title": "“Jingle Thief” Hackers Exploit Cloud Infrastructure to Steal Millions in Gift Cards",
    "link": "https://thehackernews.com/2025/10/jingle-thief-hackers-exploit-cloud.html",
    "date": "2025-10-23T07:52:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have shed light on a cybercriminal group called Jingle Thief that has been observed targeting cloud environments associated with organizations in the retail and consumer serv..."
  },
  {
    "title": "Mideast, African Hackers Target Gov'ts, Banks, Small Retailers",
    "link": "https://www.darkreading.com/cybersecurity-analytics/mea-hackers-govts-finance-smb-retailers",
    "date": "2025-10-23T06:00:00.000Z",
    "source": "Dark Reading",
    "summary": "In the hotly political Middle East, you'd expect hacktivism and disruption of services. But retail attacks?..."
  },
  {
    "title": "Over 250 Magento Stores Hit Overnight as Hackers Exploit New Adobe Commerce Flaw",
    "link": "https://thehackernews.com/2025/10/over-250-magento-stores-hit-overnight.html",
    "date": "2025-10-23T05:47:00.000Z",
    "source": "The Hacker News",
    "summary": "E-commerce security company Sansec has warned that threat actors have begun to exploit a recently disclosed security vulnerability in Adobe Commerce and Magento Open Source platforms, with more than 2..."
  },
  {
    "title": "Critical Lanscope Endpoint Manager Bug Exploited in Ongoing Cyberattacks, CISA Confirms",
    "link": "https://thehackernews.com/2025/10/critical-lanscope-endpoint-manager-bug.html",
    "date": "2025-10-23T05:37:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a critical security flaw impacting Motex Lanscope Endpoint Manager to its Known Exploited Vulnerabilities (KEV) cata..."
  },
  {
    "title": "Lazarus Group Hunts European Drone Manufacturing Data",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/lazarus-group-hunts-european-drone-manufacturing-data",
    "date": "2025-10-23T04:01:00.000Z",
    "source": "Dark Reading",
    "summary": "The campaign is the latest effort by the North Korean threat actor to collect data of strategic interest to Pyongyang...."
  },
  {
    "title": "The Best End User Security Awareness Programs Aren’t About Awareness Anymore",
    "link": "https://www.darkreading.com/cyber-risk/best-end-user-security-awareness-programs-arent-about-awareness-anymore",
    "date": "2025-10-22T22:00:15.000Z",
    "source": "Dark Reading",
    "summary": "The goal is to apply psychology principles to security training to change behaviors and security outcomes...."
  },
  {
    "title": "Iranian hackers targeted over 100 govt orgs with Phoenix backdoor",
    "link": "https://www.bleepingcomputer.com/news/security/iranian-hackers-targeted-over-100-govt-orgs-with-phoenix-backdoor/",
    "date": "2025-10-22T21:19:33.000Z",
    "source": "Bleeping Computer",
    "summary": "State-sponsored Iranian hacker group MuddyWater has targeted more than 100 government entities in attacks that deployed version 4 of the Phoenix backdoor. [...]..."
  },
  {
    "title": "It Takes Only 250 Documents to Poison Any AI Model",
    "link": "https://www.darkreading.com/application-security/only-250-documents-poison-any-ai-model",
    "date": "2025-10-22T20:33:15.000Z",
    "source": "Dark Reading",
    "summary": "Researchers find it takes far less to manipulate a large language model's (LLM) behavior than anyone previously assumed...."
  },
  {
    "title": "Too Many Secrets: Attackers Pounce on Sensitive Data Sprawl",
    "link": "https://www.darkreading.com/cyber-risk/too-many-secrets-attackers-sensitive-data-sprawl",
    "date": "2025-10-22T20:07:29.000Z",
    "source": "Dark Reading",
    "summary": "Hardcoded credentials, access tokens, and API keys are ending up in the darnedest places, prompting a call for organizations to stop over-privileging secrets...."
  },
  {
    "title": "Pwn2Own Day 2: Hackers exploit 56 zero-days for $790,000",
    "link": "https://www.bleepingcomputer.com/news/security/samsung-galaxy-s25-hacked-on-day-two-of-pwn2own-ireland-2025/",
    "date": "2025-10-22T18:52:53.000Z",
    "source": "Bleeping Computer",
    "summary": "Security researchers collected $792,750 in cash after exploiting 56​​​​​​​ unique zero-day vulnerabilities during the second day of the Pwn2Own Ireland 2025 hacking competition. [...]..."
  },
  {
    "title": "Hackers exploiting critical \"SessionReaper\" flaw in Adobe Magento",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploiting-critical-sessionreaper-flaw-in-adobe-magento/",
    "date": "2025-10-22T18:41:37.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are actively exploiting the critical SessionReaper vulnerability (CVE-2025-54236) in Adobe Commerce (formerly Magento) platforms, with hundreds of attempts recorded. [...]..."
  },
  {
    "title": "WhatsApp Secures Ban on NSO Group After 6-Year Legal Battle",
    "link": "https://www.darkreading.com/cyber-risk/whatsapp-ban-nso-group-legal-battle",
    "date": "2025-10-22T17:45:40.000Z",
    "source": "Dark Reading",
    "summary": "NSO Group must pay $4 million in damages and is permanently prohibited from reverse-engineering WhatsApp or creating new accounts after targeting users with spyware...."
  },
  {
    "title": "Canada Fines Cybercrime Friendly Cryptomus $176M",
    "link": "https://krebsonsecurity.com/2025/10/canada-fines-cybercrime-friendly-cryptomus-176m/",
    "date": "2025-10-22T17:21:36.000Z",
    "source": "Krebs on Security",
    "summary": "Financial regulators in Canada this week levied $176 million in fines against Cryptomus, a digital payments platform that supports dozens of Russian cryptocurrency exchanges and websites hawking cyber..."
  },
  {
    "title": "TARmageddon flaw in abandoned Rust library enables RCE attacks",
    "link": "https://www.bleepingcomputer.com/news/security/tarmageddon-flaw-in-abandoned-rust-library-enables-rce-attacks/",
    "date": "2025-10-22T17:21:24.000Z",
    "source": "Bleeping Computer",
    "summary": "A high-severity vulnerability in the now-abandoned async-tar Rust library and its forks can be exploited to gain remote code execution on systems running unpatched software. [...]..."
  },
  {
    "title": "Iran-Linked MuddyWater Targets 100+ Organisations in Global Espionage Campaign",
    "link": "https://thehackernews.com/2025/10/iran-linked-muddywater-targets-100.html",
    "date": "2025-10-22T17:21:00.000Z",
    "source": "The Hacker News",
    "summary": "The Iranian nation-state group known as MuddyWater has been attributed to a new campaign that has leveraged a compromised email account to distribute a backdoor called Phoenix to various organizations..."
  },
  {
    "title": "Ukraine Aid Groups Targeted Through Fake Zoom Meetings and Weaponized PDF Files",
    "link": "https://thehackernews.com/2025/10/ukraine-aid-groups-targeted-through.html",
    "date": "2025-10-22T16:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a coordinated spear-phishing campaign dubbed PhantomCaptcha targeting organizations associated with Ukraine's war relief efforts to deliver a remote..."
  },
  {
    "title": "Meta launches new anti-scam tools for WhatsApp and Messenger",
    "link": "https://www.bleepingcomputer.com/news/security/meta-launches-new-anti-scam-tools-for-whatsapp-and-messenger/",
    "date": "2025-10-22T15:11:54.000Z",
    "source": "Bleeping Computer",
    "summary": "Meta has announced new tools to help WhatsApp and Messenger users protect themselves from potential scams and secure their accounts. [...]..."
  },
  {
    "title": "FinWise data breach shows why encryption is your last defense",
    "link": "https://www.bleepingcomputer.com/news/security/finwise-data-breach-shows-why-encryption-is-your-last-defense/",
    "date": "2025-10-22T15:11:21.000Z",
    "source": "Bleeping Computer",
    "summary": "The FinWise breach shows that when insider threats strike, encryption is the last line of defense. Penta Security's D.AMO platform unites encryption, key management, and access control to keep sensiti..."
  },
  {
    "title": "Russia Pivots, Cracks Down on Resident Hackers",
    "link": "https://www.darkreading.com/threat-intelligence/russia-cracks-down-low-level-hackers",
    "date": "2025-10-22T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Thanks to improving cybersecurity and law enforcement action from the West, Russia's government is reevaluating which cybercriminals it wants to give safe haven from the law...."
  },
  {
    "title": "PhantomCaptcha ClickFix attack targets Ukraine war relief orgs",
    "link": "https://www.bleepingcomputer.com/news/security/phantomcaptcha-clickfix-attack-targets-ukraine-war-relief-orgs/",
    "date": "2025-10-22T13:37:17.000Z",
    "source": "Bleeping Computer",
    "summary": "A spearphishing attack that lasted a single day targeted members of the Ukrainian regional government administration and organizations critical for the war relief effort in Ukraine, including the Inte..."
  },
  {
    "title": "MuddyWater Targets 100+ Gov Entities in MEA With Phoenix Backdoor",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/muddywater-100-gov-entites-mea-phoenix-backdoor",
    "date": "2025-10-22T13:17:58.000Z",
    "source": "Dark Reading",
    "summary": "The Iranian threat group is using a compromised mailbox accessed through NordVPN to send phishing emails that prompt recipients to enable macros...."
  },
  {
    "title": "Chinese Threat Actors Exploit ToolShell SharePoint Flaw Weeks After Microsoft's July Patch",
    "link": "https://thehackernews.com/2025/10/chinese-threat-actors-exploit-toolshell.html",
    "date": "2025-10-22T12:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with ties to China exploited the ToolShell security vulnerability in Microsoft SharePoint to breach a telecommunications company in the Middle East after it was publicly disclosed and pa..."
  },
  {
    "title": "Bridging the Remediation Gap: Introducing Pentera Resolve",
    "link": "https://thehackernews.com/2025/10/bridging-remediation-gap-introducing.html",
    "date": "2025-10-22T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "From Detection to Resolution: Why the Gap Persists\nA critical vulnerability is identified in an exposed cloud asset. Within hours, five different tools alert you about it: your vulnerability scanner, ..."
  },
  {
    "title": "Fake Nethereum NuGet Package Used Homoglyph Trick to Steal Crypto Wallet Keys",
    "link": "https://thehackernews.com/2025/10/fake-nethereum-nuget-package-used.html",
    "date": "2025-10-22T11:43:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have uncovered a new supply chain attack targeting the NuGet package manager with malicious typosquats of Nethereum, a popular Ethereum .NET integration platform, to steal vi..."
  },
  {
    "title": "Sharepoint ToolShell attacks targeted orgs across four continents",
    "link": "https://www.bleepingcomputer.com/news/security/sharepoint-toolshell-attacks-targeted-orgs-across-four-continents/",
    "date": "2025-10-22T10:24:29.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers believed to be associated with China have leveraged the ToolShell vulnerability (CVE-2025-53770) in Microsoft SharePoint in attacks targeting government agencies, universities, telecommunicati..."
  },
  {
    "title": "Verizon: Mobile Blindspot Leads to Needless Data Breaches",
    "link": "https://www.darkreading.com/threat-intelligence/verizon-mobile-blindspot-data-breaches",
    "date": "2025-10-22T10:00:00.000Z",
    "source": "Dark Reading",
    "summary": "People habitually ignore cybersecurity on their phones. Instead of compensating for that, organizations are falling into the very same trap, even though available security options could cut smishing s..."
  },
  {
    "title": "Why You Should Swap Passwords for Passphrases",
    "link": "https://thehackernews.com/2025/10/why-you-should-swap-passwords-for.html",
    "date": "2025-10-22T09:26:00.000Z",
    "source": "The Hacker News",
    "summary": "The advice didn't change for decades: use complex passwords with uppercase, lowercase, numbers, and symbols. The idea is to make passwords harder for hackers to crack via brute force methods. But more..."
  },
  {
    "title": "Researchers Identify PassiveNeuron APT Using Neursite and NeuralExecutor Malware",
    "link": "https://thehackernews.com/2025/10/researchers-identify-passiveneuron-apt.html",
    "date": "2025-10-22T08:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Government, financial, and industrial organizations located in Asia, Africa, and Latin America are the target of a new campaign dubbed PassiveNeuron, according to findings from Kaspersky.\nThe cyber es..."
  },
  {
    "title": "TARmageddon Flaw in Async-Tar Rust Library Could Enable Remote Code Execution",
    "link": "https://thehackernews.com/2025/10/tarmageddon-flaw-in-async-tar-rust.html",
    "date": "2025-10-22T07:05:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a high-severity flaw impacting the popular async-tar Rust library and its forks, including tokio-tar, that could result in remote code execution und..."
  }
]