[
  {
    "title": "Luna Moth extortion hackers pose as IT help desks to breach US firms",
    "link": "https://www.bleepingcomputer.com/news/security/luna-moth-extortion-hackers-pose-as-it-help-desks-to-breach-us-firms/",
    "date": "2025-05-05T22:19:42.000Z",
    "source": "Bleeping Computer",
    "summary": "The data-theft extortion group known as Luna Moth, aka Silent Ransom Group, has ramped up callback phishing campaigns in attacks on legal and financial institutions in the United States. [...]..."
  },
  {
    "title": "AI Domination: RSAC 2025 Social Media Roundup",
    "link": "https://www.darkreading.com/cloud-security/ai-rsac-2025-social-media-roundup",
    "date": "2025-05-05T21:14:45.000Z",
    "source": "Dark Reading",
    "summary": "Documented in a series of social media posts, cybersecurity experts shared with Dark Reading their insights on RSAC 2025 throughout the week...."
  },
  {
    "title": "'Venom Spider' Targets Hiring Managers in Phishing Scheme",
    "link": "https://www.darkreading.com/cyber-risk/venom-spider-phishing-scheme",
    "date": "2025-05-05T21:00:20.000Z",
    "source": "Dark Reading",
    "summary": "Researchers from Arctic Wolf Labs detailed a new spear-phishing campaign that targets hiring managers and recruiters by posing as a job seeker...."
  },
  {
    "title": "New \"Bring Your Own Installer\" EDR bypass used in ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/new-bring-your-own-installer-edr-bypass-used-in-ransomware-attack/",
    "date": "2025-05-05T20:28:34.000Z",
    "source": "Bleeping Computer",
    "summary": "A new \"Bring Your Own Installer\" EDR bypass technique is exploited in attacks to bypass SentinelOne's tamper protection feature, allowing threat actors to disable endpoint detection and response (EDR)..."
  },
  {
    "title": "Phony Hacktivist Pleads Guilty to Disney Data Leak",
    "link": "https://www.darkreading.com/threat-intelligence/phony-hacktivist-pleads-guilty-disney-leak",
    "date": "2025-05-05T19:20:14.000Z",
    "source": "Dark Reading",
    "summary": "After stealing sensitive data from Disney, Ryan Mitchell Kramer claimed to be part of a Russian hacktivist group protecting artists' rights and ensuring they receive fair compensation for their work...."
  },
  {
    "title": "Microsoft finds default Kubernetes Helm charts can expose data",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-finds-default-kubernetes-helm-charts-can-expose-data/",
    "date": "2025-05-05T19:17:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft warns about the security risks posed by default configurations in Kubernetes deployments, particularly those using out-of-the-box Helm charts, which could publicly expose sensitive data. [....."
  },
  {
    "title": "Unofficial Signal app used by Trump officials investigates hack",
    "link": "https://www.bleepingcomputer.com/news/security/unofficial-signal-app-used-by-trump-officials-investigates-hack/",
    "date": "2025-05-05T19:11:17.000Z",
    "source": "Bleeping Computer",
    "summary": "TeleMessage, an Israeli company that sells an unofficial Signal message archiving tool used by some U.S. government officials, has suspended all services after reportedly being hacked. [...]..."
  },
  {
    "title": "Darcula PhaaS steals 884,000 credit cards via phishing texts",
    "link": "https://www.bleepingcomputer.com/news/security/darcula-phaas-steals-884-000-credit-cards-via-phishing-texts/",
    "date": "2025-05-05T17:31:32.000Z",
    "source": "Bleeping Computer",
    "summary": "The Darcula phishing-as-a-service (PhaaS) platform stole 884,000 credit cards from 13 million clicks on malicious links sent via text messages to targets worldwide. [...]..."
  },
  {
    "title": "Wormable AirPlay Flaws Enable Zero-Click RCE on Apple Devices via Public Wi-Fi",
    "link": "https://thehackernews.com/2025/05/wormable-airplay-flaws-enable-zero.html",
    "date": "2025-05-05T17:06:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a series of now-patched security vulnerabilities in Apple's AirPlay protocol that, if successfully exploited, could enable an attacker to take over susceptible..."
  },
  {
    "title": "A whopping 94% of leaked passwords are not unique - will you people ever learn?",
    "link": "https://www.zdnet.com/article/a-whopping-94-of-leaked-passwords-are-not-unique-will-you-people-ever-learn/",
    "date": "2025-05-05T16:12:10.000Z",
    "source": "ZDNet Security",
    "summary": "Your lazy passwords are putting you and your company at risk...."
  },
  {
    "title": "Microsoft is killing Skype today, pushes users to Teams",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-killing-skype-today-pushes-users-to-teams/",
    "date": "2025-05-05T16:12:07.000Z",
    "source": "Bleeping Computer",
    "summary": "The Skype video call and messaging service is shutting down today, 14 years after replacing Microsoft's Windows Live Messenger. [...]..."
  },
  {
    "title": "Commvault CVE-2025-34028 Added to CISA KEV After Active Exploitation Confirmed",
    "link": "https://thehackernews.com/2025/05/commvault-cve-2025-34028-added-to-cisa.html",
    "date": "2025-05-05T16:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added a maximum-severity security flaw impacting Commvault Command Center to its Known Exploited Vulnerabilities (KEV) catalog, a l..."
  },
  {
    "title": "UK shares security tips after major retail cyberattacks",
    "link": "https://www.bleepingcomputer.com/news/security/uk-shares-security-tips-after-major-retail-cyberattacks/",
    "date": "2025-05-05T15:19:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Following three high-profile cyberattacks impacting major UK retailers, the country's National Cyber Security Centre (NCSC) has published guidance that all companies are advised to follow to strengthe..."
  },
  {
    "title": "How to Prevent AI Agents From Becoming the Bad Guys",
    "link": "https://www.darkreading.com/vulnerabilities-threats/prevent-ai-agents-becoming-bad-guys",
    "date": "2025-05-05T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "When designed with strong governance principles, AI can drive innovation while maintaining the people's trust and security...."
  },
  {
    "title": "10 passkey survival tips: Prepare for your passwordless future now",
    "link": "https://www.zdnet.com/article/10-passkey-survival-tips-prepare-for-your-passwordless-future-now/",
    "date": "2025-05-05T12:58:00.000Z",
    "source": "ZDNet Security",
    "summary": "Although passkeys remain an evolving ecosystem, we'd be wise to embrace tomorrow's authentication standard today. Here are ZDNET's 10 recommendations for reaching passkey paradise...."
  },
  {
    "title": "7 ways to lock down your phone's security - before it's too late",
    "link": "https://www.zdnet.com/article/7-ways-to-lock-down-your-phones-security-before-its-too-late/",
    "date": "2025-05-05T12:44:00.000Z",
    "source": "ZDNet Security",
    "summary": "From border crossings to data breaches, there are more reasons than ever to protect your smartphone. Here's a practical guide to securing your device and your digital life...."
  },
  {
    "title": "Microsoft silently fixes Start menu bug affecting Windows 10 PCs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-silently-fixes-start-menu-bug-affecting-windows-10-pcs/",
    "date": "2025-05-05T11:48:57.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has silently fixed an issue that broke Start Menu jump lists for all apps on systems running Windows 10, version 22H2. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Nation-State Hacks, Spyware Alerts, Deepfake Malware, Supply Chain Backdoors",
    "link": "https://thehackernews.com/2025/05/weekly-recap-nation-state-hacks-spyware.html",
    "date": "2025-05-05T11:29:00.000Z",
    "source": "The Hacker News",
    "summary": "What if attackers aren't breaking in—they're already inside, watching, and adapting?\nThis week showed a sharp rise in stealth tactics built for long-term access and silent control. AI is being used to..."
  },
  {
    "title": "Perfection is a Myth. Leverage Isn't: How Small Teams Can Secure Their Google Workspace",
    "link": "https://thehackernews.com/2025/05/perfection-is-myth-leverage-isnt-how.html",
    "date": "2025-05-05T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Let’s be honest: if you're one of the first (or the first) security hires at a small or midsize business, chances are you're also the unofficial CISO, SOC, IT Help Desk, and whatever additional roles ..."
  },
  {
    "title": "Microsoft: Windows 11 24H2 now ready to rollout to everyone",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-24h2-now-ready-to-rollout-to-everyone/",
    "date": "2025-05-05T10:53:38.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft announced over the weekend that the Windows 11 24H2 update is ready to roll out to all compatible PCs, excluding those with safeguard holds. [...]..."
  },
  {
    "title": "Golden Chickens Deploy TerraStealerV2 to Steal Browser Credentials and Crypto Wallet Data",
    "link": "https://thehackernews.com/2025/05/golden-chickens-deploy-terrastealerv2.html",
    "date": "2025-05-05T05:39:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actors known as Golden Chickens have been attributed to two new malware families dubbed TerraStealerV2 and TerraLogger, suggesting continued development efforts to fine-tune and diversify t..."
  },
  {
    "title": "OpenAI document explains when to use each ChatGPT model",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-document-explains-when-to-use-each-chatgpt-model/",
    "date": "2025-05-04T17:59:53.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI admitted that it can be confusing for users to choose between all the different models, but the company has quietly published a document that makes it easier to understand ChatGPT. [...]..."
  },
  {
    "title": "StealC malware enhanced with stealth upgrades and data theft tools",
    "link": "https://www.bleepingcomputer.com/news/security/stealc-malware-enhanced-with-stealth-upgrades-and-data-theft-tools/",
    "date": "2025-05-04T14:11:21.000Z",
    "source": "Bleeping Computer",
    "summary": "The creators of StealC, a widely-used information stealer and malware downloader, have released its second major version, bringing multiple stealth and data theft enhancements. [...]..."
  },
  {
    "title": "Google NotebookLM is now using Gemini 2.5 Flash",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-notebooklm-is-now-using-gemini-25-flash/",
    "date": "2025-05-03T21:21:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Google NotebookLM, which is a research and note-taking AI tool, is getting upgraded to Gemini 2.5 Flash. [...]..."
  },
  {
    "title": "Malicious Go Modules Deliver Disk-Wiping Linux Malware in Advanced Supply Chain Attack",
    "link": "https://thehackernews.com/2025/05/malicious-go-modules-deliver-disk.html",
    "date": "2025-05-03T14:31:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered three malicious Go modules that include obfuscated code to fetch next-stage payloads that can irrevocably overwrite a Linux system's primary disk and render i..."
  },
  {
    "title": "Microsoft ends Authenticator password autofill, moves users to Edge",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-ends-authenticator-password-autofill-moves-users-to-edge/",
    "date": "2025-05-03T14:16:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has announced that it will discontinue the password storage and autofill feature in the Authenticator app starting in July and will complete the deprecation in August 2025. [...]..."
  },
  {
    "title": "Iranian Hackers Maintain 2-Year Access to Middle East CNI via VPN Flaws and Malware",
    "link": "https://thehackernews.com/2025/05/iranian-hackers-maintain-2-year-access.html",
    "date": "2025-05-03T09:33:00.000Z",
    "source": "The Hacker News",
    "summary": "An Iranian state-sponsored threat group has been attributed to a long-term cyber intrusion aimed at a critical national infrastructure (CNI) in the Middle East that lasted nearly two years.\nThe activi..."
  },
  {
    "title": "U.S. Charges Yemeni Hacker Behind Black Kingdom Ransomware Targeting 1,500 Systems",
    "link": "https://thehackernews.com/2025/05/us-charges-yemeni-hacker-behind-black.html",
    "date": "2025-05-03T07:06:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of Justice (DoJ) on Thursday announced charges against a 36-year-old Yemeni national for allegedly deploying the Black Kingdom ransomware against global targets, including business..."
  },
  {
    "title": "UK Retailers Reeling From Likely Ransomware Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/uk-retailers-reeling-ransomware-attacks",
    "date": "2025-05-02T20:36:07.000Z",
    "source": "Dark Reading",
    "summary": "A series of cyberattacks have struck multiple major British retailers in recent weeks, and a ransomware gang has reportedly claimed responsibility...."
  },
  {
    "title": "What NY's New Security Rules Mean for Finance Firms",
    "link": "https://www.darkreading.com/cybersecurity-operations/nydfs-rules-businesses-ny",
    "date": "2025-05-02T19:59:23.000Z",
    "source": "Dark Reading",
    "summary": "According to the New York Department of Financial Services, finance companies operating in New York — even if not based there — must implement a variety of protections against unauthorized access to I..."
  }
]