[
  {
    "title": "Taiwan NSB Alerts Public on Data Risks from TikTok, Weibo, and RedNote Over China Ties",
    "link": "https://thehackernews.com/2025/07/taiwan-nsb-alerts-public-on-data-risks.html",
    "date": "2025-07-05T06:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Taiwan's National Security Bureau (NSB) has warned that China-developed applications like RedNote (aka Xiaohongshu), Weibo, TikTok, WeChat, and Baidu Cloud pose security risks due to excessive data co..."
  },
  {
    "title": "Alert: Exposed JDWP Interfaces Lead to Crypto Mining, Hpingbot Targets SSH for DDoS",
    "link": "https://thehackernews.com/2025/07/alert-exposed-jdwp-interfaces-lead-to.html",
    "date": "2025-07-05T05:44:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors are weaponizing exposed Java Debug Wire Protocol (JDWP) interfaces to obtain code execution capabilities and deploy cryptocurrency miners on compromised hosts.\n\"The attacker used a modif..."
  },
  {
    "title": "Google's AI video maker Veo 3 is now available via $20 Gemini",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/googles-ai-video-maker-veo-3-is-now-available-via-20-gemini/",
    "date": "2025-07-04T23:17:02.000Z",
    "source": "Bleeping Computer",
    "summary": "Google says Veo 3, which is the company's state-of-the-art video generator, is now shipping to everyone using the Gemini app with a $20 subscription. [...]..."
  },
  {
    "title": " ChatGPT Deep Research tests new connectors for more context",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-deep-research-tests-new-connectors-for-more-context/",
    "date": "2025-07-04T22:20:14.000Z",
    "source": "Bleeping Computer",
    "summary": "ChatGPT Deep Research, which is an AI research tool to automate research, is getting support for new connectors (integrations), including Slack. [...]..."
  },
  {
    "title": "Ingram Micro suffers global outage as internal systems inaccessible",
    "link": "https://www.bleepingcomputer.com/news/security/ingram-micro-suffers-global-outage-as-internal-systems-inaccessible/",
    "date": "2025-07-04T15:14:03.000Z",
    "source": "Bleeping Computer",
    "summary": "IT giant Ingram Micro is experiencing a global outage that is impacting its websites and internal systems, with customers concerned that it may be a cyberattack after the company remains silent on the..."
  },
  {
    "title": "Hacker leaks Telefónica data allegedly stolen in a new breach",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-leaks-telef-nica-data-allegedly-stolen-in-a-new-breach/",
    "date": "2025-07-04T15:11:26.000Z",
    "source": "Bleeping Computer",
    "summary": "A hacker is threatening to leak 106GB of data allegedly stolen from Spanish telecommunications company Telefónica in a breach that the company did not acknowledge. [...]..."
  },
  {
    "title": "NightEagle APT Exploits Microsoft Exchange Flaw to Target China's Military and Tech Sectors",
    "link": "https://thehackernews.com/2025/07/nighteagle-apt-exploits-microsoft.html",
    "date": "2025-07-04T12:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have shed light on a previously undocumented threat actor called NightEagle (aka APT-Q-95) that has been observed targeting Microsoft Exchange servers as a part of a zero-day..."
  },
  {
    "title": "Your AI Agents Might Be Leaking Data — Watch this Webinar to Learn How to Stop It",
    "link": "https://thehackernews.com/2025/07/your-ai-agents-might-be-leaking-data.html",
    "date": "2025-07-04T09:31:00.000Z",
    "source": "The Hacker News",
    "summary": "Generative AI is changing how businesses work, learn, and innovate. But beneath the surface, something dangerous is happening. AI agents and custom GenAI workflows are creating new, hidden ways for se..."
  },
  {
    "title": "Critical Sudo Vulnerabilities Let Local Users Gain Root Access on Linux, Impacting Major Distros",
    "link": "https://thehackernews.com/2025/07/critical-sudo-vulnerabilities-let-local.html",
    "date": "2025-07-04T09:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed two security flaws in the Sudo command-line utility for Linux and Unix-like operating systems that could enable local attackers to escalate their privileges to..."
  },
  {
    "title": "Google Ordered to Pay $314M for Misusing Android Users' Cellular Data Without Permission",
    "link": "https://thehackernews.com/2025/07/google-ordered-to-pay-314m-for-misusing.html",
    "date": "2025-07-04T07:17:00.000Z",
    "source": "The Hacker News",
    "summary": "Google has been ordered by a court in the U.S. state of California to pay $314 million over charges that it misused Android device users' cellular data when they were idle to passively send informatio..."
  },
  {
    "title": "Leaks hint at Operator-like tool in ChatGPT ahead of GPT-5 launch",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/leaks-hint-at-operator-like-tool-in-chatgpt-ahead-of-gpt-5-launch/",
    "date": "2025-07-03T23:22:31.000Z",
    "source": "Bleeping Computer",
    "summary": "A few new code references in the ChatGPT web app and Android point to an Operator-like tool in GPT's chain of thoughts. [...]..."
  },
  {
    "title": "xAI prepares Grok 4 Code as it plans to take on Claude and Gemini",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/xai-prepares-grok-4-code-as-it-plans-to-take-on-claude-and-gemini/",
    "date": "2025-07-03T19:00:18.000Z",
    "source": "Bleeping Computer",
    "summary": "xAI is preparing the rollout of Grok 4, which replaces Grok 3 as the new state-of-the-art model. [...]..."
  },
  {
    "title": "Police dismantles investment fraud ring stealing €10 million",
    "link": "https://www.bleepingcomputer.com/news/legal/police-dismantles-investment-fraud-ring-stealing-10-million/",
    "date": "2025-07-03T17:53:21.000Z",
    "source": "Bleeping Computer",
    "summary": "The Spanish police have dismantled a large-scale investment fraud operation based in the country, which has caused cumulative damages exceeding €10 million ($11.8M). [...]..."
  },
  {
    "title": "Grafana releases critical security update for Image Renderer plugin",
    "link": "https://www.bleepingcomputer.com/news/security/grafana-releases-critical-security-update-for-image-renderer-plugin/",
    "date": "2025-07-03T16:16:59.000Z",
    "source": "Bleeping Computer",
    "summary": "Grafana Labs has addressed four Chromium vulnerabilities in critical security updates for the Grafana Image Renderer plugin and Synthetic Monitoring Agent. [...]..."
  },
  {
    "title": "Big Tech’s Mixed Response to U.S. Treasury Sanctions",
    "link": "https://krebsonsecurity.com/2025/07/big-techs-mixed-response-to-u-s-treasury-sanctions/",
    "date": "2025-07-03T16:06:05.000Z",
    "source": "Krebs on Security",
    "summary": "In May 2025, the U.S. government sanctioned a Chinese national for operating a cloud provider linked to the majority of virtual currency investment scam websites reported to the FBI. But more than a m..."
  },
  {
    "title": "Massive Android Fraud Operations Uncovered: IconAds, Kaleidoscope, SMS Malware, NFC Scams",
    "link": "https://thehackernews.com/2025/07/mobile-security-alert-352-iconads-fraud.html",
    "date": "2025-07-03T16:02:00.000Z",
    "source": "The Hacker News",
    "summary": "A mobile ad fraud operation dubbed IconAds that consisted of 352 Android apps has been disrupted, according to a new report from HUMAN.\nThe identified apps were designed to load out-of-context ads on ..."
  },
  {
    "title": "New Cyber Blueprint Aims to Guide Organizations on AI Journey",
    "link": "https://www.darkreading.com/cyber-risk/cyber-blueprint-guide-ai-journey",
    "date": "2025-07-03T15:38:25.000Z",
    "source": "Dark Reading",
    "summary": "Deloitte's new blueprint looks to bridge the gap between the massive push for AI adoption and a lack of preparedness among leaders and employees...."
  },
  {
    "title": "IdeaLab confirms data stolen in ransomware attack last year",
    "link": "https://www.bleepingcomputer.com/news/security/idealab-confirms-data-stolen-in-ransomware-attack-last-year/",
    "date": "2025-07-03T15:14:56.000Z",
    "source": "Bleeping Computer",
    "summary": "IdeaLab is notifying individuals impacted by a data breach incident last October when hackers accessed sensitive information. [...]..."
  },
  {
    "title": "Microsoft investigates ongoing SharePoint Online access issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-ongoing-sharepoint-online-access-issues/",
    "date": "2025-07-03T14:53:43.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft is investigating an ongoing incident causing intermittent issues for users attempting to access SharePoint Online sites. [...]..."
  },
  {
    "title": "Dark Web Vendors Shift to Third Parties, Supply Chains",
    "link": "https://www.darkreading.com/threat-intelligence/dark-web-vendors-third-parties-supply-chains",
    "date": "2025-07-03T13:30:00.000Z",
    "source": "Dark Reading",
    "summary": "As attacks on software supply chains and third parties increase, more data on critical software and infrastructure services is being advertised and sold on the Dark Web...."
  },
  {
    "title": "Criminals Sending QR Codes in Phishing, Malware Campaigns",
    "link": "https://www.darkreading.com/endpoint-security/criminals-send-qr-codes-phishing",
    "date": "2025-07-03T13:23:44.000Z",
    "source": "Dark Reading",
    "summary": "The Anti-Phishing Working Group observed how attackers are increasingly abusing QR codes to conduct phishing attacks or to trick users into downloading malware...."
  },
  {
    "title": "IDE Extensions Pose Hidden Risks to Software Supply Chain",
    "link": "https://www.darkreading.com/application-security/ide-extensions-risks-software-supply-chain",
    "date": "2025-07-03T13:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Malicious extensions can be engineered to bypass verification checks for popular integrated development environments, according to research from OX Security...."
  },
  {
    "title": "Attackers Impersonate Top Brands in Callback Phishing",
    "link": "https://www.darkreading.com/endpoint-security/attackers-top-brands-callback-phishing",
    "date": "2025-07-03T12:30:00.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft, PayPal, Docusign, and others are among the trusted brands threat actors use in socially engineered scams that try to get victims to call adversary-controlled phone numbers...."
  },
  {
    "title": "Microsoft: Exchange Server Subscription Edition now available",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-server-subscription-edition-now-available/",
    "date": "2025-07-03T12:03:23.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has announced that the Exchange Server Subscription Edition (SE) is now available to all customers of its enterprise email service. [...]..."
  },
  {
    "title": "Hunters International ransomware shuts down, releases free decryptors",
    "link": "https://www.bleepingcomputer.com/news/security/hunters-international-ransomware-shuts-down-after-world-leaks-rebrand/",
    "date": "2025-07-03T10:53:21.000Z",
    "source": "Bleeping Computer",
    "summary": "​The Hunters International Ransomware-as-a-Service (RaaS) operation announced today that it has officially closed down its operations and will offer free decryptors to help victims recover their data ..."
  },
  {
    "title": "Over 40 Malicious Firefox Extensions Target Cryptocurrency Wallets, Stealing User Assets",
    "link": "https://thehackernews.com/2025/07/over-40-malicious-firefox-extensions.html",
    "date": "2025-07-03T10:53:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have uncovered over 40 malicious browser extensions for Mozilla Firefox that are designed to steal cryptocurrency wallet secrets, putting users' digital assets at risk.\n\"Thes..."
  },
  {
    "title": "Your Brother printer might have a critical security flaw - how to check and what to do next",
    "link": "https://www.zdnet.com/article/your-brother-printer-might-have-a-critical-security-flaw-how-to-check-and-what-to-do-next/",
    "date": "2025-07-03T10:30:14.000Z",
    "source": "ZDNet Security",
    "summary": "If your Brother printer is impacted, it's crucial to change the default admin password immediately. Here's how to do it...."
  },
  {
    "title": "The Hidden Weaknesses in AI SOC Tools that No One Talks About",
    "link": "https://thehackernews.com/2025/07/the-hidden-weaknesses-in-ai-soc-tools.html",
    "date": "2025-07-03T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "If you’re evaluating AI-powered SOC platforms, you’ve likely seen bold claims: faster triage, smarter remediation, and less noise. But under the hood, not all AI is created equal. Many solutions rely ..."
  },
  {
    "title": "Chinese Hackers Exploit Ivanti CSA Zero-Days in Attacks on French Government, Telecoms",
    "link": "https://thehackernews.com/2025/07/chinese-hackers-exploit-ivanti-csa-zero.html",
    "date": "2025-07-03T09:25:00.000Z",
    "source": "The Hacker News",
    "summary": "The French cybersecurity agency on Tuesday revealed that a number of entities spanning governmental, telecommunications, media, finance, and transport sectors in the country were impacted by a malicio..."
  },
  {
    "title": "Critical Cisco Vulnerability in Unified CM Grants Root Access via Static Credentials",
    "link": "https://thehackernews.com/2025/07/critical-cisco-vulnerability-in-unified.html",
    "date": "2025-07-03T04:24:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has released security updates to address a maximum-severity security flaw in Unified Communications Manager (Unified CM) and Unified Communications Manager Session Management Edition (Unified CM..."
  }
]