[
  {
    "title": "7 ways to lock down your phone's security - before it's too late",
    "link": "https://www.zdnet.com/article/7-ways-to-lock-down-your-phones-security-before-its-too-late/",
    "date": "2025-05-05T12:44:00.000Z",
    "source": "ZDNet Security",
    "summary": "From border crossings to data breaches, there are more reasons than ever to protect your smartphone. Here's a practical guide to securing your device and your digital life...."
  },
  {
    "title": "Microsoft silently fixes Start menu bug affecting Windows 10 PCs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-silently-fixes-start-menu-bug-affecting-windows-10-pcs/",
    "date": "2025-05-05T11:48:57.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has silently fixed an issue that broke Start Menu jump lists for all apps on systems running Windows 10, version 22H2. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Nation-State Hacks, Spyware Alerts, Deepfake Malware, Supply Chain Backdoors",
    "link": "https://thehackernews.com/2025/05/weekly-recap-nation-state-hacks-spyware.html",
    "date": "2025-05-05T11:29:00.000Z",
    "source": "The Hacker News",
    "summary": "What if attackers aren't breaking in—they're already inside, watching, and adapting?\nThis week showed a sharp rise in stealth tactics built for long-term access and silent control. AI is being used to..."
  },
  {
    "title": "Perfection is a Myth. Leverage Isn't: How Small Teams Can Secure Their Google Workspace",
    "link": "https://thehackernews.com/2025/05/perfection-is-myth-leverage-isnt-how.html",
    "date": "2025-05-05T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Let’s be honest: if you're one of the first (or the first) security hires at a small or midsize business, chances are you're also the unofficial CISO, SOC, IT Help Desk, and whatever additional roles ..."
  },
  {
    "title": "Microsoft: Windows 11 24H2 now ready to rollout to everyone",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-24h2-now-ready-to-rollout-to-everyone/",
    "date": "2025-05-05T10:53:38.000Z",
    "source": "Bleeping Computer",
    "summary": "​Microsoft announced over the weekend that the Windows 11 24H2 update is ready to roll out to all compatible PCs, excluding those with safeguard holds. [...]..."
  },
  {
    "title": "Golden Chickens Deploy TerraStealerV2 to Steal Browser Credentials and Crypto Wallet Data",
    "link": "https://thehackernews.com/2025/05/golden-chickens-deploy-terrastealerv2.html",
    "date": "2025-05-05T05:39:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actors known as Golden Chickens have been attributed to two new malware families dubbed TerraStealerV2 and TerraLogger, suggesting continued development efforts to fine-tune and diversify t..."
  },
  {
    "title": "OpenAI document explains when to use each ChatGPT model",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-document-explains-when-to-use-each-chatgpt-model/",
    "date": "2025-05-04T17:59:53.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI admitted that it can be confusing for users to choose between all the different models, but the company has quietly published a document that makes it easier to understand ChatGPT. [...]..."
  },
  {
    "title": "StealC malware enhanced with stealth upgrades and data theft tools",
    "link": "https://www.bleepingcomputer.com/news/security/stealc-malware-enhanced-with-stealth-upgrades-and-data-theft-tools/",
    "date": "2025-05-04T14:11:21.000Z",
    "source": "Bleeping Computer",
    "summary": "The creators of StealC, a widely-used information stealer and malware downloader, have released its second major version, bringing multiple stealth and data theft enhancements. [...]..."
  },
  {
    "title": "Google NotebookLM is now using Gemini 2.5 Flash",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-notebooklm-is-now-using-gemini-25-flash/",
    "date": "2025-05-03T21:21:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Google NotebookLM, which is a research and note-taking AI tool, is getting upgraded to Gemini 2.5 Flash. [...]..."
  },
  {
    "title": "Malicious Go Modules Deliver Disk-Wiping Linux Malware in Advanced Supply Chain Attack",
    "link": "https://thehackernews.com/2025/05/malicious-go-modules-deliver-disk.html",
    "date": "2025-05-03T14:31:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered three malicious Go modules that include obfuscated code to fetch next-stage payloads that can irrevocably overwrite a Linux system's primary disk and render i..."
  },
  {
    "title": "Microsoft ends Authenticator password autofill, moves users to Edge",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-ends-authenticator-password-autofill-moves-users-to-edge/",
    "date": "2025-05-03T14:16:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has announced that it will discontinue the password storage and autofill feature in the Authenticator app starting in July and will complete the deprecation in August 2025. [...]..."
  },
  {
    "title": "Iranian Hackers Maintain 2-Year Access to Middle East CNI via VPN Flaws and Malware",
    "link": "https://thehackernews.com/2025/05/iranian-hackers-maintain-2-year-access.html",
    "date": "2025-05-03T09:33:00.000Z",
    "source": "The Hacker News",
    "summary": "An Iranian state-sponsored threat group has been attributed to a long-term cyber intrusion aimed at a critical national infrastructure (CNI) in the Middle East that lasted nearly two years.\nThe activi..."
  },
  {
    "title": "U.S. Charges Yemeni Hacker Behind Black Kingdom Ransomware Targeting 1,500 Systems",
    "link": "https://thehackernews.com/2025/05/us-charges-yemeni-hacker-behind-black.html",
    "date": "2025-05-03T07:06:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of Justice (DoJ) on Thursday announced charges against a 36-year-old Yemeni national for allegedly deploying the Black Kingdom ransomware against global targets, including business..."
  },
  {
    "title": "UK Retailers Reeling From Likely Ransomware Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/uk-retailers-reeling-ransomware-attacks",
    "date": "2025-05-02T20:36:07.000Z",
    "source": "Dark Reading",
    "summary": "A series of cyberattacks have struck multiple major British retailers in recent weeks, and a ransomware gang has reportedly claimed responsibility...."
  },
  {
    "title": "What NY's New Security Rules Mean for Finance Firms",
    "link": "https://www.darkreading.com/cybersecurity-operations/nydfs-rules-businesses-ny",
    "date": "2025-05-02T19:59:23.000Z",
    "source": "Dark Reading",
    "summary": "According to the New York Department of Financial Services, finance companies operating in New York — even if not based there — must implement a variety of protections against unauthorized access to I..."
  },
  {
    "title": "Co-op confirms data theft after DragonForce ransomware claims attack",
    "link": "https://www.bleepingcomputer.com/news/security/co-op-confirms-data-theft-after-dragonforce-ransomware-claims-attack/",
    "date": "2025-05-02T19:52:50.000Z",
    "source": "Bleeping Computer",
    "summary": "The Co-op cyberattack is far worse than initially reported, with the company now confirming that data was stolen for a significant number of current and past customers. [...]..."
  },
  {
    "title": "Magento supply chain attack compromises hundreds of e-stores",
    "link": "https://www.bleepingcomputer.com/news/security/magento-supply-chain-attack-compromises-hundreds-of-e-stores/",
    "date": "2025-05-02T18:09:55.000Z",
    "source": "Bleeping Computer",
    "summary": "A supply chain attack involving 21 backdoored Magento extensions has compromised between 500 and 1,000 e-commerce stores, including one belonging to a $40 billion multinational. [...]..."
  },
  {
    "title": "Attackers Ramp Up Efforts Targeting Developer Secrets",
    "link": "https://www.darkreading.com/threat-intelligence/attackers-targeting-developer-secrets",
    "date": "2025-05-02T16:29:28.000Z",
    "source": "Dark Reading",
    "summary": "Software teams need to follow security best practices to eliminate the leak of secrets, as threat actors increase their scanning for configuration and repository files...."
  },
  {
    "title": "Despite Arrests, Scattered Spider Continues High-Profile Hacking",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/despite-arrests-scattered-spider-continues-hacking",
    "date": "2025-05-02T15:59:49.000Z",
    "source": "Dark Reading",
    "summary": "While law enforcement has identified and arrested several alleged members, the notorious threat group continues to wreak havoc...."
  },
  {
    "title": "US indicts Black Kingdom ransomware admin for Microsoft Exchange attacks",
    "link": "https://www.bleepingcomputer.com/news/security/us-indicts-black-kingdom-ransomware-admin-for-microsoft-exchange-attacks/",
    "date": "2025-05-02T14:32:11.000Z",
    "source": "Bleeping Computer",
    "summary": "A 36-year-old Yemeni national, who is believed to be the developer and primary operator of 'Black Kingdom' ransomware, has been indicted by the United States for conducting 1,500 attacks on Microsoft ..."
  },
  {
    "title": "Cut CISA and Everyone Pays for It",
    "link": "https://www.darkreading.com/vulnerabilities-threats/cut-cisa-everyone-pays",
    "date": "2025-05-02T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Gutting CISA won't just lose us a partner. It will lose us momentum. And in this game, that's when things break...."
  },
  {
    "title": "UK NCSC: Cyberattacks impacting UK retailers are a wake-up call",
    "link": "https://www.bleepingcomputer.com/news/security/uk-ncsc-cyberattacks-impacting-uk-retailers-are-a-wake-up-call/",
    "date": "2025-05-02T13:57:31.000Z",
    "source": "Bleeping Computer",
    "summary": "The United Kingdom's National Cyber Security Centre warned that ongoing cyberattacks impacting multiple UK retail chains should be taken as a \"wake-up call.\" [...]..."
  },
  {
    "title": "TikTok Slammed With €530 Million GDPR Fine for Sending E.U. Data to China",
    "link": "https://thehackernews.com/2025/05/tiktok-slammed-with-530-million-gdpr.html",
    "date": "2025-05-02T12:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Ireland's Data Protection Commission (DPC) on Friday fined popular video-sharing platform TikTok €530 million ($601 million) for infringing data protection regulations in the region by transferring Eu..."
  },
  {
    "title": "TikTok fined €530 million for sending European user data to China",
    "link": "https://www.bleepingcomputer.com/news/security/tiktok-fined-530-million-for-sending-european-user-data-to-china/",
    "date": "2025-05-02T12:14:27.000Z",
    "source": "Bleeping Computer",
    "summary": "The Irish Data Protection Commission (DPC) has fined TikTok €530 million (over $601 million) for illegally transferring the personal data of users in the European Economic Area (EEA) to China, violati..."
  },
  {
    "title": "How to Automate CVE and Vulnerability Advisory Response with Tines",
    "link": "https://thehackernews.com/2025/05/how-to-automate-cve-and-vulnerability.html",
    "date": "2025-05-02T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Run by the team at workflow orchestration and AI platform Tines, the Tines library features pre-built workflows shared by security practitioners from across the community - all free to import and depl..."
  },
  {
    "title": "Is your Roku TV spying on you? Likely, but here's how you can take back control",
    "link": "https://www.zdnet.com/article/is-your-roku-tv-spying-on-you-likely-but-heres-how-you-can-take-back-control/",
    "date": "2025-05-02T09:30:18.000Z",
    "source": "ZDNet Security",
    "summary": "Your Amazon Fire Stick, Chromecast, and other streaming devices gather personal data for different purposes. If that concerns you, here's how to regain some control...."
  },
  {
    "title": "MintsLoader Drops GhostWeaver via Phishing, ClickFix — Uses DGA, TLS for Stealth Attacks",
    "link": "https://thehackernews.com/2025/05/mintsloader-drops-ghostweaver-via.html",
    "date": "2025-05-02T08:57:00.000Z",
    "source": "The Hacker News",
    "summary": "The malware loader known as MintsLoader has been used to deliver a PowerShell-based remote access trojan called GhostWeaver.\n\"MintsLoader operates through a multi-stage infection chain involving obfus..."
  },
  {
    "title": "Microsoft Sets Passkeys Default for New Accounts; 15 Billion Users Gain Passwordless Support",
    "link": "https://thehackernews.com/2025/05/microsoft-sets-passkeys-default-for-new.html",
    "date": "2025-05-02T06:40:00.000Z",
    "source": "The Hacker News",
    "summary": "A year after Microsoft announced passkeys support for consumer accounts, the tech giant has announced a big change that pushes individuals signing up for new accounts to use the phishing-resistant aut..."
  },
  {
    "title": "Best travel VPNs 2025: The top travel VPNs for avoiding geo-blocks and censorship",
    "link": "https://www.zdnet.com/article/best-travel-vpn/",
    "date": "2025-05-02T00:54:16.000Z",
    "source": "ZDNet Security",
    "summary": "VPNs shield you from spying and online tracking. Our favorite travel VPNs offer fast speeds, massive server networks, unlimited connections, and more...."
  },
  {
    "title": "xAI Dev Leaks API Key for Private SpaceX, Tesla LLMs",
    "link": "https://krebsonsecurity.com/2025/05/xai-dev-leaks-api-key-for-private-spacex-tesla-llms/",
    "date": "2025-05-02T00:52:00.000Z",
    "source": "Krebs on Security",
    "summary": "A employee at Elon Musk's artificial intelligence company xAI leaked a private key on GitHub that for the past two months could have allowed anyone to query private xAI large language models (LLMs) wh..."
  }
]