[
  {
    "title": "[Virtual Event] Shields Up: Key Technologies Reshaping Cybersecurity Defenses",
    "link": "https://www.darkreading.com/events/shields-up-key-technologies-reshaping-cybersecurity-defenses",
    "date": "2026-02-10T18:29:26.269Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "DPRK Operatives Impersonate Professionals on LinkedIn to Infiltrate Companies",
    "link": "https://thehackernews.com/2026/02/dprk-operatives-impersonate.html",
    "date": "2026-02-10T17:44:00.000Z",
    "source": "The Hacker News",
    "summary": "The information technology (IT) workers associated with the Democratic People's Republic of Korea (DPRK) are now applying to remote positions using real LinkedIn accounts of individuals they're impers..."
  },
  {
    "title": "Volvo Group North America customer data exposed in Conduent hack",
    "link": "https://www.bleepingcomputer.com/news/security/volvo-group-north-america-customer-data-exposed-in-conduent-hack/",
    "date": "2026-02-10T17:04:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Volvo Group North America disclosed that it suffered an indirect data breach stemming from the compromise of IT systems at American business services giant Conduent, of which Volvo is a customer. [......"
  },
  {
    "title": "Microsoft rolls out new Secure Boot certificates before June expiration",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-rolls-out-new-secure-boot-certificates-before-june-expiration/",
    "date": "2026-02-10T17:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has begun rolling out updated Secure Boot certificates through monthly Windows updates to replace the original 2011 certificates that will expire in late June 2026. [...]..."
  },
  {
    "title": "OT Attacks Get Scary With 'Living-off-the-Plant' Techniques",
    "link": "https://www.darkreading.com/ics-ot-security/ot-attacks-living-off-the-plant",
    "date": "2026-02-10T16:14:29.000Z",
    "source": "Dark Reading",
    "summary": "Ironically, security by obscurity has helped prevent dangerous OT attacks in recent years. It won't be that way forever...."
  },
  {
    "title": "Microsoft 365 outage takes down admin center in North America",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-outage-takes-down-admin-center-in-north-america/",
    "date": "2026-02-10T15:45:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating an outage that blocks some administrators with business or enterprise subscriptions from accessing the Microsoft 365 admin center. [...]..."
  },
  {
    "title": "How to Automate AWS Incident Investigation with Tines and AI",
    "link": "https://www.bleepingcomputer.com/news/security/how-to-automate-aws-incident-investigation-with-tines-and-ai/",
    "date": "2026-02-10T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Cloud incidents drag on when analysts have to leave cases to hunt through AWS consoles and CLIs. Tines shows how automated agents pull AWS CLI data directly into cases, reducing MTTR and manual invest..."
  },
  {
    "title": "Reynolds Ransomware Embeds BYOVD Driver to Disable EDR Security Tools",
    "link": "https://thehackernews.com/2026/02/reynolds-ransomware-embeds-byovd-driver.html",
    "date": "2026-02-10T14:36:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of an emergent ransomware family dubbed Reynolds that comes embedded with a built-in bring your own vulnerable driver (BYOVD) component for defense eva..."
  },
  {
    "title": "From Ransomware to Residency: Inside the Rise of the Digital Parasite",
    "link": "https://thehackernews.com/2026/02/from-ransomware-to-residency-inside.html",
    "date": "2026-02-10T13:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Are ransomware and encryption still the defining signals of modern cyberattacks, or has the industry been too fixated on noise while missing a more dangerous shift happening quietly all around them?\nA..."
  },
  {
    "title": "Fortinet Patches Critical SQLi Flaw Enabling Unauthenticated Code Execution",
    "link": "https://thehackernews.com/2026/02/fortinet-patches-critical-sqli-flaw.html",
    "date": "2026-02-10T13:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortinet has released security updates to address a critical flaw impacting FortiClientEMS that could lead to the execution of arbitrary code on susceptible systems.\nThe vulnerability, tracked as CVE-..."
  },
  {
    "title": "Microsoft announces new mobile-style Windows security controls",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-announces-new-mobile-style-windows-security-controls/",
    "date": "2026-02-10T13:16:32.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft wants to introduce smartphone-style app permission prompts in Windows 11 to request user consent before apps can access sensitive resources such as files, cameras, and microphones. [...]..."
  },
  {
    "title": "ZeroDayRAT malware grants full access to Android, iOS devices",
    "link": "https://www.bleepingcomputer.com/news/security/zerodayrat-malware-grants-full-access-to-android-ios-devices/",
    "date": "2026-02-10T13:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A new commercial mobile spyware platform dubbed ZeroDayRAT is being advertised to cybercriminals on Telegram as a tool that provides full remote control over compromised Android and iOS devices. [...]..."
  },
  {
    "title": "ZAST.AI Raises $6M Pre-A to Scale \"Zero False Positive\" AI-Powered Code Security",
    "link": "https://thehackernews.com/2026/02/zastai-raises-6m-pre-to-scale-zero.html",
    "date": "2026-02-10T11:40:00.000Z",
    "source": "The Hacker News",
    "summary": "January 5, 2026, Seattle, USA — ZAST.AI announced the completion of a $6 million Pre-A funding round. This investment came from the well-known investment firm Hillhouse Capital, bringing ZAST.AI's tot..."
  },
  {
    "title": "Warlock Ransomware Breaches SmarterTools Through Unpatched SmarterMail Server",
    "link": "https://thehackernews.com/2026/02/warlock-ransomware-breaches.html",
    "date": "2026-02-10T10:24:00.000Z",
    "source": "The Hacker News",
    "summary": "SmarterTools confirmed last week that the Warlock (aka Storm-2603) ransomware gang breached its network by exploiting an unpatched SmarterMail instance.\nThe incident took place on January 29, 2026, wh..."
  },
  {
    "title": "Dutch Authorities Confirm Ivanti Zero-Day Exploit Exposed Employee Contact Data",
    "link": "https://thehackernews.com/2026/02/dutch-authorities-confirm-ivanti-zero.html",
    "date": "2026-02-10T08:22:00.000Z",
    "source": "The Hacker News",
    "summary": "The Netherlands' Dutch Data Protection Authority (AP) and the Council for the Judiciary confirmed both agencies (Rvdr) have disclosed that their systems were impacted by cyber attacks that exploited t..."
  },
  {
    "title": "Fugitive behind $73M 'pig butchering' scheme gets 20 years in prison",
    "link": "https://www.bleepingcomputer.com/news/security/fugitive-behind-73m-pig-butchering-scheme-gets-20-years-in-prison/",
    "date": "2026-02-10T08:17:54.000Z",
    "source": "Bleeping Computer",
    "summary": "A dual Chinese and St. Kitts and Nevis national was sentenced to 20 years in prison in absentia for his role in an international cryptocurrency investment scheme (also known as pig butchering or roman..."
  },
  {
    "title": "TransUnion's Real Networks Deal Focuses on Robocall Blocking",
    "link": "https://www.darkreading.com/cyber-risk/transunion-s-real-networks-deal-focuses-on-robocall-blocking",
    "date": "2026-02-09T23:05:21.000Z",
    "source": "Dark Reading",
    "summary": "The acquisition allows the credit reporting agency to add SMS spam and scam prevention to its robocall blocking capabilities...."
  },
  {
    "title": "Chinese cyberspies breach Singapore's four largest telcos",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-cyberspies-breach-singapores-four-largest-telcos/",
    "date": "2026-02-09T22:47:53.000Z",
    "source": "Bleeping Computer",
    "summary": "The Chinese threat actor tracked as UNC3886 breached Singapore's four largest telecommunication service providers, Singtel, StarHub, M1, and Simba, at least once last year. [...]..."
  },
  {
    "title": "Warlock Gang Breaches SmarterTools Via SmarterMail Bugs",
    "link": "https://www.darkreading.com/application-security/warlock-gang-breaches-smartertools-smartermail-bugs",
    "date": "2026-02-09T21:59:02.000Z",
    "source": "Dark Reading",
    "summary": "The ransomware group breached SmarterTools through a vulnerability in the company's own SmarterMail product...."
  },
  {
    "title": "TeamPCP Turns Cloud Infrastructure Into Crime Bots",
    "link": "https://www.darkreading.com/cloud-security/teampcp-cloud-infrastructure-crime-bots",
    "date": "2026-02-09T21:14:34.000Z",
    "source": "Dark Reading",
    "summary": "The threat actor has been compromising cloud environments at scale with automated worm-like attacks on exposed services and interfaces...."
  },
  {
    "title": "Hackers exploit SolarWinds WHD flaws to deploy DFIR tool in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/threat-actors-exploit-solarwinds-wdh-flaws-to-deploy-velociraptor/",
    "date": "2026-02-09T20:28:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are now exploiting SolarWinds Web Help Desk (WHD) vulnerabilities to gain code execution rights on exposed systems and deploy legitimate tools, including the Velociraptor forensics tools, for ..."
  },
  {
    "title": "'Reynolds' Bundles BYOVD With Ransomware Payload",
    "link": "https://www.darkreading.com/threat-intelligence/black-basta-bundles-byovd-ransomware-payload",
    "date": "2026-02-09T20:14:22.000Z",
    "source": "Dark Reading",
    "summary": "Researchers discovered a newly disclosed vulnerable driver embedded in Reynolds' ransomware, illustrating the increasing popularity of the defense-evasion technique...."
  },
  {
    "title": "Hackers breach SmarterTools network using flaw in its own software",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-breach-smartertools-network-using-flaw-in-its-own-software/",
    "date": "2026-02-09T19:08:58.000Z",
    "source": "Bleeping Computer",
    "summary": "SmarterTools confirmed last week that the Warlock ransomware gang breached its network after compromising an email system, but did not impact business applications or account data. [...]..."
  },
  {
    "title": "What Organizations Need to Change When Managing Printers",
    "link": "https://www.darkreading.com/cybersecurity-operations/what-organizations-need-to-change-when-managing-printers",
    "date": "2026-02-09T17:22:18.000Z",
    "source": "Dark Reading",
    "summary": "Ask the Expert: Organizations need to close the ownership vacuum, establish durable security controls, and ensure printers are protected as rigorously as other endpoints...."
  },
  {
    "title": "China-Linked UNC3886 Targets Singapore Telecom Sector in Cyber Espionage Campaign",
    "link": "https://thehackernews.com/2026/02/china-linked-unc3886-targets-singapore.html",
    "date": "2026-02-09T17:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The Cyber Security Agency (CSA) of Singapore on Monday revealed that the China-nexus cyber espionage group known as UNC3886 targeted its telecommunications sector.\n\"UNC3886 had launched a deliberate, ..."
  },
  {
    "title": "Password guessing without AI: How attackers build targeted wordlists",
    "link": "https://www.bleepingcomputer.com/news/security/password-guessing-without-ai-how-attackers-build-targeted-wordlists/",
    "date": "2026-02-09T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers don't need AI to crack passwords, they build targeted wordlists from an organization's own public language. This article explains how tools like CeWL turn websites into high-success password..."
  },
  {
    "title": "SolarWinds Web Help Desk Exploited for RCE in Multi-Stage Attacks on Exposed Servers",
    "link": "https://thehackernews.com/2026/02/solarwinds-web-help-desk-exploited-for.html",
    "date": "2026-02-09T14:42:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has revealed that it observed a multi‑stage intrusion that involved the threat actors exploiting internet‑exposed SolarWinds Web Help Desk (WHD) instances to obtain initial access and move l..."
  },
  {
    "title": "BeyondTrust warns of critical RCE flaw in remote support software",
    "link": "https://www.bleepingcomputer.com/news/security/beyondtrust-warns-of-critical-rce-flaw-in-remote-support-software/",
    "date": "2026-02-09T13:07:03.000Z",
    "source": "Bleeping Computer",
    "summary": "BeyondTrust warned customers to patch a critical security flaw in its Remote Support (RS) and Privileged Remote Access (PRA) software that could allow unauthenticated attackers to execute arbitrary co..."
  },
  {
    "title": "⚡ Weekly Recap: AI Skill Malware, 31Tbps DDoS, Notepad++ Hack, LLM Backdoors and More",
    "link": "https://thehackernews.com/2026/02/weekly-recap-ai-skill-malware-31tbps.html",
    "date": "2026-02-09T12:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyber threats are no longer coming from just malware or exploits. They’re showing up inside the tools, platforms, and ecosystems organizations use every day. As companies connect AI, cloud apps, devel..."
  },
  {
    "title": "Men charged in FanDuel scheme fueled by thousands of stolen identities",
    "link": "https://www.bleepingcomputer.com/news/security/men-charged-in-massive-fanduel-fraud-scheme-fueled-by-thousands-of-stolen-identities/",
    "date": "2026-02-09T11:41:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Two Connecticut men face federal charges for allegedly defrauding FanDuel and other online gambling sites of $3 million over several years using the stolen identities of approximately 3,000 victims. [..."
  }
]