[
  {
    "title": "The Double-Edged Sword of Non-Human Identities",
    "link": "https://www.bleepingcomputer.com/news/security/the-double-edged-sword-of-non-human-identities/",
    "date": "2026-02-04T15:05:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Leaked non-human identities like API keys and tokens are becoming a major breach driver in cloud environments. Flare shows how exposed machine credentials quietly grant attackers long-term access to e..."
  },
  {
    "title": "EDR killer tool uses signed kernel driver from forensic software",
    "link": "https://www.bleepingcomputer.com/news/security/edr-killer-tool-uses-signed-kernel-driver-from-forensic-software/",
    "date": "2026-02-04T14:17:45.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are abusing a legitimate but long-revoked EnCase kernel driver in an EDR killer that can detect 59 security tools in attempts to deactivate them. [...]..."
  },
  {
    "title": "China-Linked Amaranth-Dragon Exploits WinRAR Flaw in Espionage Campaigns",
    "link": "https://thehackernews.com/2026/02/china-linked-amaranth-dragon-exploits.html",
    "date": "2026-02-04T14:09:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors affiliated with China have been attributed to a fresh set of cyber espionage campaigns targeting government and law enforcement agencies across Southeast Asia throughout 2025.\nCheck Poin..."
  },
  {
    "title": "New Amaranth Dragon cyberespionage group exploits WinRAR flaw",
    "link": "https://www.bleepingcomputer.com/news/security/new-amaranth-dragon-cyberespionage-group-exploits-winrar-flaw/",
    "date": "2026-02-04T14:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A new threat actor called Amaranth Dragon, linked to APT41 state-sponsored Chinese operations, exploited the CVE-2025-8088 vulnerability in WinRAR in espionage attacks on government and law enforcemen..."
  },
  {
    "title": "Extra Extra! Announcing DR Global Latin America",
    "link": "https://www.darkreading.com/cybersecurity-operations/announcing-dr-global-latin-america",
    "date": "2026-02-04T13:30:00.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading has something new hitting the newsstand: a content section purpose-built for Latin American readers, featuring news, analysis, features, and multimedia...."
  },
  {
    "title": "Big Breach or Smooth Sailing? Mexican Gov't Faces Leak Allegations",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/big-breach-or-nada-de-nada-mexican-govt-faces-leak-allegations",
    "date": "2026-02-04T13:00:00.000Z",
    "source": "Dark Reading",
    "summary": "A hacktivist group claims a 2.3-terabyte data breach exposes the information of 36 million Mexicans, but no sensitive accounts are at risk, says government...."
  },
  {
    "title": "Microsoft rolls out native Sysmon monitoring in Windows 11",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-rolls-out-native-windows-11-sysmon-security-monitoring/",
    "date": "2026-02-04T12:58:20.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has started rolling out built-in Sysmon functionality to some Windows 11 systems enrolled in the Windows Insider program. [...]..."
  },
  {
    "title": "Orchid Security Introduces Continuous Identity Observability for Enterprise Applications",
    "link": "https://thehackernews.com/2026/02/orchid-security-introduces-continuous.html",
    "date": "2026-02-04T11:58:00.000Z",
    "source": "The Hacker News",
    "summary": "An innovative approach to discovering, analyzing, and governing identity usage beyond traditional IAM controls.\nThe Challenge: Identity Lives Outside the Identity Stack\nIdentity and access management ..."
  },
  {
    "title": "Owner of Incognito dark web drugs market gets 30 years in prison",
    "link": "https://www.bleepingcomputer.com/news/security/taiwanese-man-gets-30-years-for-operating-dark-web-drug-market/",
    "date": "2026-02-04T11:24:23.000Z",
    "source": "Bleeping Computer",
    "summary": "A Taiwanese man was sentenced to 30 years in prison for operating Incognito Market, one of the world's largest online narcotics marketplaces that sold over $105 million worth of illegal drugs to custo..."
  },
  {
    "title": "Google Looker Bugs Allow Cross-Tenant RCE, Data Exfil",
    "link": "https://www.darkreading.com/application-security/google-looker-bugs-cross-tenant-rce-data-exfil",
    "date": "2026-02-04T11:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Attackers could even have used one vulnerable Lookout user to gain access to other GCP tenants' environments...."
  },
  {
    "title": "The First 90 Seconds: How Early Decisions Shape Incident Response Investigations",
    "link": "https://thehackernews.com/2026/02/the-first-90-seconds-how-early.html",
    "date": "2026-02-04T10:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Many incident response failures do not come from a lack of tools, intelligence, or technical skills. They come from what happens immediately after detection, when pressure is high, and information is ..."
  },
  {
    "title": "Microsoft Warns Python Infostealers Target macOS via Fake Ads and Installers",
    "link": "https://thehackernews.com/2026/02/microsoft-warns-python-infostealers.html",
    "date": "2026-02-04T07:42:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has warned that information-stealing attacks are \"rapidly expanding\" beyond Windows to target Apple macOS environments by leveraging cross-platform languages like Python and abusing trusted ..."
  },
  {
    "title": "Eclipse Foundation Mandates Pre-Publish Security Checks for Open VSX Extensions",
    "link": "https://thehackernews.com/2026/02/eclipse-foundation-mandates-pre-publish.html",
    "date": "2026-02-04T06:26:00.000Z",
    "source": "The Hacker News",
    "summary": "The Eclipse Foundation, which maintains the Open VSX Registry, has announced plans to enforce security checks before Microsoft Visual Studio Code (VS Code) extensions are published to the open-source ..."
  },
  {
    "title": "CISA Adds Actively Exploited SolarWinds Web Help Desk RCE to KEV Catalog",
    "link": "https://thehackernews.com/2026/02/cisa-adds-actively-exploited-solarwinds.html",
    "date": "2026-02-04T05:50:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added a critical security flaw impacting SolarWinds Web Help Desk (WHD) to its Known Exploited Vulnerabilities (KEV) catalog..."
  },
  {
    "title": "Coinbase confirms insider breach linked to leaked support tool screenshots",
    "link": "https://www.bleepingcomputer.com/news/security/coinbase-confirms-insider-breach-linked-to-leaked-support-tool-screenshots/",
    "date": "2026-02-04T02:04:23.000Z",
    "source": "Bleeping Computer",
    "summary": "Coinbase has confirmed an insider breach after a contractor improperly accessed the data of approximately thirty customers, which BleepingComputer has learned is a new incident that occurred in Decemb..."
  },
  {
    "title": "Russian Hackers Weaponize Microsoft Office Bug in Just 3 Days",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/russian-hackers-weaponize-office-bug-within-days",
    "date": "2026-02-03T21:52:22.000Z",
    "source": "Dark Reading",
    "summary": "APT28's attacks rely on specially crafted Microsoft Rich Text Format (RTF) documents to kick off a multistage infection chain to deliver malicious payloads...."
  },
  {
    "title": "Step Finance says compromised execs' devices led to $40M crypto theft",
    "link": "https://www.bleepingcomputer.com/news/security/step-finance-says-compromised-execs-devices-led-to-40m-crypto-theft/",
    "date": "2026-02-03T21:33:23.000Z",
    "source": "Bleeping Computer",
    "summary": "Step Finance announced that it lost $40 million worth of digital assets after hackers compromised devices belonging to the company's team of executives. [...]..."
  },
  {
    "title": "GlassWorm Malware Returns to Shatter Developer Ecosystems",
    "link": "https://www.darkreading.com/application-security/glassworm-malware-developer-ecosystems",
    "date": "2026-02-03T20:55:51.000Z",
    "source": "Dark Reading",
    "summary": "The self-replicating malware has poisoned a fresh set of Open VSX software components, leaving potential downstream victims with infostealer infections...."
  },
  {
    "title": "Wave of Citrix NetScaler scans use thousands of residential proxies",
    "link": "https://www.bleepingcomputer.com/news/security/wave-of-citrix-netscaler-scans-use-thousands-of-residential-proxies/",
    "date": "2026-02-03T20:25:40.000Z",
    "source": "Bleeping Computer",
    "summary": "A coordinated reconnaissance campaign targeting Citrix NetScaler infrastructure over the past week used tens of thousands of residential proxies to discover login panels. [...]..."
  },
  {
    "title": "CISA flags critical SolarWinds RCE flaw as exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-flags-critical-solarwinds-rce-flaw-as-actively-exploited/",
    "date": "2026-02-03T19:37:00.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA has flagged a critical SolarWinds Web Help Desk vulnerability as actively exploited in attacks and ordered federal agencies to patch their systems within three days. [...]..."
  },
  {
    "title": "AI May Supplant Pen Testers, But Oversight &amp; Trust Are Not There Yet",
    "link": "https://www.darkreading.com/cybersecurity-operations/ai-supplant-pen-testers-oversight-trust-not-there-yet",
    "date": "2026-02-03T18:03:46.000Z",
    "source": "Dark Reading",
    "summary": "Crowdsourced bug bounties and pen-testing firms see AI agents stealing the low-hanging vulnerabilities from their human counterparts. Oversight remains key...."
  },
  {
    "title": "Iron Mountain: Data breach mostly limited to marketing materials",
    "link": "https://www.bleepingcomputer.com/news/security/iron-mountain-data-breach-mostly-limited-to-marketing-materials/",
    "date": "2026-02-03T16:49:09.000Z",
    "source": "Bleeping Computer",
    "summary": "Iron Mountain, a leading data storage and recovery services company, says that a recent breach claimed by the Everest extortion gang is limited to mostly marketing materials. [...]..."
  },
  {
    "title": "Docker Fixes Critical Ask Gordon AI Flaw Allowing Code Execution via Image Metadata",
    "link": "https://thehackernews.com/2026/02/docker-fixes-critical-ask-gordon-ai.html",
    "date": "2026-02-03T16:41:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a now-patched security flaw impacting Ask Gordon, an artificial intelligence (AI) assistant built into Docker Desktop and the Docker Command-Line In..."
  },
  {
    "title": "8-Minute Access: AI Accelerates Breach of AWS Environment",
    "link": "https://www.darkreading.com/cloud-security/8-minute-access-ai-aws-environment-breach",
    "date": "2026-02-03T16:38:11.000Z",
    "source": "Dark Reading",
    "summary": "The AI-assisted attack, which started with exposed credentials from public S3 buckets, rapidly achieved administrative privilges...."
  },
  {
    "title": "Dark Patterns Undermine Security, One Click at a Time",
    "link": "https://www.darkreading.com/cyber-risk/dark-patterns-undermine-security-one-click-at-a-time",
    "date": "2026-02-03T16:30:41.000Z",
    "source": "Dark Reading",
    "summary": "People trust organizations to do the right thing, but some websites and apps have user interfaces that ultimately lead to inadequate security...."
  },
  {
    "title": "AI Agent Identity Management: A New Security Control Plane for CISOs",
    "link": "https://www.bleepingcomputer.com/news/security/ai-agent-identity-management-a-new-security-control-plane-for-cisos/",
    "date": "2026-02-03T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Autonomous AI agents are creating a new identity blind spot as they operate outside traditional IAM controls. Token Security shows why managing the full lifecycle of AI agent identities is becoming a ..."
  },
  {
    "title": "UK privacy watchdog probes Grok over AI-generated sexual images",
    "link": "https://www.bleepingcomputer.com/news/security/uk-privacy-watchdog-probes-grok-over-ai-generated-sexual-images/",
    "date": "2026-02-03T14:25:50.000Z",
    "source": "Bleeping Computer",
    "summary": "The United Kingdom's data protection authority launched a formal investigation into X and its Irish subsidiary over reports that the Grok AI assistant was used to generate nonconsensual sexual images...."
  },
  {
    "title": "[Webinar] The Smarter SOC Blueprint: Learn What to Build, Buy, and Automate",
    "link": "https://thehackernews.com/2026/02/webinar-smarter-soc-blueprint-learn.html",
    "date": "2026-02-03T14:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Most security teams today are buried under tools. Too many dashboards. Too much noise. Not enough real progress.\nEvery vendor promises “complete coverage” or “AI-powered automation,” but inside most S..."
  },
  {
    "title": "Hackers Exploit Metro4Shell RCE Flaw in React Native CLI npm Package",
    "link": "https://thehackernews.com/2026/02/hackers-exploit-metro4shell-rce-flaw-in.html",
    "date": "2026-02-03T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed exploiting a critical security flaw impacting the Metro Development Server in the popular \"@react-native-community/cli\" npm package.\nCybersecurity company VulnCheck sa..."
  },
  {
    "title": "Hackers exploit critical React Native Metro bug to breach dev systems",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-critical-react-native-metro-bug-to-breach-dev-systems/",
    "date": "2026-02-03T14:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are targeting developers by exploiting the critical vulnerability CVE-2025-11953 in the Metro server for React Native to deliver malicious payloads for Windows and Linux. [...]..."
  }
]