[
  {
    "title": "Cloud Repatriation Driven by AI, Cost, and Security",
    "link": "https://www.darkreading.com/cloud-security/cloud-repatriation-ai-cost-security",
    "date": "2025-06-26T12:36:53.000Z",
    "source": "Dark Reading",
    "summary": "Organizations are moving away from the public cloud and embracing a more hybrid approach due to big changes over the last five years...."
  },
  {
    "title": "Taming Agentic AI Risks Requires Securing Non-Human Identities",
    "link": "https://www.darkreading.com/cybersecurity-operations/taming-agentic-ai-risks-securing-nhi",
    "date": "2025-06-26T12:02:51.000Z",
    "source": "Dark Reading",
    "summary": "As the definition of machine identities broadens, AI agents working on behalf of the user and gaining access to various services blurs the lines of non-human identities even more...."
  },
  {
    "title": "The Hidden Risks of SaaS: Why Built-In Protections Aren't Enough for Modern Data Resilience",
    "link": "https://thehackernews.com/2025/06/the-hidden-risks-of-saas-why-built-in.html",
    "date": "2025-06-26T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "SaaS Adoption is Skyrocketing, Resilience Hasn’t Kept Pace\nSaaS platforms have revolutionized how businesses operate. They simplify collaboration, accelerate deployment, and reduce the overhead of man..."
  },
  {
    "title": "Microsoft fixes Outlook bug causing crashes when opening emails",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-bug-causing-crashes-when-opening-emails/",
    "date": "2025-06-26T10:26:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has fixed a known issue that will cause the classic Outlook email client to crash when opening emails or starting a new message. [...]..."
  },
  {
    "title": "You should probably delete any sensitive screenshots you have in your phone right now. Here's why",
    "link": "https://www.zdnet.com/article/you-should-probably-delete-any-sensitive-screenshots-you-have-in-your-phone-right-now-heres-why/",
    "date": "2025-06-26T10:00:18.000Z",
    "source": "ZDNet Security",
    "summary": "A new Trojan malware is targeting sensitive information, including crypto wallet seed phrases...."
  },
  {
    "title": "Microsoft confirms Family Safety blocks Google Chrome from launching",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-family-safety-blocks-google-chrome-from-launching/",
    "date": "2025-06-26T09:50:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed that its Family Safety parental control service is blocking users from launching Google Chrome and other web browsers on Windows systems. [...]..."
  },
  {
    "title": "Iranian APT35 Hackers Targeting Israeli Tech Experts with AI-Powered Phishing Attacks",
    "link": "https://thehackernews.com/2025/06/iranian-apt35-hackers-targeting-israeli.html",
    "date": "2025-06-26T08:45:00.000Z",
    "source": "The Hacker News",
    "summary": "An Iranian state-sponsored hacking group associated with the Islamic Revolutionary Guard Corps (IRGC) has been linked to a spear-phishing campaign targeting journalists, high-profile cyber security ex..."
  },
  {
    "title": "CISA: AMI MegaRAC bug enabling server hijacks exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-ami-megarac-bug-that-lets-hackers-brick-servers-now-actively-exploited/",
    "date": "2025-06-26T08:38:05.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA says a maximum severity vulnerability in AMI's MegaRAC Baseboard Management Controller (BMC) software, which enables attackers to hijack and brick servers, is currently under active exploitation...."
  },
  {
    "title": "Cyber Criminals Exploit Open-Source Tools to Compromise Financial Institutions Across Africa",
    "link": "https://thehackernews.com/2025/06/cyber-criminals-exploit-open-source.html",
    "date": "2025-06-26T07:19:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a series of cyber attacks targeting financial organizations across Africa since at least July 2023 using a mix of open-source and publicly available ..."
  },
  {
    "title": "CISA Adds 3 Flaws to KEV Catalog, Impacting AMI MegaRAC, D-Link, Fortinet",
    "link": "https://thehackernews.com/2025/06/cisa-adds-3-flaws-to-kev-catalog.html",
    "date": "2025-06-26T06:02:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added three security flaws, each impacting AMI MegaRAC, D-Link DIR-859 router, and Fortinet FortiOS, to its Known Exploite..."
  },
  {
    "title": "Charming Kitten APT Tries Spying on Israeli Cybersecurity Experts",
    "link": "https://www.darkreading.com/threat-intelligence/iran-apt-spying-israeli-cybersecurity-experts",
    "date": "2025-06-26T06:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Israel's cyber pros are having to put theory into practice, as a notorious nation-state APT sponsored by Iran targets them with spear-phishing attacks...."
  },
  {
    "title": "WhatsApp Adds AI-Powered Message Summaries for Faster Chat Previews",
    "link": "https://thehackernews.com/2025/06/whatsapp-adds-ai-powered-message.html",
    "date": "2025-06-26T04:36:00.000Z",
    "source": "The Hacker News",
    "summary": "Popular messaging platform WhatsApp has added a new artificial intelligence (AI)-powered feature that leverages its in-house solution Meta AI to summarize unread messages in chats.\nThe feature, called..."
  },
  {
    "title": "Hacker 'IntelBroker' charged in US for global data theft breaches",
    "link": "https://www.bleepingcomputer.com/news/security/british-hacker-intelbroker-charged-with-25m-in-cybercrime-damages/",
    "date": "2025-06-25T23:54:22.000Z",
    "source": "Bleeping Computer",
    "summary": "A British national known online as \"IntelBroker\" has been charged by the U.S. for stealing and selling sensitive data from dozens of victims, causing an estimated $25 million in damages. [...]..."
  },
  {
    "title": "Hackers turn ScreenConnect into malware using Authenticode stuffing",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-turn-screenconnect-into-malware-using-authenticode-stuffing/",
    "date": "2025-06-25T21:51:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are abusing the ConnectWise ScreenConnect installer to build signed remote access malware by modifying hidden settings within the client's  Authenticode signature. [...]..."
  },
  {
    "title": "And Now Malware That Tells AI to Ignore It?",
    "link": "https://www.darkreading.com/cloud-security/malware-tells-ai-to-ignore-it",
    "date": "2025-06-25T21:26:17.000Z",
    "source": "Dark Reading",
    "summary": "Though rudimentary and largely non-functional, the wryly named \"Skynet\" binary could be a harbinger of things to come on the malware front...."
  },
  {
    "title": "Hackers abuse Microsoft ClickOnce and AWS services for stealthy attacks",
    "link": "https://www.bleepingcomputer.com/news/security/oneclik-attacks-use-microsoft-clickonce-and-aws-to-target-energy-sector/",
    "date": "2025-06-25T20:34:38.000Z",
    "source": "Bleeping Computer",
    "summary": "A sophisticated malicious campaign that researchers call OneClik has been leveraging Microsoft's ClickOnce software deployment tool and custom Golang backdoors to compromise organizations within the e..."
  },
  {
    "title": "New wave of ‘fake interviews’ use 35 npm packages to spread malware",
    "link": "https://www.bleepingcomputer.com/news/security/new-wave-of-fake-interviews-use-35-npm-packages-to-spread-malware/",
    "date": "2025-06-25T19:24:12.000Z",
    "source": "Bleeping Computer",
    "summary": "A new wave of North Korea's 'Contagious Interview' campaign is targeting job seekers with malicious npm packages that infect dev's devices with infostealers and backdoors. [...]..."
  },
  {
    "title": "Millions of Brother Printers Hit by Critical, Unpatchable Bug",
    "link": "https://www.darkreading.com/endpoint-security/millions-brother-printers-critical-unpatchable-bug",
    "date": "2025-06-25T18:57:19.000Z",
    "source": "Dark Reading",
    "summary": "A slew of vulnerabilities, including a critical CVSS 9.8 that enables an attacker to generate the default admin password, affect hundreds of printer, scanner, and label-maker models made by manufactur..."
  },
  {
    "title": "How Avast's free AI-powered Scam Guardian protects you from online con artists",
    "link": "https://www.zdnet.com/article/how-avasts-free-ai-powered-scam-guardian-protects-you-from-online-con-artists/",
    "date": "2025-06-25T18:54:38.000Z",
    "source": "ZDNet Security",
    "summary": "Now built into Avast Free Antivirus and Avast Premium Security, the AI-driven scam protection warns you about suspicious websites, messages, emails, and more...."
  },
  {
    "title": "CISA Is Shrinking: What Does It Mean for Cyber?",
    "link": "https://www.darkreading.com/cybersecurity-operations/cisa-is-shrinking-what-does-it-mean-for-cyber-",
    "date": "2025-06-25T18:18:35.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading Confidential Episode 7: Cyber experts Tom Parker and Jake Williams offer their views on the practical impact of cuts to the US Cybersecurity and Infrastructure Security Agency...."
  },
  {
    "title": "Google releases Gemini CLI with free Gemini 2.5 Pro ",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-releases-gemini-cli-with-free-gemini-25-pro/",
    "date": "2025-06-25T17:53:28.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has released Gemini 2.5 Pro-powered Gemini CLI, which allows you to use Gemini inside your terminal, including Windows Terminal. [...]..."
  },
  {
    "title": "Citrix warns of NetScaler vulnerability exploited in DoS attacks",
    "link": "https://www.bleepingcomputer.com/news/security/citrix-warns-of-netscaler-vulnerability-exploited-in-dos-attacks/",
    "date": "2025-06-25T17:35:55.000Z",
    "source": "Bleeping Computer",
    "summary": "Citrix is warning that a vulnerability in NetScaler appliances tracked as CVE-2025-6543 is being actively exploited in the wild, causing devices to enter a denial of service condition. [...]..."
  },
  {
    "title": "nOAuth Vulnerability Still Affects 9% of Microsoft Entra SaaS Apps Two Years After Discovery",
    "link": "https://thehackernews.com/2025/06/noauth-vulnerability-still-affects-9-of.html",
    "date": "2025-06-25T16:56:00.000Z",
    "source": "The Hacker News",
    "summary": "New research has uncovered continued risk from a known security weakness in Microsoft's Entra ID, potentially enabling malicious actors to achieve account takeovers in susceptible software-as-a-servic..."
  },
  {
    "title": "WinRAR patches bug letting malware launch from extracted archives",
    "link": "https://www.bleepingcomputer.com/news/security/winrar-patches-bug-letting-malware-launch-from-extracted-archives/",
    "date": "2025-06-25T16:55:14.000Z",
    "source": "Bleeping Computer",
    "summary": "WinRAR has addressed a directory traversal vulnerability tracked as CVE-2025-6218 that, under certain circumstances, allows malware to be executed after extracting a malicious archive. [...]..."
  },
  {
    "title": "Dire Wolf Ransomware Comes Out Snarling, Bites Technology, Manufacturing",
    "link": "https://www.darkreading.com/threat-intelligence/dire-wolf-ransomware-manufacturing-technology",
    "date": "2025-06-25T16:27:19.000Z",
    "source": "Dark Reading",
    "summary": "The emerging group has already gotten its teeth into 16 victims since May with its double extortion tactics, claiming victims in 11 countries, including the US, Thailand, and Taiwan...."
  },
  {
    "title": "New 'CitrixBleed 2' NetScaler flaw let hackers hijack sessions",
    "link": "https://www.bleepingcomputer.com/news/security/new-citrixbleed-2-netscaler-flaw-let-hackers-hijack-sessions/",
    "date": "2025-06-25T16:10:37.000Z",
    "source": "Bleeping Computer",
    "summary": "A recent vulnerability in Citrix NetScaler ADC and Gateway is dubbed \"CitrixBleed 2,\" after its similarity to an older exploited flaw that allowed unauthenticated attackers to hijack authentication se..."
  },
  {
    "title": "Hundreds of MCP Servers Expose AI Models to Abuse, RCE",
    "link": "https://www.darkreading.com/cloud-security/hundreds-mcp-servers-ai-models-abuse-rce",
    "date": "2025-06-25T15:23:04.000Z",
    "source": "Dark Reading",
    "summary": "The servers that connect AI with real-world data are occasionally wide-open channels for cyberattacks...."
  },
  {
    "title": "Citrix Releases Emergency Patches for Actively Exploited CVE-2025-6543 in NetScaler ADC",
    "link": "https://thehackernews.com/2025/06/citrix-releases-emergency-patches-for.html",
    "date": "2025-06-25T14:51:00.000Z",
    "source": "The Hacker News",
    "summary": "Citrix has released security updates to address a critical flaw affecting NetScaler ADC that it said has been exploited in the wild.\nThe vulnerability, tracked as CVE-2025-6543, carries a CVSS score o..."
  },
  {
    "title": "BreachForums hacking forum operators reportedly arrested in France",
    "link": "https://www.bleepingcomputer.com/news/security/breachforums-hacking-forum-operators-reportedly-arrested-in-france/",
    "date": "2025-06-25T14:25:46.000Z",
    "source": "Bleeping Computer",
    "summary": "The French police have reportedly arrested five operators of the BreachForum cybercrime forum, a website used by cybercriminals to leak and sell stolen data that exposed the sensitive information of m..."
  },
  {
    "title": "Generative AI Exacerbates Software Supply Chain Risks",
    "link": "https://www.darkreading.com/vulnerabilities-threats/generative-ai-exacerbates-software-supply-chain-risks",
    "date": "2025-06-25T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Malicious actors are exploiting AI-fabricated software components — presenting a major challenge for securing software supply chains...."
  }
]