[
  {
    "title": "Indian Police Arrest Cybercrime Gang Copycats of Myanmar Biz Model",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/indian-police-arrest-cybercrime-gang-copycats-myanmar-biz-model",
    "date": "2025-05-28T03:30:00.000Z",
    "source": "Dark Reading",
    "summary": "The region offers attractive conditions: a large pool of tech workers, economic disparity, and weak enforcement of cybercrime laws — all of which attract businesses legitimate and shady...."
  },
  {
    "title": "DragonForce ransomware abuses SimpleHelp in MSP supply chain attack",
    "link": "https://www.bleepingcomputer.com/news/security/dragonforce-ransomware-abuses-simplehelp-in-msp-supply-chain-attack/",
    "date": "2025-05-27T21:44:15.000Z",
    "source": "Bleeping Computer",
    "summary": "The DragonForce ransomware operation successfully breached a managed service provider and used its SimpleHelp remote monitoring and management (RMM) platform to steal data and deploy encryptors on dow..."
  },
  {
    "title": "Adidas Falls Victim to Third-Party Data Breach",
    "link": "https://www.darkreading.com/vulnerabilities-threats/adidas-victim-third-party-data-breach",
    "date": "2025-05-27T21:38:05.000Z",
    "source": "Dark Reading",
    "summary": "Though Adidas said that no payment or financial information was affected in the breach, individuals who contacted the compamy's customer service help desk were impacted...."
  },
  {
    "title": "CISA Warns of Attacks Targeting Commvault SaaS Environment",
    "link": "https://www.darkreading.com/cloud-security/cisa-warns-attacks-commvault-saas-environment",
    "date": "2025-05-27T21:22:27.000Z",
    "source": "Dark Reading",
    "summary": "A threat actor has gained access to Microsoft 365 environments of a small number of customers of Commvault's Metallic service...."
  },
  {
    "title": "DragonForce Ransomware Strikes MSP in Supply Chain Attack",
    "link": "https://www.darkreading.com/application-security/dragonforce-ransomware-msp-supply-chain-attack",
    "date": "2025-05-27T20:15:31.000Z",
    "source": "Dark Reading",
    "summary": "DragonForce, a ransomware \"cartel\" that has gained significant popularity since its debut in 2023, attacked an MSP as part of a recent supply chain attack, via known SimpleHelp bugs...."
  },
  {
    "title": "Iranian pleads guilty to RobbinHood ransomware attacks, faces 30 years",
    "link": "https://www.bleepingcomputer.com/news/security/iranian-pleads-guilty-to-robbinhood-ransomware-attacks-faces-30-years/",
    "date": "2025-05-27T19:14:56.000Z",
    "source": "Bleeping Computer",
    "summary": "An Iranian national has pleaded guilty to participating in the Robbinhood ransomware operation, which was used to breach the networks, steal data, and encrypt devices of U.S. cities and organizations ..."
  },
  {
    "title": "MathWorks, Creator of MATLAB, Confirms Ransomware Attack",
    "link": "https://www.darkreading.com/vulnerabilities-threats/mathworks-confirms-ransomware-attack",
    "date": "2025-05-27T17:27:19.000Z",
    "source": "Dark Reading",
    "summary": "The attack dirsupted MathWorks' systems and online applications, but it remains unclear which ransomware group targeted the software company and whether they stole any data...."
  },
  {
    "title": "Lock down your data and save 20% on this encrypted Kingston portable SSD",
    "link": "https://www.zdnet.com/article/lock-down-your-data-and-save-20-on-this-encrypted-kingston-portable-ssd/",
    "date": "2025-05-27T17:20:14.000Z",
    "source": "ZDNet Security",
    "summary": "The Kingston IronKey Vault Privacy 80 features real-time AES-256 bit encryption, dual read-only modes, and password protection. The 2TB version is on sale right now at B&H Photo...."
  },
  {
    "title": "FBI: Silent Ransom Group Adopts Vishing Campaign Against Law Firms",
    "link": "https://www.darkreading.com/endpoint-security/fbi-silent-ransom-group-vishing-law-firms",
    "date": "2025-05-27T16:58:22.000Z",
    "source": "Dark Reading",
    "summary": "The non-ransomware extortion group has switched up tactics and victimology in a deliberate and focused campaign similar to those of other attackers focused on stealing sensitive data...."
  },
  {
    "title": "New Self-Spreading Malware Infects Docker Containers to Mine Dero Cryptocurrency",
    "link": "https://thehackernews.com/2025/05/new-self-spreading-malware-infects.html",
    "date": "2025-05-27T16:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Misconfigured Docker API instances have become the target of a new malware campaign that transforms them into a cryptocurrency mining botnet.\nThe attacks, designed to mine for Dero currency, is notabl..."
  },
  {
    "title": "How the New Hacker Millionaire Class Was Built",
    "link": "https://www.darkreading.com/remote-workforce/hacker-millionaire-class-built",
    "date": "2025-05-27T16:12:00.000Z",
    "source": "Dark Reading",
    "summary": "Once dismissed as Internet miscreants in hoodies, ethical hackers have hit the big time, earning millions from blue-chip firms. And they say it's their diverse backgrounds that make them top-tier bug ..."
  },
  {
    "title": "Danabot Takedown Deals Blow to Russian Cybercrime",
    "link": "https://www.darkreading.com/threat-intelligence/danabot-takedown-russian-cybercrime",
    "date": "2025-05-27T15:53:00.000Z",
    "source": "Dark Reading",
    "summary": "A multiyear investigation by a public-private partnership has resulted in the seizure of the botnet's US-based infrastructure and indictments for its key players, significantly disrupting a vast cyber..."
  },
  {
    "title": "Not Every CVE Deserves a Fire Drill: Focus on What’s Exploitable",
    "link": "https://www.bleepingcomputer.com/news/security/not-every-cve-deserves-a-fire-drill-focus-on-whats-exploitable/",
    "date": "2025-05-27T14:25:31.000Z",
    "source": "Bleeping Computer",
    "summary": "Not every \"critical\" vulnerability is a critical risk. Picus Exposure Validation cuts through the noise by testing what's actually exploitable in your environment — so you can patch what matters. [......"
  },
  {
    "title": "How to get 2FA codes on your desktop when your phone is MIA",
    "link": "https://www.zdnet.com/article/how-to-get-2fa-codes-on-your-desktop-when-your-phone-is-mia/",
    "date": "2025-05-27T14:21:13.000Z",
    "source": "ZDNet Security",
    "summary": "If you have two-factor authentication enabled but don't have your phone nearby, you can use one of these desktop apps to get your code...."
  },
  {
    "title": "Cybercriminals Clone Antivirus Site to Spread Venom RAT and Steal Crypto Wallets",
    "link": "https://thehackernews.com/2025/05/cybercriminals-clone-antivirus-site-to_4.html",
    "date": "2025-05-27T14:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a new malicious campaign that uses a fake website advertising antivirus software from Bitdefender to dupe victims into downloading a remote access trojan calle..."
  },
  {
    "title": "CVE Uncertainty Underlines Importance of Cyber Resilience",
    "link": "https://www.darkreading.com/vulnerabilities-threats/cve-uncertainty-underlines-importance-cyber-resilience",
    "date": "2025-05-27T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Organizations need to broaden their strategy to manage vulnerabilities more effectively and strengthen network cyber resilience...."
  },
  {
    "title": "MATLAB dev confirms ransomware attack behind service outage",
    "link": "https://www.bleepingcomputer.com/news/security/mathworks-blames-ransomware-attack-for-ongoing-outages/",
    "date": "2025-05-27T13:37:25.000Z",
    "source": "Bleeping Computer",
    "summary": "MathWorks, a leading developer of mathematical computing and simulation software, has revealed that a recent ransomware attack is behind an ongoing service outage. [...]..."
  },
  {
    "title": "Russian Hackers Breach 20+ NGOs Using Evilginx Phishing via Fake Microsoft Entra Pages",
    "link": "https://thehackernews.com/2025/05/russian-hackers-breach-20-ngos-using.html",
    "date": "2025-05-27T11:51:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has shed light on a previously undocumented cluster of malicious activity originating from a Russia-affiliated threat actor dubbed Void Blizzard (aka Laundry Bear) that it said is attributed..."
  },
  {
    "title": "Russian Laundry Bear cyberspies linked to Dutch Police hack",
    "link": "https://www.bleepingcomputer.com/news/security/russian-void-blizzard-cyberspies-linked-to-dutch-police-breach/",
    "date": "2025-05-27T11:16:03.000Z",
    "source": "Bleeping Computer",
    "summary": "A previously unknown Russian-backed cyberespionage group now tracked as Laundry Bear has been linked to a September 2024 Dutch police security breach. [...]..."
  },
  {
    "title": "AI Agents and the Non‑Human Identity Crisis: How to Deploy AI More Securely at Scale",
    "link": "https://thehackernews.com/2025/05/ai-agents-and-nonhuman-identity-crisis.html",
    "date": "2025-05-27T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence is driving a massive shift in enterprise productivity, from GitHub Copilot’s code completions to chatbots that mine internal knowledge bases for instant answers. Each new agent..."
  },
  {
    "title": "Employees Searching Payroll Portals on Google Tricked Into Sending Paychecks to Hackers",
    "link": "https://thehackernews.com/2025/05/employees-searching-payroll-portals-on.html",
    "date": "2025-05-27T09:52:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters have exposed a novel campaign that makes use of search engine optimization (SEO) poisoning techniques to target employee mobile devices and facilitate payroll fraud.\nThe activity, first..."
  },
  {
    "title": "Windows Server emergency update fixes Hyper-V VM freezes, restart issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-server-emergency-update-fixes-hyper-v-vm-freezes-restart-issues/",
    "date": "2025-05-27T09:25:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released an emergency update to address a known issue causing some Hyper-V virtual machines with Windows Server 2022 to freeze or restart unexpectedly. [...]..."
  },
  {
    "title": "Adidas warns of data breach after customer service provider hack",
    "link": "https://www.bleepingcomputer.com/news/security/adidas-warns-of-data-breach-after-customer-service-provider-hack/",
    "date": "2025-05-27T08:29:49.000Z",
    "source": "Bleeping Computer",
    "summary": "German sportswear giant Adidas disclosed a data breach after attackers hacked a customer service provider and stole some customers' data. [...]..."
  },
  {
    "title": "Hackers Are Calling Your Office: FBI Alerts Law Firms to Luna Moth’s Stealth Phishing Campaign",
    "link": "https://thehackernews.com/2025/05/hackers-are-calling-your-office-fbi.html",
    "date": "2025-05-27T07:11:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Federal Bureau of Investigation (FBI) has warned of social engineering attacks mounted by a criminal extortion actor known as Luna Moth targeting law firms over the past two years.\nThe campai..."
  },
  {
    "title": "Russia-Linked Hackers Target Tajikistan Government with Weaponized Word Documents",
    "link": "https://thehackernews.com/2025/05/russia-linked-hackers-target-tajikistan.html",
    "date": "2025-05-27T06:54:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russia-aligned threat actor known as TAG-110 has been observed conducting a spear-phishing campaign targeting Tajikistan using macro-enabled Word templates as an initial payload.\nThe attack chain ..."
  },
  {
    "title": "I replaced my Ring with this outdoor security camera - and there's no subscription required",
    "link": "https://www.zdnet.com/article/i-replaced-my-ring-with-this-outdoor-security-camera-and-theres-no-subscription-required/",
    "date": "2025-05-27T01:33:39.000Z",
    "source": "ZDNet Security",
    "summary": "The Aqara Camera Hub G5 Pro provides AI-powered visual recognition technology with a host of home security features - and it's on sale now...."
  },
  {
    "title": "Over 70 Malicious npm and VS Code Packages Found Stealing Data and Crypto",
    "link": "https://thehackernews.com/2025/05/over-70-malicious-npm-and-vs-code.html",
    "date": "2025-05-26T14:17:00.000Z",
    "source": "The Hacker News",
    "summary": "As many as 60 malicious npm packages have been discovered in the package registry with malicious functionality to harvest hostnames, IP addresses, DNS servers, and user directories to a Discord-contro..."
  },
  {
    "title": "Google claims users find ads in AI search 'helpful'",
    "link": "https://www.bleepingcomputer.com/news/google/google-claims-users-find-ads-in-ai-search-helpful/",
    "date": "2025-05-26T12:45:09.000Z",
    "source": "Bleeping Computer",
    "summary": "Google AI mode and AI Overviews now have ads, which, according to the search engine giant, are \"helpful.\" [...]..."
  },
  {
    "title": "OpenAI plans to ship an interesting ChatGPT product by 2026",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-plans-to-ship-an-interesting-chatgpt-product-by-2026/",
    "date": "2025-05-26T12:02:23.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is planning to ship a new ChatGPT-powered product by 2026, but we aren't looking at yet another model. [...]..."
  },
  {
    "title": "CISO's Guide To Web Privacy Validation And Why It's Important",
    "link": "https://thehackernews.com/2025/05/cisos-guide-to-web-privacy-validation.html",
    "date": "2025-05-26T11:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Are your web privacy controls protecting your users, or just a box-ticking exercise? This CISO’s guide provides a practical roadmap for continuous web privacy validation that’s aligned with real-world..."
  }
]