[
  {
    "title": "Threat Actor Abuses TeamFiltration for Entra ID Account Takeovers",
    "link": "https://www.darkreading.com/cloud-security/threat-actor-teamfiltration-entra-id-attacks",
    "date": "2025-06-13T15:10:18.000Z",
    "source": "Dark Reading",
    "summary": "Proofpoint researchers discovered a large-scale campaign using the open source penetration-testing framework that has targeted more than 80,000 Microsoft accounts...."
  },
  {
    "title": "Over 269,000 Websites Infected with JSFireTruck JavaScript Malware in One Month",
    "link": "https://thehackernews.com/2025/06/over-269000-websites-infected-with.html",
    "date": "2025-06-13T14:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a \"large-scale campaign\" that has been observed compromising legitimate websites with malicious JavaScript injections.\nAccording to Palo Alto Network..."
  },
  {
    "title": "Why CISOs Must Align Business Objectives &amp; Cybersecurity",
    "link": "https://www.darkreading.com/cybersecurity-operations/why-cisos-align-business-objectives-cybersecurity",
    "date": "2025-06-13T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "This alignment makes a successful CISO, but creating the same sentiment across business leadership creates a culture of commitment and greatly contributes to achieving goals...."
  },
  {
    "title": "Microsoft: KB5060533 update triggers boot errors on Surface Hub v1 devices",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-kb5060533-update-triggers-boot-errors-on-surface-hub-v1-devices/",
    "date": "2025-06-13T13:17:29.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating a known issue that triggers Secure Boot errors and prevents Surface Hub v1 devices from starting up. [...]..."
  },
  {
    "title": "Cyberattacks on Humanitarian Orgs Jump Worldwide",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/attacks-humanitarian-orgs-jump-worldwide",
    "date": "2025-06-13T13:00:00.000Z",
    "source": "Dark Reading",
    "summary": "These groups suffered three times the cyberattacks as the year previous, with DDoS attacks dominating and vulnerability scans and SQL injection also more common...."
  },
  {
    "title": "Microsoft confirms auth issues affecting Microsoft 365 users",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-auth-issues-affecting-microsoft-365-users/",
    "date": "2025-06-13T12:37:06.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating an ongoing incident that is causing users to experience errors with some Microsoft 365 authentication features. [...]..."
  },
  {
    "title": "Victoria’s Secret restores critical systems after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/victorias-secret-restores-critical-systems-after-cyberattack/",
    "date": "2025-06-13T11:56:16.000Z",
    "source": "Bleeping Computer",
    "summary": "Victoria's Secret has restored all critical systems impacted by a May 24 security incident that forced it to shut down corporate systems and the e-commerce website. [...]..."
  },
  {
    "title": "Ransomware Gangs Exploit Unpatched SimpleHelp Flaws to Target Victims with Double Extortion",
    "link": "https://thehackernews.com/2025/06/ransomware-gangs-exploit-unpatched.html",
    "date": "2025-06-13T11:02:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday disclosed that ransomware actors are targeting unpatched SimpleHelp Remote Monitoring and Management (RMM) instances to com..."
  },
  {
    "title": "CTEM is the New SOC: Shifting from Monitoring Alerts to Measuring Risk",
    "link": "https://thehackernews.com/2025/06/ctem-is-new-soc-shifting-from.html",
    "date": "2025-06-13T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Introduction: Security at a Tipping Point\nSecurity Operations Centers (SOCs) were built for a different era, one defined by perimeter-based thinking, known threats, and manageable alert volumes. But t..."
  },
  {
    "title": "Cloudflare: Outage not caused by security incident, data is safe",
    "link": "https://www.bleepingcomputer.com/news/security/cloudflare-outage-not-caused-by-security-incident-data-is-safe/",
    "date": "2025-06-13T10:09:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Cloudflare has confirmed that the massive service outage yesterday was not caused by a security incident and no data has been lost. [...]..."
  },
  {
    "title": "Apple Zero-Click Flaw in Messages Exploited to Spy on Journalists Using Paragon Spyware",
    "link": "https://thehackernews.com/2025/06/apple-zero-click-flaw-in-messages.html",
    "date": "2025-06-13T07:03:00.000Z",
    "source": "The Hacker News",
    "summary": "Apple has disclosed that a now-patched security flaw present in its Messages app was actively exploited in the wild to target civil society members in sophisticated cyber attacks.\nThe vulnerability, t..."
  },
  {
    "title": "Inside a Dark Adtech Empire Fed by Fake CAPTCHAs",
    "link": "https://krebsonsecurity.com/2025/06/inside-a-dark-adtech-empire-fed-by-fake-captchas/",
    "date": "2025-06-12T22:14:00.000Z",
    "source": "Krebs on Security",
    "summary": "Late last year, security researchers made a startling discovery: Kremlin-backed disinformation campaigns were bypassing moderation on social media platforms by leveraging the same malicious advertisin..."
  },
  {
    "title": "Researchers Detail Zero-Click Copilot Exploit 'EchoLeak'",
    "link": "https://www.darkreading.com/application-security/researchers-detail-zero-click-copilot-exploit-echoleak",
    "date": "2025-06-12T20:49:29.000Z",
    "source": "Dark Reading",
    "summary": "Researchers at Aim Security disclosed a Microsoft Copilot vulnerability of critical severity this week that could have enabled sensitive data exfiltration via prompt injection attacks...."
  },
  {
    "title": "New COPPA Rules to Take Effect Over Child Data Privacy Concerns",
    "link": "https://www.darkreading.com/data-privacy/new-coppa-rules-children-data-privacy-concerns",
    "date": "2025-06-12T20:16:49.000Z",
    "source": "Dark Reading",
    "summary": "New regulations and compliance standards for the Children's Online Privacy Protection Act reflect how much technology has grown since the Federal Trade Commission last updated it in 2013...."
  },
  {
    "title": "Hacking the Hackers: When Bad Guys Let Their Guard Down",
    "link": "https://www.darkreading.com/threat-intelligence/hacking-hackers-bad-guys-guard-down",
    "date": "2025-06-12T20:13:45.000Z",
    "source": "Dark Reading",
    "summary": "A string of threat-actor OpSec failures have yielded unexpected windfalls for security researchers and defenders...."
  },
  {
    "title": "Trend Micro fixes critical vulnerabilities in multiple products",
    "link": "https://www.bleepingcomputer.com/news/security/trend-micro-fixes-six-critical-flaws-on-apex-central-endpoint-encryption-policyserver/",
    "date": "2025-06-12T19:31:54.000Z",
    "source": "Bleeping Computer",
    "summary": "Trend Micro has released security updates to address multiple critical-severity remote code execution and authentication bypass vulnerabilities that impact its Apex Central and Endpoint Encryption (TM..."
  },
  {
    "title": "Google Cloud and Cloudflare hit by widespread service outages",
    "link": "https://www.bleepingcomputer.com/news/technology/google-cloud-and-cloudflare-hit-by-widespread-service-outages/",
    "date": "2025-06-12T19:04:22.000Z",
    "source": "Bleeping Computer",
    "summary": "Google Cloud and Cloudflare are investigating ongoing outages impacting access to sites and various services across multiple regions. [...]..."
  },
  {
    "title": "WordPress Sites Turned Weapon: How VexTrio and Affiliates Run a Global Scam Network",
    "link": "https://thehackernews.com/2025/06/wordpress-sites-turned-weapon-how.html",
    "date": "2025-06-12T17:47:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actors behind the VexTrio Viper Traffic Distribution Service (TDS) have been linked to other TDS services like Help TDS and Disposable TDS, indicating that the sophisticated cybercriminal o..."
  },
  {
    "title": "Graphite spyware used in Apple iOS zero-click attacks on journalists",
    "link": "https://www.bleepingcomputer.com/news/security/graphite-spyware-used-in-apple-ios-zero-click-attacks-on-journalists/",
    "date": "2025-06-12T17:42:09.000Z",
    "source": "Bleeping Computer",
    "summary": "Forensic investigation has confirmed the use of Paragon's Graphite spyware platform in zero-click attacks that targeted Apple iOS devices of at least two journalists in Europe. [...]..."
  },
  {
    "title": "How to delete your 23andMe data ASAP - and why you should",
    "link": "https://www.zdnet.com/article/how-to-delete-your-23andme-data-and-why-you-should-do-it-now/",
    "date": "2025-06-12T17:09:00.000Z",
    "source": "ZDNet Security",
    "summary": "Since 23andMe filed for bankruptcy and a pharmaceutical company won the bid to acquire it, about 15% of its customers have requested their data be deleted. Here's how you can, too...."
  },
  {
    "title": "Password-spraying attacks target 80,000 Microsoft Entra ID accounts",
    "link": "https://www.bleepingcomputer.com/news/security/password-spraying-attacks-target-80-000-microsoft-entra-id-accounts/",
    "date": "2025-06-12T14:40:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers have been using the TeamFiltration pentesting framework to target more than 80,000 Microsoft Entra ID accounts at hundreds of organizations worldwide. [...]..."
  },
  {
    "title": "Foundations of Cybersecurity: Reassessing What Matters",
    "link": "https://www.darkreading.com/cyber-risk/foundations-cybersecurity-reassessing-what-matters",
    "date": "2025-06-12T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "To truly future-proof your cybersecurity approach, it's vital to ensure that your security program is flexible and adaptable to both current and future business demands...."
  },
  {
    "title": "New TokenBreak Attack Bypasses AI Moderation with Single-Character Text Changes",
    "link": "https://thehackernews.com/2025/06/new-tokenbreak-attack-bypasses-ai.html",
    "date": "2025-06-12T13:52:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a novel attack technique called TokenBreak that can be used to bypass a large language model's (LLM) safety and content moderation guardrails with just a sing..."
  },
  {
    "title": "Microsoft Edge now offers secure password deployment for businesses",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-edge-now-offers-secure-password-deployment-for-businesses/",
    "date": "2025-06-12T13:20:31.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced that a new Edge feature allowing employees to share passwords more securely in enterprise environments has reached general availability. [...]..."
  },
  {
    "title": "AI Agents Run on Secret Accounts — Learn How to Secure Them in This Webinar",
    "link": "https://thehackernews.com/2025/06/ai-agents-run-on-secret-accounts-learn.html",
    "date": "2025-06-12T13:06:00.000Z",
    "source": "The Hacker News",
    "summary": "AI is changing everything — from how we code, to how we sell, to how we secure. But while most conversations focus on what AI can do, this one focuses on what AI can break — if you’re not paying atten..."
  },
  {
    "title": "GitLab patches high severity account takeover, missing auth issues",
    "link": "https://www.bleepingcomputer.com/news/security/gitlab-patches-high-severity-account-takeover-missing-auth-issues/",
    "date": "2025-06-12T12:26:00.000Z",
    "source": "Bleeping Computer",
    "summary": "GitLab has released security updates to address multiple vulnerabilities in the company's DevSecOps platform, including ones enabling attackers to take over accounts and inject malicious jobs in futur..."
  },
  {
    "title": "Is your Roku TV spying on you? Probably, but here's how to put an end to it",
    "link": "https://www.zdnet.com/article/is-your-roku-tv-spying-on-you-probably-but-heres-how-to-put-an-end-to-it/",
    "date": "2025-06-12T12:00:15.000Z",
    "source": "ZDNet Security",
    "summary": "Your Fire Stick, Chromecast, and other streaming devices collect personal data for various reasons. If that bothers you, here's how to take back some control...."
  },
  {
    "title": "Zero-Click AI Vulnerability Exposes Microsoft 365 Copilot Data Without User Interaction",
    "link": "https://thehackernews.com/2025/06/zero-click-ai-vulnerability-exposes.html",
    "date": "2025-06-12T11:11:00.000Z",
    "source": "The Hacker News",
    "summary": "A novel attack technique named EchoLeak has been characterized as a \"zero-click\" artificial intelligence (AI) vulnerability that allows bad actors to exfiltrate sensitive data from Microsoft 365 (M365..."
  },
  {
    "title": "Non-Human Identities: How to Address the Expanding Security Risk",
    "link": "https://thehackernews.com/2025/06/non-human-identities-how-to-address.html",
    "date": "2025-06-12T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Human identities management and control is pretty well done with its set of dedicated tools, frameworks, and best practices. This is a very different world when it comes to Non-human identities also r..."
  },
  {
    "title": "Windows 11 24H2 emergency update fixes Easy Anti-Cheat BSOD issue",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-24h2-emergency-update-fixes-easy-anti-cheat-bsod-issue/",
    "date": "2025-06-12T10:43:04.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released an emergency Windows 11 24H2 update to address an incompatibility issue triggering restarts with blue screen of death (BSOD) errors on systems with Easy Anti-Cheat. [...]..."
  }
]