[
  {
    "title": "[Virtual Event] Shields Up: Key Technologies Reshaping Cybersecurity Defenses",
    "link": "https://www.darkreading.com/events/shields-up-key-technologies-reshaping-cybersecurity-defenses",
    "date": "2026-02-10T12:27:05.313Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "ZAST.AI Raises $6M Pre-A to Scale \"Zero False Positive\" AI-Powered Code Security",
    "link": "https://thehackernews.com/2026/02/zastai-raises-6m-pre-to-scale-zero.html",
    "date": "2026-02-10T11:40:00.000Z",
    "source": "The Hacker News",
    "summary": "January 5, 2026, Seattle, USA — ZAST.AI announced the completion of a $6 million Pre-A funding round. This investment came from the well-known investment firm Hillhouse Capital, bringing ZAST.AI's tot..."
  },
  {
    "title": "Warlock Ransomware Breaches SmarterTools Through Unpatched SmarterMail Server",
    "link": "https://thehackernews.com/2026/02/warlock-ransomware-breaches.html",
    "date": "2026-02-10T10:24:00.000Z",
    "source": "The Hacker News",
    "summary": "SmarterTools confirmed last week that the Warlock (aka Storm-2603) ransomware gang breached its network by exploiting an unpatched SmarterMail instance.\nThe incident took place on January 29, 2026, wh..."
  },
  {
    "title": "Dutch Authorities Confirm Ivanti Zero-Day Exploit Exposed Employee Contact Data",
    "link": "https://thehackernews.com/2026/02/dutch-authorities-confirm-ivanti-zero.html",
    "date": "2026-02-10T08:22:00.000Z",
    "source": "The Hacker News",
    "summary": "The Netherlands' Dutch Data Protection Authority (AP) and the Council for the Judiciary confirmed both agencies (Rvdr) have disclosed that their systems were impacted by cyber attacks that exploited t..."
  },
  {
    "title": "Fugitive behind $73M 'pig butchering' scheme gets 20 years in prison",
    "link": "https://www.bleepingcomputer.com/news/security/fugitive-behind-73m-pig-butchering-scheme-gets-20-years-in-prison/",
    "date": "2026-02-10T08:17:54.000Z",
    "source": "Bleeping Computer",
    "summary": "A dual Chinese and St. Kitts and Nevis national was sentenced to 20 years in prison in absentia for his role in an international cryptocurrency investment scheme (also known as pig butchering or roman..."
  },
  {
    "title": "Fortinet Patches Critical SQLi Flaw Enabling Unauthenticated Code Execution",
    "link": "https://thehackernews.com/2026/02/fortinet-patches-critical-sqli-flaw.html",
    "date": "2026-02-10T04:38:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortinet has released security updates to address a critical flaw impacting FortiClientEMS that could lead to the execution of arbitrary code on susceptible systems.\nThe vulnerability, tracked as CVE-..."
  },
  {
    "title": "Chinese cyberspies breach Singapore's four largest telcos",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-cyberspies-breach-singapores-four-largest-telcos/",
    "date": "2026-02-09T22:47:53.000Z",
    "source": "Bleeping Computer",
    "summary": "The Chinese threat actor tracked as UNC3886 breached Singapore's four largest telecommunication service providers, Singtel, StarHub, M1, and Simba, at least once last year. [...]..."
  },
  {
    "title": "Warlock Gang Breaches SmarterTools Via SmarterMail Bugs",
    "link": "https://www.darkreading.com/application-security/warlock-gang-breaches-smartertools-smartermail-bugs",
    "date": "2026-02-09T21:59:02.000Z",
    "source": "Dark Reading",
    "summary": "The ransomware group breached SmarterTools through a vulnerability in the company's own SmarterMail product...."
  },
  {
    "title": "TeamPCP Turns Cloud Infrastructure into Crime Bots",
    "link": "https://www.darkreading.com/cloud-security/teampcp-cloud-infrastructure-crime-bots",
    "date": "2026-02-09T21:14:34.000Z",
    "source": "Dark Reading",
    "summary": "The threat actor has been compromising cloud environments at scale with automated worm-like attacks on exposed services and interfaces...."
  },
  {
    "title": "Hackers exploit SolarWinds WHD flaws to deploy DFIR tool in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/threat-actors-exploit-solarwinds-wdh-flaws-to-deploy-velociraptor/",
    "date": "2026-02-09T20:28:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are now exploiting SolarWinds Web Help Desk (WHD) vulnerabilities to gain code execution rights on exposed systems and deploy legitimate tools, including the Velociraptor forensics tools, for ..."
  },
  {
    "title": "'Reynolds' Bundles BYOVD With Ransomware Payload",
    "link": "https://www.darkreading.com/threat-intelligence/black-basta-bundles-byovd-ransomware-payload",
    "date": "2026-02-09T20:14:22.000Z",
    "source": "Dark Reading",
    "summary": "Researchers discovered a newly disclosed vulnerable driver embedded in Reynolds' ransomware, illustrating the increasing popularity of the defense-evasion technique...."
  },
  {
    "title": "Hackers breach SmarterTools network using flaw in its own software",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-breach-smartertools-network-using-flaw-in-its-own-software/",
    "date": "2026-02-09T19:08:58.000Z",
    "source": "Bleeping Computer",
    "summary": "SmarterTools confirmed last week that the Warlock ransomware gang breached its network after compromising an email system, but did not impact business applications or account data. [...]..."
  },
  {
    "title": "China-Linked UNC3886 Targets Singapore Telecom Sector in Cyber Espionage Campaign",
    "link": "https://thehackernews.com/2026/02/china-linked-unc3886-targets-singapore.html",
    "date": "2026-02-09T17:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The Cyber Security Agency (CSA) of Singapore on Monday revealed that the China-nexus cyber espionage group known as UNC3886 targeted its telecommunications sector.\n\"UNC3886 had launched a deliberate, ..."
  },
  {
    "title": "Password guessing without AI: How attackers build targeted wordlists",
    "link": "https://www.bleepingcomputer.com/news/security/password-guessing-without-ai-how-attackers-build-targeted-wordlists/",
    "date": "2026-02-09T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers don't need AI to crack passwords, they build targeted wordlists from an organization's own public language. This article explains how tools like CeWL turn websites into high-success password..."
  },
  {
    "title": "SolarWinds Web Help Desk Exploited for RCE in Multi-Stage Attacks on Exposed Servers",
    "link": "https://thehackernews.com/2026/02/solarwinds-web-help-desk-exploited-for.html",
    "date": "2026-02-09T14:42:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has revealed that it observed a multi‑stage intrusion that involved the threat actors exploiting internet‑exposed SolarWinds Web Help Desk (WHD) instances to obtain initial access and move l..."
  },
  {
    "title": "BeyondTrust warns of critical RCE flaw in remote support software",
    "link": "https://www.bleepingcomputer.com/news/security/beyondtrust-warns-of-critical-rce-flaw-in-remote-support-software/",
    "date": "2026-02-09T13:07:03.000Z",
    "source": "Bleeping Computer",
    "summary": "BeyondTrust warned customers to patch a critical security flaw in its Remote Support (RS) and Privileged Remote Access (PRA) software that could allow unauthenticated attackers to execute arbitrary co..."
  },
  {
    "title": "⚡ Weekly Recap: AI Skill Malware, 31Tbps DDoS, Notepad++ Hack, LLM Backdoors and More",
    "link": "https://thehackernews.com/2026/02/weekly-recap-ai-skill-malware-31tbps.html",
    "date": "2026-02-09T12:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyber threats are no longer coming from just malware or exploits. They’re showing up inside the tools, platforms, and ecosystems organizations use every day. As companies connect AI, cloud apps, devel..."
  },
  {
    "title": "Men charged in FanDuel scheme fueled by thousands of stolen identities",
    "link": "https://www.bleepingcomputer.com/news/security/men-charged-in-massive-fanduel-fraud-scheme-fueled-by-thousands-of-stolen-identities/",
    "date": "2026-02-09T11:41:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Two Connecticut men face federal charges for allegedly defrauding FanDuel and other online gambling sites of $3 million over several years using the stolen identities of approximately 3,000 victims. [..."
  },
  {
    "title": "How Top CISOs Solve Burnout and Speed up MTTR without Extra Hiring",
    "link": "https://thehackernews.com/2026/02/how-top-cisos-solve-burnout-and-speed.html",
    "date": "2026-02-09T11:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Why do SOC teams keep burning out and missing SLAs even after spending big on security tools? Routine triage piles up, senior specialists get dragged into basic validation, and MTTR climbs, while stea..."
  },
  {
    "title": "Bloody Wolf Targets Uzbekistan, Russia Using NetSupport RAT in Spear-Phishing Campaign",
    "link": "https://thehackernews.com/2026/02/bloody-wolf-targets-uzbekistan-russia.html",
    "date": "2026-02-09T10:58:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Bloody Wolf has been linked to a campaign targeting Uzbekistan and Russia to infect systems with a remote access trojan known as NetSupport RAT.\nCybersecurity vendor Kaspersk..."
  },
  {
    "title": "Microsoft: Exchange Online flags legitimate emails as phishing",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-online-flags-legitimate-emails-as-phishing/",
    "date": "2026-02-09T10:47:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating an ongoing Exchange Online issue that mistakenly flags legitimate emails as phishing and quarantines them. [...]..."
  },
  {
    "title": "European Commission discloses breach that exposed staff data",
    "link": "https://www.bleepingcomputer.com/news/security/european-commission-discloses-breach-that-exposed-staff-data/",
    "date": "2026-02-09T09:49:04.000Z",
    "source": "Bleeping Computer",
    "summary": "The European Commission is investigating a breach after finding evidence that its mobile device management platform was hacked. [...]..."
  },
  {
    "title": "TeamPCP Worm Exploits Cloud Infrastructure to Build Criminal Infrastructure",
    "link": "https://thehackernews.com/2026/02/teampcp-worm-exploits-cloud.html",
    "date": "2026-02-09T08:37:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have called attention to a \"massive campaign\" that has systematically targeted cloud native environments to set up malicious infrastructure for follow-on exploitation.\nThe ac..."
  },
  {
    "title": "BeyondTrust Fixes Critical Pre-Auth RCE Vulnerability in Remote Support and PRA",
    "link": "https://thehackernews.com/2026/02/beyondtrust-fixes-critical-pre-auth-rce.html",
    "date": "2026-02-09T08:03:00.000Z",
    "source": "The Hacker News",
    "summary": "BeyondTrust has released updates to address a critical security flaw impacting Remote Support (RS) and Privileged Remote Access (PRA) products that, if successfully exploited, could result in remote c..."
  },
  {
    "title": "New tool blocks imposter attacks disguised as safe commands",
    "link": "https://www.bleepingcomputer.com/news/security/new-tool-blocks-imposter-attacks-disguised-as-safe-commands/",
    "date": "2026-02-08T15:26:48.000Z",
    "source": "Bleeping Computer",
    "summary": "A new open-source and cross-platform tool called Tirith can detect homoglyph attacks over command-line environments by analyzing URLs in typed commands and stopping their execution.  [...]..."
  },
  {
    "title": "OpenClaw Integrates VirusTotal Scanning to Detect Malicious ClawHub Skills",
    "link": "https://thehackernews.com/2026/02/openclaw-integrates-virustotal-scanning.html",
    "date": "2026-02-08T07:32:00.000Z",
    "source": "The Hacker News",
    "summary": "OpenClaw (formerly Moltbot and Clawdbot) has announced that it's partnering with Google-owned VirusTotal to scan skills that are being uploaded to ClawHub, its skill marketplace, as part of broader ef..."
  },
  {
    "title": "State actor targets 155 countries in 'Shadow Campaigns' espionage op",
    "link": "https://www.bleepingcomputer.com/news/security/state-actor-targets-155-countries-in-shadow-campaigns-espionage-op/",
    "date": "2026-02-07T15:09:46.000Z",
    "source": "Bleeping Computer",
    "summary": "A new state-aligned cyberespionage threat group tracked as TGR-STA-1030/UNC6619, has conducted a global-scale operation dubbed the \"Shadow Campaigns,\" where it targeted government infrastructure in 15..."
  },
  {
    "title": "German Agencies Warn of Signal Phishing Targeting Politicians, Military, Journalists",
    "link": "https://thehackernews.com/2026/02/german-agencies-warn-of-signal-phishing.html",
    "date": "2026-02-07T11:15:00.000Z",
    "source": "The Hacker News",
    "summary": "Germany's Federal Office for the Protection of the Constitution (aka Bundesamt für Verfassungsschutz or BfV) and Federal Office for Information Security (BSI) have issued a joint advisory warning of a..."
  },
  {
    "title": "Payments platform BridgePay confirms ransomware attack behind outage",
    "link": "https://www.bleepingcomputer.com/news/security/payments-platform-bridgepay-confirms-ransomware-attack-behind-outage/",
    "date": "2026-02-07T09:47:10.000Z",
    "source": "Bleeping Computer",
    "summary": "A major U.S. payment gateway and solutions provider says a ransomware attack has knocked key systems offline, triggering a widespread outage affecting multiple services. The incident began on Friday a..."
  },
  {
    "title": "Germany warns of Signal account hijacking targeting senior figures",
    "link": "https://www.bleepingcomputer.com/news/security/germany-warns-of-signal-account-hijacking-targeting-senior-figures/",
    "date": "2026-02-06T20:00:33.000Z",
    "source": "Bleeping Computer",
    "summary": "Germany's domestic intelligence agency is warning of suspected state-sponsored threat actors targeting high-ranking individuals in phishing attacks via messaging apps like Signal. [...]..."
  }
]