[
  {
    "title": "Qilin Ransomware Combines Linux Payload With BYOVD Exploit in Hybrid Attack",
    "link": "https://thehackernews.com/2025/10/qilin-ransomware-combines-linux-payload.html",
    "date": "2025-10-27T08:55:00.000Z",
    "source": "The Hacker News",
    "summary": "The ransomware group known as Qilin (aka Agenda, Gold Feather, and Water Galura) has claimed more than 40 victims every month since the start of 2025, barring January, with the number of postings on i..."
  },
  {
    "title": "ChatGPT Atlas Browser Can Be Tricked by Fake URLs into Executing Hidden Commands",
    "link": "https://thehackernews.com/2025/10/chatgpt-atlas-browser-can-be-tricked-by.html",
    "date": "2025-10-27T07:29:00.000Z",
    "source": "The Hacker News",
    "summary": "The newly released OpenAI Atlas web browser has been found to be susceptible to a prompt injection attack where its omnibox can be jailbroken by disguising a malicious prompt as a seemingly harmless U..."
  },
  {
    "title": "Hackers steal Discord accounts with RedTiger-based infostealer",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-steal-discord-accounts-with-redtiger-based-infostealer/",
    "date": "2025-10-26T14:26:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers are using the open-source red-team tool RedTiger to build an infostealer that collects Discord account data and payment information. [...]..."
  },
  {
    "title": "New CoPhish attack steals OAuth tokens via Copilot Studio agents",
    "link": "https://www.bleepingcomputer.com/news/security/new-cophish-attack-steals-oauth-tokens-via-copilot-studio-agents/",
    "date": "2025-10-25T16:16:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A new phishing technique dubbed 'CoPhish' weaponizes Microsoft Copilot Studio agents to deliver fraudulent OAuth consent requests via legitimate and trusted Microsoft domains. [...]..."
  },
  {
    "title": "Microsoft Issues Emergency Patch for Critical Windows Server Bug",
    "link": "https://www.darkreading.com/vulnerabilities-threats/microsoft-emergency-patch-windows-server-bug",
    "date": "2025-10-24T19:34:00.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft initially fixed CVE-2025-59287 in the WSUS update mechanism in the October 2025 Patch Tuesday release, but the company has now issued a second, out-of-band update for the flaw, which is unde..."
  },
  {
    "title": "Hackers launch mass attacks exploiting outdated WordPress plugins",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-launch-mass-attacks-exploiting-outdated-wordpress-plugins/",
    "date": "2025-10-24T19:28:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A widespread exploitation campaign is targeting WordPress websites with GutenKit and Hunk Companion plugins vulnerable to critical-severity, old security issues that can be used to achieve remote code..."
  },
  {
    "title": "Smishing Triad Linked to 194,000 Malicious Domains in Global Phishing Operation",
    "link": "https://thehackernews.com/2025/10/smishing-triad-linked-to-194000.html",
    "date": "2025-10-24T18:35:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actors behind a large-scale, ongoing smishing campaign have been attributed to more than 194,000 malicious domains since January 1, 2024, targeting a broad range of services across the worl..."
  },
  {
    "title": "How CISA Layoffs Weaken Civilian Cyber Defense",
    "link": "https://www.darkreading.com/cybersecurity-operations/cisa-layoffs-weaken-civilian-cyber-defense",
    "date": "2025-10-24T17:41:33.000Z",
    "source": "Dark Reading",
    "summary": "Cyber teams need to get to work backfilling diminishing federal resources, according to Alexander Garcia-Tobar, who shares clear steps on a path forward for protecting enterprises with less CISA help...."
  },
  {
    "title": "Newly Patched Critical Microsoft WSUS Flaw Comes Under Active Exploitation",
    "link": "https://thehackernews.com/2025/10/microsoft-issues-emergency-patch-for.html",
    "date": "2025-10-24T16:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Thursday released out-of-band security updates to patch a critical-severity Windows Server Update Service (WSUS) vulnerability with a proof-of-concept (Poc) exploit publicly available and..."
  },
  {
    "title": "Critical WSUS flaw in Windows Server now exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-now-exploiting-critical-windows-server-wsus-flaw-in-attacks/",
    "date": "2025-10-24T16:28:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Attackers are now exploiting a critical-severity Windows Server Update Service (WSUS) vulnerability, which already has publicly available proof-of-concept exploit code. [...]..."
  },
  {
    "title": "Shutdown Sparks 85% Increase in US Government Cyberattacks",
    "link": "https://www.darkreading.com/cybersecurity-operations/shutdown-increase-us-government-cyberattacks",
    "date": "2025-10-24T16:23:19.000Z",
    "source": "Dark Reading",
    "summary": "Attackers are pouncing on financially strapped US government agencies and furloughed employees. And the effects of this period might be felt for a long time hereafter...."
  },
  {
    "title": "Amazon: This week’s AWS outage caused by major DNS failure",
    "link": "https://www.bleepingcomputer.com/news/technology/amazon-this-weeks-aws-outage-caused-by-major-dns-failure/",
    "date": "2025-10-24T15:33:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Amazon says a major DNS failure was behind a massive AWS (Amazon Web Services) outage that took down many websites and online services on Monday. [...]..."
  },
  {
    "title": "Fake LastPass death claims used to breach password vaults",
    "link": "https://www.bleepingcomputer.com/news/security/fake-lastpass-death-claims-used-to-breach-password-vaults/",
    "date": "2025-10-24T14:47:48.000Z",
    "source": "Bleeping Computer",
    "summary": "LastPass is warning customers of a phishing campaign sending emails with an access request to the password vault as part of a legacy inheritance process. [...]..."
  },
  {
    "title": "How to reduce costs with self-service password resets",
    "link": "https://www.bleepingcomputer.com/news/security/how-to-reduce-costs-with-self-service-password-resets/",
    "date": "2025-10-24T14:06:16.000Z",
    "source": "Bleeping Computer",
    "summary": "Password resets account for nearly 40% of IT help desk calls, costing orgs time and money. Specops Software's uReset lets users securely reset passwords with flexible MFA options like Duo, Okta, and Y..."
  },
  {
    "title": "APT36 Targets Indian Government with Golang-Based DeskRAT Malware Campaign",
    "link": "https://thehackernews.com/2025/10/apt36-targets-indian-government-with.html",
    "date": "2025-10-24T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A Pakistan-nexus threat actor has been observed targeting Indian government entities as part of spear-phishing attacks designed to deliver a Golang-based malware known as DeskRAT.\nThe activity, observ..."
  },
  {
    "title": "Mozilla: New Firefox extensions must disclose data collection practices",
    "link": "https://www.bleepingcomputer.com/news/software/mozilla-new-firefox-extensions-must-disclose-data-collection-practices/",
    "date": "2025-10-24T13:17:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Starting next month, Mozilla will require Firefox extension developers to disclose whether their add-ons collect or share user data with third parties. [...]..."
  },
  {
    "title": "The Cybersecurity Perception Gap: Why Executives and Practitioners See Risk Differently",
    "link": "https://thehackernews.com/2025/10/the-cybersecurity-perception-gap-why.html",
    "date": "2025-10-24T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Does your organization suffer from a cybersecurity perception gap? Findings from the Bitdefender 2025 Cybersecurity Assessment suggest the answer is probably “yes” — and many leaders may not even real..."
  },
  {
    "title": "3,000 YouTube Videos Exposed as Malware Traps in Massive Ghost Network Operation",
    "link": "https://thehackernews.com/2025/10/3000-youtube-videos-exposed-as-malware.html",
    "date": "2025-10-24T10:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A malicious network of YouTube accounts has been observed publishing and promoting videos that lead to malware downloads, essentially abusing the popularity and trust associated with the video hosting..."
  },
  {
    "title": "Windows Server emergency patches fix WSUS bug with PoC exploit",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-releases-windows-server-emergency-updates-for-critical-wsus-rce-flaw/",
    "date": "2025-10-24T07:27:56.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released out-of-band (OOB) security updates to patch a critical-severity Windows Server Update Service (WSUS) vulnerability with publicly available proof-of-concept exploit code. [...]..."
  },
  {
    "title": "Self-Spreading 'GlassWorm' Infects VS Code Extensions in Widespread Supply Chain Attack",
    "link": "https://thehackernews.com/2025/10/self-spreading-glassworm-infects-vs.html",
    "date": "2025-10-24T07:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a self-propagating worm that spreads via Visual Studio Code (VS Code) extensions on the Open VSX Registry and the Microsoft Extension Marketplace, underscorin..."
  },
  {
    "title": "Hackers earn $1,024,750 for 73 zero-days at Pwn2Own Ireland",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-earn-1-024-750-for-73-zero-days-at-pwn2own-ireland/",
    "date": "2025-10-24T06:36:55.000Z",
    "source": "Bleeping Computer",
    "summary": "​The Pwn2Own Ireland 2025 hacking competition has ended with security researchers collecting $1,024,750 in cash awards after exploiting 73 zero-day vulnerabilities. [...]..."
  },
  {
    "title": "US Crypto Bust Offers Hope in Battle Against Cybercrime Syndicates",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/us-crypto-bust-hope-battle-against-cybercrime-syndicates",
    "date": "2025-10-24T02:00:00.000Z",
    "source": "Dark Reading",
    "summary": "A $14 billion seizure by US investigators presents a warning for cybercriminals' reliance on bitcoin but is still a positive development for the cryptocurrency industry...."
  },
  {
    "title": "Toys “R” Us Canada warns customers' info leaked in data breach",
    "link": "https://www.bleepingcomputer.com/news/security/toys-r-us-canada-warns-customers-info-leaked-in-data-breach/",
    "date": "2025-10-23T22:25:35.000Z",
    "source": "Bleeping Computer",
    "summary": "Toys \"R\" Us Canada has sent notices of a data breach to customers informing them of a security incident where threat actors leaked customer records they had previously stolen from its systems. [...]..."
  },
  {
    "title": "HP pulls update that broke Microsoft Entra ID auth on some AI PCs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/hp-pulls-update-that-broke-microsoft-entra-id-auth-on-some-ai-pcs/",
    "date": "2025-10-23T21:50:41.000Z",
    "source": "Bleeping Computer",
    "summary": "HP has pulled an HP OneAgent software update for Windows 11 that mistakenly deleted Microsoft certificates required for some organizations to log in to Microsoft Entra ID, effectively disconnecting th..."
  },
  {
    "title": "Fear the 'SessionReaper': Adobe Commerce Flaw Under Attack",
    "link": "https://www.darkreading.com/vulnerabilities-threats/sessionreaper-adobe-commerce-flaw-under-attack",
    "date": "2025-10-23T21:25:50.000Z",
    "source": "Dark Reading",
    "summary": "CVE-2025-54236 is a critical flaw in Adobe Commerce (formerly Magento) that allows attackers to remotely take over sessions on the e-commerce platform...."
  },
  {
    "title": "Tired of Unpaid Toll Texts? Blame the 'Smishing Triad'",
    "link": "https://www.darkreading.com/threat-intelligence/unpaid-toll-texts-smishing-triad",
    "date": "2025-10-23T20:19:43.000Z",
    "source": "Dark Reading",
    "summary": "Chinese smishers — the bane of every American with a phone — have been shifting to lower-frequency, possibly higher-impact government impersonation attacks...."
  },
  {
    "title": "North Korean Hackers Lure Defense Engineers With Fake Jobs to Steal Drone Secrets",
    "link": "https://thehackernews.com/2025/10/north-korean-hackers-lure-defense.html",
    "date": "2025-10-23T15:29:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with ties to North Korea have been attributed to a new wave of attacks targeting European companies active in the defense industry as part of a long-running campaign known as Operation D..."
  },
  {
    "title": "Secure AI at Scale and Speed — Learn the Framework in this Free Webinar",
    "link": "https://thehackernews.com/2025/10/secure-ai-at-scale-and-speed-learn.html",
    "date": "2025-10-23T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "AI is everywhere—and your company wants in. Faster products, smarter systems, fewer bottlenecks. But if you're in security, that excitement often comes with a sinking feeling.\nBecause while everyone e..."
  },
  {
    "title": "ThreatsDay Bulletin: $176M Crypto Fine, Hacking Formula 1, Chromium Vulns, AI Hijack & More",
    "link": "https://thehackernews.com/2025/10/threatsday-bulletin-176m-crypto-fine.html",
    "date": "2025-10-23T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Criminals don’t need to be clever all the time; they just follow the easiest path in: trick users, exploit stale components, or abuse trusted systems like OAuth and package registries. If your stack o..."
  },
  {
    "title": "Why Organizations Are Abandoning Static Secrets for Managed Identities",
    "link": "https://thehackernews.com/2025/10/why-organizations-are-abandoning-static.html",
    "date": "2025-10-23T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "As machine identities explode across cloud environments, enterprises report dramatic productivity gains from eliminating static credentials. And only legacy systems remain the weak link.\nFor decades, ..."
  }
]