[
  {
    "title": "GISEC GLOBAL 2026 – The Middle East &amp; Africa’s Largest Cybersecurity Event",
    "link": "https://www.darkreading.com/events/gisec-global",
    "date": "2025-12-15T15:09:54.818Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Microsoft: Recent Windows updates break VPN access for WSL users",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-recent-windows-updates-cause-wsl-networking-issues/",
    "date": "2025-12-15T14:34:31.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft says that recent Windows 11 security updates are causing VPN networking failures for enterprise users running Windows Subsystem for Linux. [...]..."
  },
  {
    "title": "FreePBX Patches Critical SQLi, File-Upload, and AUTHTYPE Bypass Flaws Enabling RCE",
    "link": "https://thehackernews.com/2025/12/freepbx-authentication-bypass-exposed.html",
    "date": "2025-12-15T14:32:00.000Z",
    "source": "The Hacker News",
    "summary": "Multiple security vulnerabilities have been disclosed in the open-source private branch exchange (PBX) platform FreePBX, including a critical flaw that could result in an authentication bypass under c..."
  },
  {
    "title": "Google links more Chinese hacking groups to React2Shell attacks",
    "link": "https://www.bleepingcomputer.com/news/security/google-links-more-chinese-hacking-groups-to-react2shell-attacks/",
    "date": "2025-12-15T12:46:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Over the weekend, ​Google's threat intelligence team linked five more Chinese hacking groups to attacks exploiting the maximum-severity \"React2Shell\" remote code execution vulnerability. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Apple 0-Days, WinRAR Exploit, LastPass Fines, .NET RCE, OAuth Scams & More",
    "link": "https://thehackernews.com/2025/12/weekly-recap-apple-0-days-winrar.html",
    "date": "2025-12-15T12:24:00.000Z",
    "source": "The Hacker News",
    "summary": "If you use a smartphone, browse the web, or unzip files on your computer, you are in the crosshairs this week. Hackers are currently exploiting critical flaws in the daily software we all rely on—and ..."
  },
  {
    "title": "A Browser Extension Risk Guide After the ShadyPanda Campaign",
    "link": "https://thehackernews.com/2025/12/a-browser-extension-risk-guide-after.html",
    "date": "2025-12-15T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "In early December 2025, security researchers exposed a cybercrime campaign that had quietly hijacked popular Chrome and Edge browser extensions on a massive scale.\nA threat group dubbed ShadyPanda spe..."
  },
  {
    "title": "French Interior Ministry confirms cyberattack on email servers",
    "link": "https://www.bleepingcomputer.com/news/security/france-interior-ministry-confirms-cyberattack-on-email-servers/",
    "date": "2025-12-15T11:06:10.000Z",
    "source": "Bleeping Computer",
    "summary": "The French Interior Minister confirmed on Friday that the country's Ministry of the Interior was breached in a cyberattack that compromised e-mail servers. [...]..."
  },
  {
    "title": "Phantom Stealer Spread by ISO Phishing Emails Hitting Russian Finance Sector",
    "link": "https://thehackernews.com/2025/12/phantom-stealer-spread-by-iso-phishing.html",
    "date": "2025-12-15T09:24:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of an active phishing campaign that's targeting a wide range of sectors in Russia with phishing emails that deliver Phantom Stealer via malicious ISO o..."
  },
  {
    "title": "Microsoft: December security updates cause Message Queuing failures",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-december-security-updates-cause-message-queuing-failures/",
    "date": "2025-12-15T09:04:59.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed that the December 2025 security updates are breaking Message Queuing (MSMQ) functionality, affecting enterprise applications and Internet Information Services (IIS) websites. [..."
  },
  {
    "title": "VolkLocker Ransomware Exposed by Hard-Coded Master Key Allowing Free Decryption",
    "link": "https://thehackernews.com/2025/12/volklocker-ransomware-exposed-by-hard.html",
    "date": "2025-12-15T05:33:00.000Z",
    "source": "The Hacker News",
    "summary": "The pro-Russian hacktivist group known as CyberVolk (aka GLORIAMIST) has resurfaced with a new ransomware-as-a-service (RaaS) offering called VolkLocker that suffers from implementation lapses in test..."
  },
  {
    "title": "Beware: PayPal subscriptions abused to send fake purchase emails",
    "link": "https://www.bleepingcomputer.com/news/security/beware-paypal-subscriptions-abused-to-send-fake-purchase-emails/",
    "date": "2025-12-14T16:06:10.000Z",
    "source": "Bleeping Computer",
    "summary": "An email scam is abusing abusing PayPal's \"Subscriptions\" billing feature to send legitimate PayPal emails that contain fake purchase notifications embedded in the Customer service URL field. [...]..."
  },
  {
    "title": "CyberVolk’s ransomware debut stumbles on cryptography weakness",
    "link": "https://www.bleepingcomputer.com/news/security/cybervolks-ransomware-debut-stumbles-on-cryptography-weakness/",
    "date": "2025-12-13T15:11:21.000Z",
    "source": "Bleeping Computer",
    "summary": "The pro-Russia hacktivist group CyberVolk launched a ransomware-as-a-service (RaaS) called VolkLocker that suffered from serious implementation flaws, allowing victims to potentially decrypt files for..."
  },
  {
    "title": "CISA Adds Actively Exploited Sierra Wireless Router Flaw Enabling RCE Attacks",
    "link": "https://thehackernews.com/2025/12/cisa-adds-actively-exploited-sierra.html",
    "date": "2025-12-13T12:33:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added a high-severity flaw impacting Sierra Wireless AirLink ALEOS routers to its Known Exploited Vulnerabilities (KEV) catal..."
  },
  {
    "title": "Apple Issues Security Updates After Two WebKit Flaws Found Exploited in the Wild",
    "link": "https://thehackernews.com/2025/12/apple-issues-security-updates-after-two.html",
    "date": "2025-12-13T05:32:00.000Z",
    "source": "The Hacker News",
    "summary": "Apple on Friday released security updates for iOS, iPadOS, macOS, tvOS, watchOS, visionOS, and its Safari web browser to address two security flaws that it said have been exploited in the wild, one of..."
  },
  {
    "title": "Apple fixes two zero-day flaws exploited in 'sophisticated' attacks",
    "link": "https://www.bleepingcomputer.com/news/security/apple-fixes-two-zero-day-flaws-exploited-in-sophisticated-attacks/",
    "date": "2025-12-12T23:23:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Apple has released emergency updates to patch two zero-day vulnerabilities that were exploited in an \"extremely sophisticated attack\" targeting specific individuals. [...]..."
  },
  {
    "title": "The CISO-COO Partnership: Protecting Operational Excellence",
    "link": "https://www.darkreading.com/cybersecurity-operations/the-ciso-coo-partnership-protecting-operational-excellence",
    "date": "2025-12-12T21:12:13.000Z",
    "source": "Dark Reading",
    "summary": "Digital transformation has made cybersecurity preparation part of operational resilience for most organizations. This calls for a new relationship between CISOs and COOs...."
  },
  {
    "title": "React2Shell Exploits Flood the Internet as Attacks Continue",
    "link": "https://www.darkreading.com/threat-intelligence/react2shell-exploits-flood-internet-attacks-continue",
    "date": "2025-12-12T20:11:43.000Z",
    "source": "Dark Reading",
    "summary": "As exploitation activity against CVE-2025-55182 ramps up, researchers are finding some proof-of-concept exploits contain bypasses for web application firewall (WAF) rules...."
  },
  {
    "title": "Vibe Coding: Innovation Demands Vigilance",
    "link": "https://www.darkreading.com/application-security/vibe-coding-innovation-demands-vigilance",
    "date": "2025-12-12T20:07:23.000Z",
    "source": "Dark Reading",
    "summary": "Unmanaged coding is indeed an alluring idea, but can introduce a host of significant cybersecurity dangers, Constantine warns...."
  },
  {
    "title": "Microsoft Will Bundle Security Copilot With M365 Enterprise Licenses",
    "link": "https://www.darkreading.com/cybersecurity-operations/microsoft-bundle-security-copilot-m365-enterprise-license",
    "date": "2025-12-12T19:32:42.000Z",
    "source": "Dark Reading",
    "summary": "The move aims to expand the use of Security Copilot and comes with the launch of 12 new agents from Microsoft at the company's Ignite conference last week...."
  },
  {
    "title": "Fake OSINT and GPT Utility GitHub Repos Spread PyStoreRAT Malware Payloads",
    "link": "https://thehackernews.com/2025/12/fake-osint-and-gpt-utility-github-repos.html",
    "date": "2025-12-12T18:50:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a new campaign that's leveraging GitHub-hosted Python repositories to distribute a previously undocumented JavaScript-based Remote Access Trojan (RAT..."
  },
  {
    "title": "Supply Chain Attacks Targeting GitHub Actions Increased in 2025",
    "link": "https://www.darkreading.com/application-security/supply-chain-attacks-targeting-github-actions-increased-in-2025",
    "date": "2025-12-12T18:37:53.000Z",
    "source": "Dark Reading",
    "summary": "At this week's Black Hat Europe conference, two researchers urged developers to adopt a shared responsibility model for open source software and not leave it all up to GitHub to handle...."
  },
  {
    "title": "Coupang data breach traced to ex-employee who retained system access",
    "link": "https://www.bleepingcomputer.com/news/security/coupang-data-breach-traced-to-ex-employee-who-retained-system-access/",
    "date": "2025-12-12T18:28:30.000Z",
    "source": "Bleeping Computer",
    "summary": "A data breach at Coupang that exposed the information of 33.7 million customers has been tied to a former employee who retained access to internal systems after leaving the company. [...]..."
  },
  {
    "title": "Fake ‘One Battle After Another’ torrent hides malware in subtitles",
    "link": "https://www.bleepingcomputer.com/news/security/fake-one-battle-after-another-torrent-hides-malware-in-subtitles/",
    "date": "2025-12-12T17:12:47.000Z",
    "source": "Bleeping Computer",
    "summary": "A fake torrent for Leonardo DiCaprio's 'One Battle After Another' hides malicious PowerShell malware loaders inside subtitle files that ultimately infect devices with the Agent Tesla RAT malware. [......"
  },
  {
    "title": "Kali Linux 2025.4 released with 3 new tools, desktop updates",
    "link": "https://www.bleepingcomputer.com/news/security/kali-linux-20254-released-with-3-new-tools-desktop-updates/",
    "date": "2025-12-12T15:27:16.000Z",
    "source": "Bleeping Computer",
    "summary": "Kali Linux has released version 2025.4, its final update of the year, introducing three new hacking tools, desktop environment improvements, the preview of Wifipumpkin3 in NetHunter, and enhanced Wayl..."
  },
  {
    "title": "Shadow spreadsheets: The security gap your tools can’t see",
    "link": "https://www.bleepingcomputer.com/news/security/shadow-spreadsheets-the-security-gap-your-tools-cant-see/",
    "date": "2025-12-12T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "When official systems can't support everyday workflows, employees turn to spreadsheets — creating \"shadow spreadsheets\" that circulate unchecked. Grist shows how these spreadsheets expose sensitive da..."
  },
  {
    "title": "New Advanced Phishing Kits Use AI and MFA Bypass Tactics to Steal Credentials at Scale",
    "link": "https://thehackernews.com/2025/12/new-advanced-phishing-kits-use-ai-and.html",
    "date": "2025-12-12T14:04:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have documented four new phishing kits named BlackForce, GhostFrame, InboxPrime AI, and Spiderman that are capable of facilitating credential theft at scale.\nBlackForce, firs..."
  },
  {
    "title": "Are Trade Concerns Trumping US Cybersecurity?",
    "link": "https://www.darkreading.com/cyber-risk/trade-concerns-trumping-cybersecurity",
    "date": "2025-12-12T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The Trump administration appears to have dropped sanctions against Chinese actors for the Salt Typhoon attacks on US telecoms; but focusing on diplomacy alone misses the full picture, experts say...."
  },
  {
    "title": "Securing GenAI in the Browser: Policy, Isolation, and Data Controls That Actually Work",
    "link": "https://thehackernews.com/2025/12/securing-genai-in-browser-policy.html",
    "date": "2025-12-12T10:18:00.000Z",
    "source": "The Hacker News",
    "summary": "The browser has become the main interface to GenAI for most enterprises: from web-based LLMs and copilots, to GenAI‑powered extensions and agentic browsers like ChatGPT Atlas. Employees are leveraging..."
  },
  {
    "title": "New React RSC Vulnerabilities Enable DoS and Source Code Exposure",
    "link": "https://thehackernews.com/2025/12/new-react-rsc-vulnerabilities-enable.html",
    "date": "2025-12-12T08:55:00.000Z",
    "source": "The Hacker News",
    "summary": "The React team has released fixes for two new types of flaws in React Server Components (RSC) that, if successfully exploited, could result in denial-of-service (DoS) or source code exposure.\nThe team..."
  },
  {
    "title": "React2Shell Exploitation Escalates into Large-Scale Global Attacks, Forcing Emergency Mitigation",
    "link": "https://thehackernews.com/2025/12/react2shell-exploitation-escalates-into.html",
    "date": "2025-12-12T08:41:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has urged federal agencies to patch the recent React2Shell vulnerability by December 12, 2025, amid reports of widespread exploitation...."
  }
]