[
  {
    "title": "Is that extension safe? This free tool lets you know before you install",
    "link": "https://www.zdnet.com/article/is-that-extension-safe-this-free-site-lets-you-know-before-you-install/",
    "date": "2025-05-28T14:54:09.000Z",
    "source": "ZDNet Security",
    "summary": "Don't install that unknown extension until you've checked out its reputation. Here's how to do that...."
  },
  {
    "title": "Czechia blames China for Ministry of Foreign Affairs cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/czechia-blames-china-for-ministry-of-foreign-affairs-cyberattack/",
    "date": "2025-05-28T14:39:25.000Z",
    "source": "Bleeping Computer",
    "summary": "The Czech Republic says the Chinese-backed APT31 hacking group was behind cyberattacks targeting the country's Ministry of Foreign Affairs and critical infrastructure organizations. [...]..."
  },
  {
    "title": "Why Take9 Won't Improve Cybersecurity",
    "link": "https://www.darkreading.com/cybersecurity-operations/why-take9-will-not-improve-cybersecurity",
    "date": "2025-05-28T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The latest cybersecurity awareness campaign asks users to pause for nine seconds before clicking — but this approach misplaces responsibility and ignores the real problems of system design...."
  },
  {
    "title": "Microsoft OneDrive File Picker Flaw Grants Apps Full Cloud Access — Even When Uploading Just One File",
    "link": "https://thehackernews.com/2025/05/microsoft-onedrive-file-picker-flaw.html",
    "date": "2025-05-28T13:41:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a security flaw in Microsoft's OneDrive File Picker that, if successfully exploited, could allow websites to access a user's entire cloud storage content, as ..."
  },
  {
    "title": "Microsoft introduces new Windows backup tool for businesses",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-introduces-new-windows-backup-tool-for-businesses/",
    "date": "2025-05-28T13:09:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has introduced Windows Backup for Organizations, a new backup tool for enterprises that simplifies backups and makes the transition to Windows 11 easier. [...]..."
  },
  {
    "title": "Have Your Say: Dark Reading Seeks Your Input",
    "link": "https://www.darkreading.com/threat-intelligence/have-your-say-dark-reading-seeks-your-input",
    "date": "2025-05-28T13:08:37.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading is offering its readers the opportunity to tell us how we're doing via a new survey...."
  },
  {
    "title": "New PumaBot Botnet Targets Linux IoT Devices to Steal SSH Credentials and Mine Crypto",
    "link": "https://thehackernews.com/2025/05/new-pumabot-botnet-targets-linux-iot.html",
    "date": "2025-05-28T12:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Embedded Linux-based Internet of Things (IoT) devices have become the target of a new botnet dubbed PumaBot.\nWritten in Go, the botnet is designed to conduct brute-force attacks against SSH instances ..."
  },
  {
    "title": "Zscaler Announces Deal to Acquire Red Canary",
    "link": "https://www.darkreading.com/threat-intelligence/zscaler-announces-deal-acquire-red-canary",
    "date": "2025-05-28T12:23:49.000Z",
    "source": "Dark Reading",
    "summary": "The August acquisition will bring together Red Canary's extensive integration ecosystem with Zscaler's cloud transaction data to deliver an AI-powered security operations platform...."
  },
  {
    "title": "Microsoft wants Windows to update all software on your PC",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-wants-windows-to-update-all-software-on-your-pc/",
    "date": "2025-05-28T12:15:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has introduced a new update orchestration platform built on the existing Windows Update infrastructure, which aims to unify the updating system for all apps, drivers, and system components o..."
  },
  {
    "title": "From Infection to Access: A 24-Hour Timeline of a Modern Stealer Campaign",
    "link": "https://thehackernews.com/2025/05/from-infection-to-access-24-hour.html",
    "date": "2025-05-28T11:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Stealer malware no longer just steals passwords. In 2025, it steals live sessions—and attackers are moving faster and more efficiently than ever.\nWhile many associate account takeovers with personal s..."
  },
  {
    "title": "Mimo Hackers Exploit CVE-2025-32432 in Craft CMS to Deploy Cryptominer and Proxyware",
    "link": "https://thehackernews.com/2025/05/mimo-hackers-exploit-cve-2025-32432-in.html",
    "date": "2025-05-28T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "A financially motivated threat actor has been observed exploiting a recently disclosed remote code execution flaw affecting the Craft Content Management System (CMS) to deploy multiple payloads, inclu..."
  },
  {
    "title": "Apple blocked over $9 billion in App Store fraud in five years",
    "link": "https://www.bleepingcomputer.com/news/apple/apple-blocked-over-9-billion-in-apap-store-fraud-since-2020/",
    "date": "2025-05-28T10:18:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Apple says it blocked over $9 billion in fraudulent App Store transactions over the last five years, with over $2 billion in potentially fraudulent sanctions prevented in 2024 alone. [...]..."
  },
  {
    "title": "How 'Browser-in-the-Middle' Attacks Steal Sessions in Seconds",
    "link": "https://thehackernews.com/2025/05/how-browser-in-middle-attacks-steal.html",
    "date": "2025-05-28T09:32:00.000Z",
    "source": "The Hacker News",
    "summary": "Would you expect an end user to log on to a cybercriminal’s computer, open their browser, and type in their usernames and passwords? Hopefully not! But that’s essentially what happens if they fall vic..."
  },
  {
    "title": "How to disable ACR on your TV (and why you shouldn't wait to do it)",
    "link": "https://www.zdnet.com/article/how-to-disable-acr-on-your-tv-and-why-you-shouldnt-wait-to-do-it/",
    "date": "2025-05-28T09:30:14.000Z",
    "source": "ZDNet Security",
    "summary": "Smarter TV operating systems offer added convenience, but they also introduce new privacy concerns, particularly around automatic content recognition (ACR)...."
  },
  {
    "title": "251 Amazon-Hosted IPs Used in Exploit Scan Targeting ColdFusion, Struts, and Elasticsearch",
    "link": "https://thehackernews.com/2025/05/251-amazon-hosted-ips-used-in-exploit.html",
    "date": "2025-05-28T09:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a coordinated cloud-based scanning activity that targeted 75 distinct \"exposure points\" earlier this month.\nThe activity, observed by GreyNoise on M..."
  },
  {
    "title": "Apple Blocks $9 Billion in Fraud Over 5 Years Amid Rising App Store Threats",
    "link": "https://thehackernews.com/2025/05/apple-blocks-9-billion-in-fraud-over-5.html",
    "date": "2025-05-28T06:11:00.000Z",
    "source": "The Hacker News",
    "summary": "Apple on Tuesday revealed that it prevented over $9 billion in fraudulent transactions in the last five years, including more than $2 billion in 2024 alone.\nThe company said the App Store is confronte..."
  },
  {
    "title": "Indian Police Arrest Cybercrime Gang Copycats of Myanmar Biz Model",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/indian-police-arrest-cybercrime-gang-copycats-myanmar-biz-model",
    "date": "2025-05-28T03:30:00.000Z",
    "source": "Dark Reading",
    "summary": "The region offers attractive conditions: a large pool of tech workers, economic disparity, and weak enforcement of cybercrime laws — all of which attract businesses legitimate and shady...."
  },
  {
    "title": "DragonForce ransomware abuses SimpleHelp in MSP supply chain attack",
    "link": "https://www.bleepingcomputer.com/news/security/dragonforce-ransomware-abuses-simplehelp-in-msp-supply-chain-attack/",
    "date": "2025-05-27T21:44:15.000Z",
    "source": "Bleeping Computer",
    "summary": "The DragonForce ransomware operation successfully breached a managed service provider and used its SimpleHelp remote monitoring and management (RMM) platform to steal data and deploy encryptors on dow..."
  },
  {
    "title": "Adidas Falls Victim to Third-Party Data Breach",
    "link": "https://www.darkreading.com/vulnerabilities-threats/adidas-victim-third-party-data-breach",
    "date": "2025-05-27T21:38:05.000Z",
    "source": "Dark Reading",
    "summary": "Though Adidas said that no payment or financial information was affected in the breach, individuals who contacted the compamy's customer service help desk were impacted...."
  },
  {
    "title": "CISA Warns of Attacks Targeting Commvault SaaS Environment",
    "link": "https://www.darkreading.com/cloud-security/cisa-warns-attacks-commvault-saas-environment",
    "date": "2025-05-27T21:22:27.000Z",
    "source": "Dark Reading",
    "summary": "A threat actor has gained access to Microsoft 365 environments of a small number of customers of Commvault's Metallic service...."
  },
  {
    "title": "DragonForce Ransomware Strikes MSP in Supply Chain Attack",
    "link": "https://www.darkreading.com/application-security/dragonforce-ransomware-msp-supply-chain-attack",
    "date": "2025-05-27T20:15:31.000Z",
    "source": "Dark Reading",
    "summary": "DragonForce, a ransomware \"cartel\" that has gained significant popularity since its debut in 2023, attacked an MSP as part of a recent supply chain attack, via known SimpleHelp bugs...."
  },
  {
    "title": "Iranian pleads guilty to RobbinHood ransomware attacks, faces 30 years",
    "link": "https://www.bleepingcomputer.com/news/security/iranian-pleads-guilty-to-robbinhood-ransomware-attacks-faces-30-years/",
    "date": "2025-05-27T19:14:56.000Z",
    "source": "Bleeping Computer",
    "summary": "An Iranian national has pleaded guilty to participating in the Robbinhood ransomware operation, which was used to breach the networks, steal data, and encrypt devices of U.S. cities and organizations ..."
  },
  {
    "title": "MathWorks, Creator of MATLAB, Confirms Ransomware Attack",
    "link": "https://www.darkreading.com/vulnerabilities-threats/mathworks-confirms-ransomware-attack",
    "date": "2025-05-27T17:27:19.000Z",
    "source": "Dark Reading",
    "summary": "The attack dirsupted MathWorks' systems and online applications, but it remains unclear which ransomware group targeted the software company and whether they stole any data...."
  },
  {
    "title": "Lock down your data and save 20% on this encrypted Kingston portable SSD",
    "link": "https://www.zdnet.com/article/lock-down-your-data-and-save-20-on-this-encrypted-kingston-portable-ssd/",
    "date": "2025-05-27T17:20:14.000Z",
    "source": "ZDNet Security",
    "summary": "The Kingston IronKey Vault Privacy 80 features real-time AES-256 bit encryption, dual read-only modes, and password protection. The 2TB version is on sale right now at B&H Photo...."
  },
  {
    "title": "FBI: Silent Ransom Group Adopts Vishing Campaign Against Law Firms",
    "link": "https://www.darkreading.com/endpoint-security/fbi-silent-ransom-group-vishing-law-firms",
    "date": "2025-05-27T16:58:22.000Z",
    "source": "Dark Reading",
    "summary": "The non-ransomware extortion group has switched up tactics and victimology in a deliberate and focused campaign similar to those of other attackers focused on stealing sensitive data...."
  },
  {
    "title": "New Self-Spreading Malware Infects Docker Containers to Mine Dero Cryptocurrency",
    "link": "https://thehackernews.com/2025/05/new-self-spreading-malware-infects.html",
    "date": "2025-05-27T16:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Misconfigured Docker API instances have become the target of a new malware campaign that transforms them into a cryptocurrency mining botnet.\nThe attacks, designed to mine for Dero currency, is notabl..."
  },
  {
    "title": "How the New Hacker Millionaire Class Was Built",
    "link": "https://www.darkreading.com/remote-workforce/hacker-millionaire-class-built",
    "date": "2025-05-27T16:12:00.000Z",
    "source": "Dark Reading",
    "summary": "Once dismissed as Internet miscreants in hoodies, ethical hackers have hit the big time, earning millions from blue-chip firms. And they say it's their diverse backgrounds that make them top-tier bug ..."
  },
  {
    "title": "Danabot Takedown Deals Blow to Russian Cybercrime",
    "link": "https://www.darkreading.com/threat-intelligence/danabot-takedown-russian-cybercrime",
    "date": "2025-05-27T15:53:00.000Z",
    "source": "Dark Reading",
    "summary": "A multiyear investigation by a public-private partnership has resulted in the seizure of the botnet's US-based infrastructure and indictments for its key players, significantly disrupting a vast cyber..."
  },
  {
    "title": "Not Every CVE Deserves a Fire Drill: Focus on What’s Exploitable",
    "link": "https://www.bleepingcomputer.com/news/security/not-every-cve-deserves-a-fire-drill-focus-on-whats-exploitable/",
    "date": "2025-05-27T14:25:31.000Z",
    "source": "Bleeping Computer",
    "summary": "Not every \"critical\" vulnerability is a critical risk. Picus Exposure Validation cuts through the noise by testing what's actually exploitable in your environment — so you can patch what matters. [......"
  },
  {
    "title": "How to get 2FA codes on your desktop when your phone is MIA",
    "link": "https://www.zdnet.com/article/how-to-get-2fa-codes-on-your-desktop-when-your-phone-is-mia/",
    "date": "2025-05-27T14:21:13.000Z",
    "source": "ZDNet Security",
    "summary": "If you have two-factor authentication enabled but don't have your phone nearby, you can use one of these desktop apps to get your code...."
  }
]