[
  {
    "title": "[Webinar] Securing Agentic AI: From MCPs and Tool Access to Shadow API Key Sprawl",
    "link": "https://thehackernews.com/2026/01/webinar-t-from-mcps-and-tool-access-to.html",
    "date": "2026-01-13T13:44:00.000Z",
    "source": "The Hacker News",
    "summary": "AI agents are no longer just writing code. They are executing it.\nTools like Copilot, Claude Code, and Codex can now build, test, and deploy software end-to-end in minutes. That speed is reshaping eng..."
  },
  {
    "title": "Target employees confirm leaked code after 'accelerated' Git lockdown",
    "link": "https://www.bleepingcomputer.com/news/security/target-employees-confirm-leaked-code-after-accelerated-git-lockdown/",
    "date": "2026-01-13T13:08:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Multiple current and former Target employees confirmed that leaked source code samples posted by a threat actor match real internal systems. The company also rolled out an \"accelerated\" lockdown of it..."
  },
  {
    "title": "New Advanced Linux VoidLink Malware Targets Cloud and container Environments",
    "link": "https://thehackernews.com/2026/01/new-advanced-linux-voidlink-malware.html",
    "date": "2026-01-13T11:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a previously undocumented and feature-rich malware framework codenamed VoidLink that's specifically designed for long-term, stealthy access to Linux..."
  },
  {
    "title": "What Should We Learn From How Attackers Leveraged AI in 2025?",
    "link": "https://thehackernews.com/2026/01/what-should-we-learn-from-how-attackers.html",
    "date": "2026-01-13T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Old Playbook, New Scale: While defenders are chasing trends, attackers are optimizing the basics\nThe security industry loves talking about \"new\" threats. AI-powered attacks. Quantum-resistant encrypti..."
  },
  {
    "title": "ServiceNow Patches Critical AI Platform Flaw Allowing Unauthenticated User Impersonation",
    "link": "https://thehackernews.com/2026/01/servicenow-patches-critical-ai-platform.html",
    "date": "2026-01-13T11:47:00.000Z",
    "source": "The Hacker News",
    "summary": "ServiceNow has disclosed details of a now-patched critical security flaw impacting its ServiceNow AI Platform that could enable an unauthenticated user to impersonate another user and perform arbitrar..."
  },
  {
    "title": "New Malware Campaign Delivers Remcos RAT Through Multi-Stage Windows Attack",
    "link": "https://thehackernews.com/2026/01/new-malware-campaign-delivers-remcos.html",
    "date": "2026-01-13T09:08:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign dubbed SHADOW#REACTOR that employs an evasive multi-stage attack chain to deliver a commercially available remote administration tool..."
  },
  {
    "title": "CISA Warns of Active Exploitation of Gogs Vulnerability Enabling Code Execution",
    "link": "https://thehackernews.com/2026/01/cisa-warns-of-active-exploitation-of.html",
    "date": "2026-01-13T07:15:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has warned of active exploitation of a high-severity security flaw impacting Gogs by adding it to its Known Exploited Vulnerabilities (..."
  },
  {
    "title": "Hacker gets seven years for breaching Rotterdam and Antwerp ports",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-gets-seven-years-for-breaching-rotterdam-and-antwerp-ports/",
    "date": "2026-01-12T23:06:47.000Z",
    "source": "Bleeping Computer",
    "summary": "The Amsterdam Court of Appeal sentenced a 44-year-old Dutch national to seven years in prison for multiple crimes, including computer hacking and attempted extortion. [...]..."
  },
  {
    "title": "BreachForums Breached, Exposing 324K Cybercriminals",
    "link": "https://www.darkreading.com/threat-intelligence/breachforums-breached-exposing-324k-cybercriminals",
    "date": "2026-01-12T22:01:37.000Z",
    "source": "Dark Reading",
    "summary": "A massive data dump reveals real identities and details of administrators and members of the notorious hacker forum...."
  },
  {
    "title": "GoBruteforcer Botnet Targets 50K-plus Linux Servers",
    "link": "https://www.darkreading.com/threat-intelligence/gobruteforcer-botnet-targets-50k-plus-linux-servers",
    "date": "2026-01-12T21:19:49.000Z",
    "source": "Dark Reading",
    "summary": "Researchers detailed a souped-up version of the GoBruteforcer botnet that preys on servers with weak credentials and AI-generated configurations...."
  },
  {
    "title": "Facebook login thieves now using browser-in-browser trick",
    "link": "https://www.bleepingcomputer.com/news/security/facebook-login-thieves-now-using-browser-in-browser-trick/",
    "date": "2026-01-12T21:05:43.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers over the past six months have relied increasingly more on the browser-in-the-browser (BitB) method to trick users into providing Facebook account credentials. [...]..."
  },
  {
    "title": "Navigating Privacy and Cybersecurity Laws in 2026 Will Prove Difficult",
    "link": "https://www.darkreading.com/cyber-risk/navigating-privacy-and-cybersecurity-laws-in-2026-will-prove-difficult",
    "date": "2026-01-12T20:14:57.000Z",
    "source": "Dark Reading",
    "summary": "No matter what new laws or regulations make the cut for 2026, it's clear that compliance challenges will persist and federal legislation will be limited...."
  },
  {
    "title": "CISA orders feds to patch Gogs RCE flaw exploited in zero-day attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-feds-to-patch-gogs-rce-flaw-exploited-in-zero-day-attacks/",
    "date": "2026-01-12T20:09:16.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA has ordered government agencies to secure their systems against a high-severity Gogs vulnerability that was exploited in zero-day attacks. [...]..."
  },
  {
    "title": "'Bad actor' hijacks Apex Legends characters in live matches",
    "link": "https://www.bleepingcomputer.com/news/security/bad-actor-hijacks-apex-legends-characters-in-live-matches/",
    "date": "2026-01-12T19:51:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Apex Legends players over the weekend experienced disruptions during live matches as threat actors hijacked their characters, disconnected them, and changed their nicknames. [...]..."
  },
  {
    "title": "FBI Flags Quishing Attacks From North Korean APT",
    "link": "https://www.darkreading.com/mobile-security/fbi-quishing-attacks-north-korean-apt",
    "date": "2026-01-12T19:26:02.000Z",
    "source": "Dark Reading",
    "summary": "A state-sponsored threat group tracked as \"Kimsuky\" sent QR-code-filled phishing emails to US and foreign government agencies, NGOs, and academic institutions...."
  },
  {
    "title": "Hexnode Moves into Endpoint Security With Hexnode XDR",
    "link": "https://www.darkreading.com/endpoint-security/hexnode-marks-its-move-into-endpoint-security-with-hexnode-xdr",
    "date": "2026-01-12T19:20:16.000Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "University of Hawaii Cancer Center hit by ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-hawaii-cancer-center-hit-by-ransomware-attack/",
    "date": "2026-01-12T18:48:20.000Z",
    "source": "Bleeping Computer",
    "summary": "​University of Hawaii says a ransomware gang breached its Cancer Center in August 2025, stealing data of study participants, including documents from the 1990s containing Social Security numbers. [......"
  },
  {
    "title": "Target's dev server offline after hackers claim to steal source code",
    "link": "https://www.bleepingcomputer.com/news/security/targets-dev-server-offline-after-hackers-claim-to-steal-source-code/",
    "date": "2026-01-12T17:52:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are claiming to be selling internal source code belonging to Target Corporation, after publishing what appears to be a sample of stolen code repositories on a public software development platf..."
  },
  {
    "title": "Apple confirms Google Gemini will power Siri, says privacy remains a priority ",
    "link": "https://www.bleepingcomputer.com/news/apple/apple-confirms-google-gemini-will-power-siri-says-privacy-remains-a-priority/",
    "date": "2026-01-12T16:43:47.000Z",
    "source": "Bleeping Computer",
    "summary": "Apple and Google have confirmed that the next version of Siri will use Gemini and Google Cloud in a multi-year collaboration between the two tech giants. [...]..."
  },
  {
    "title": "n8n Supply Chain Attack Abuses Community Nodes to Steal OAuth Tokens",
    "link": "https://thehackernews.com/2026/01/n8n-supply-chain-attack-abuses.html",
    "date": "2026-01-12T16:39:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed uploading a set of eight packages on the npm registry that masqueraded as integrations targeting the n8n workflow automation platform to steal developers' OAuth creden..."
  },
  {
    "title": "Hidden Telegram proxy links can reveal your IP address in one click",
    "link": "https://www.bleepingcomputer.com/news/security/hidden-telegram-proxy-links-can-reveal-your-ip-address-in-one-click/",
    "date": "2026-01-12T16:20:47.000Z",
    "source": "Bleeping Computer",
    "summary": "A single click on what may appear to be a Telegram username or harmless link is all it takes to expose your real IP address to attackers due to how proxy links are handled. Telegram says it will add w..."
  },
  {
    "title": "Spanish energy giant Endesa discloses data breach affecting customers",
    "link": "https://www.bleepingcomputer.com/news/security/spanish-energy-giant-endesa-discloses-data-breach-affecting-customers/",
    "date": "2026-01-12T15:57:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Spanish energy provider Endesa and its Energía XXI operator are notifying customers that hackers accessed the company's systems and accessed contract-related information, which includes personal detai..."
  },
  {
    "title": "Microsoft is retiring the Lens scanner app for iOS, Android",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-retiring-the-lens-scanner-app-for-ios-android/",
    "date": "2026-01-12T15:48:37.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has started retiring the Microsoft Lens PDF scanner app for Android and iOS devices on Friday, January 9th, with plans to remove it from app stores next month. [...]..."
  },
  {
    "title": "Two Separate Campaigns Target Exposed LLM Services",
    "link": "https://www.darkreading.com/endpoint-security/separate-campaigns-target-exposed-llm-services",
    "date": "2026-01-12T15:37:14.000Z",
    "source": "Dark Reading",
    "summary": "A total of 91,403 sessions targeted public LLM endpoints to find leaks in organizations' use of AI and map an expanding attack surface...."
  },
  {
    "title": "Prevent cloud data leaks with Microsoft 365 access reviews",
    "link": "https://www.bleepingcomputer.com/news/security/prevent-cloud-data-leaks-with-microsoft-365-access-reviews/",
    "date": "2026-01-12T14:45:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft 365 has made file sharing effortless, but that convenience often leaves organizations with little visibility into who can access sensitive data. Tenfold explains  how access reviews for shar..."
  },
  {
    "title": "Max severity Ni8mare flaw impacts nearly 60,000 n8n instances",
    "link": "https://www.bleepingcomputer.com/news/security/max-severity-ni8mare-flaw-impacts-nearly-60-000-n8n-instances/",
    "date": "2026-01-12T14:05:54.000Z",
    "source": "Bleeping Computer",
    "summary": "Nearly 60,000 n8n instances exposed online remain unpatched against a maximum-severity vulnerability dubbed \"Ni8mare.\" [...]..."
  },
  {
    "title": "⚡ Weekly Recap: AI Automation Exploits, Telecom Espionage, Prompt Poaching & More",
    "link": "https://thehackernews.com/2026/01/weekly-recap-ai-automation-exploits.html",
    "date": "2026-01-12T13:41:00.000Z",
    "source": "The Hacker News",
    "summary": "This week made one thing clear: small oversights can spiral fast. Tools meant to save time and reduce friction turned into easy entry points once basic safeguards were ignored. Attackers didn’t need n..."
  },
  {
    "title": "GoBruteforcer Botnet Targets Crypto Project Databases by Exploiting Weak Credentials",
    "link": "https://thehackernews.com/2026/01/gobruteforcer-botnet-targets-crypto.html",
    "date": "2026-01-12T10:48:00.000Z",
    "source": "The Hacker News",
    "summary": "A new wave of GoBruteforcer attacks has targeted databases of cryptocurrency and blockchain projects to co-opt them into a botnet that's capable of brute-forcing user passwords for services such as FT..."
  },
  {
    "title": "Anthropic Launches Claude AI for Healthcare with Secure Health Record Access",
    "link": "https://thehackernews.com/2026/01/anthropic-launches-claude-ai-for.html",
    "date": "2026-01-12T08:37:00.000Z",
    "source": "The Hacker News",
    "summary": "Anthropic has become the latest Artificial intelligence (AI) company to announce a new suite of features that allows users of its Claude platform to better understand their health information.\nUnder a..."
  },
  {
    "title": "Researchers Uncover Service Providers Fueling Industrial-Scale Pig Butchering Fraud",
    "link": "https://thehackernews.com/2026/01/researchers-uncover-service-providers.html",
    "date": "2026-01-12T07:34:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have shed light on two service providers that supply online criminal networks with the necessary tools and infrastructure to fuel the pig butchering-as-a-service (PBaaS) econ..."
  }
]