[
  {
    "title": "'Richter Scale' Model Measures Magnitude of OT Cyber Incidents",
    "link": "https://www.darkreading.com/ics-ot-security/richter-scale-model-measures-cyber-incidents",
    "date": "2026-02-25T12:00:00.000Z",
    "source": "Dark Reading",
    "summary": "ICS/OT experts have devised a scoring system for rating the severity and effects of cybersecurity events in operational technology environments...."
  },
  {
    "title": "Manual Processes Are Putting National Security at Risk",
    "link": "https://thehackernews.com/2026/02/manual-processes-are-putting-national.html",
    "date": "2026-02-25T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Why automating sensitive data transfers is now a mission-critical priority\nMore than half of national security organizations still rely on manual processes to transfer sensitive data, according to The..."
  },
  {
    "title": "US sanctions Russian broker for buying stolen zero-day exploits",
    "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-russian-exploit-broker-for-buying-stolen-zero-days/",
    "date": "2026-02-25T10:31:13.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Treasury Department has sanctioned a Russian exploit broker who bought stolen hacking tools from a former executive of a U.S. defense contractor. [...]..."
  },
  {
    "title": "Defense Contractor Employee Jailed for Selling 8 Zero-Days to Russian Broker",
    "link": "https://thehackernews.com/2026/02/defense-contractor-employee-jailed-for.html",
    "date": "2026-02-25T08:49:00.000Z",
    "source": "The Hacker News",
    "summary": "A 39-year-old Australian national who was previously employed at U.S. defense contractor L3Harris has been sentenced to a little over seven years in prison for selling eight zero-day exploits to Russi..."
  },
  {
    "title": "Ex-L3Harris exec jailed for selling zero-days to Russian exploit broker",
    "link": "https://www.bleepingcomputer.com/news/security/ex-l3harris-exec-jailed-for-selling-zero-days-to-russian-exploit-broker/",
    "date": "2026-02-25T08:21:40.000Z",
    "source": "Bleeping Computer",
    "summary": "The former head of Trenchant, a specialized U.S. defense contractor unit, was sentenced Tuesday to more than seven years in federal prison for stealing and selling zero-day exploits to a Russian broke..."
  },
  {
    "title": "Operation Red Card 2.0 Leads to 651 Arrests in Africa",
    "link": "https://www.darkreading.com/cybersecurity-operations/operation-red-card-2-0-leads-to-651-arrests-in-africa",
    "date": "2026-02-25T08:00:00.000Z",
    "source": "Dark Reading",
    "summary": "In the latest operation targeting cybercrime groups, African law enforcement agencies cooperated with Interpol and cybersecurity firms to recover more than USD 4.3 million...."
  },
  {
    "title": "Windows 11 KB5077241 update improves BitLocker, adds Sysmon tool",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5077241-update-improves-bitlocker-adds-sysmon-tool/",
    "date": "2026-02-25T07:51:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released the KB5077241 optional cumulative update for Windows 11, which comes with 29 changes, including improvements to BitLocker, a new network speed test tool, and native System Monit..."
  },
  {
    "title": "SolarWinds Patches 4 Critical Serv-U 15.5 Flaws Allowing Root Code Execution",
    "link": "https://thehackernews.com/2026/02/solarwinds-patches-4-critical-serv-u.html",
    "date": "2026-02-25T07:04:00.000Z",
    "source": "The Hacker News",
    "summary": "SolarWinds has released updates to address four critical security flaws in its Serv-U file transfer software that, if successfully exploited, could result in remote code execution.\nThe vulnerabilities..."
  },
  {
    "title": "CISA Confirms Active Exploitation of FileZen CVE-2026-25108 Vulnerability",
    "link": "https://thehackernews.com/2026/02/cisa-confirms-active-exploitation-of.html",
    "date": "2026-02-25T05:23:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added a recently disclosed vulnerability in FileZen to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of..."
  },
  {
    "title": "Phishing campaign targets freight and logistics orgs in the US, Europe",
    "link": "https://www.bleepingcomputer.com/news/security/phishing-campaign-targets-freight-and-logistics-orgs-in-the-us-europe/",
    "date": "2026-02-24T23:57:58.000Z",
    "source": "Bleeping Computer",
    "summary": "A financially motivated threat group dubbed \"Diesel Vortex\" is stealing credentials from freight and logistics operators in the U.S. and Europe in phishing attacks using 52 domains. [...]..."
  },
  {
    "title": "Wynn Resorts confirms employee data breach after extortion threat",
    "link": "https://www.bleepingcomputer.com/news/security/wynn-resorts-confirms-employee-data-breach-after-extortion-threat/",
    "date": "2026-02-24T21:51:20.000Z",
    "source": "Bleeping Computer",
    "summary": "Wynn Resorts has confirmed that a hacker stole employee data from its systems after the company was listed on the ShinyHunters extortion gang's data leak site. [...]..."
  },
  {
    "title": "1Campaign platform helps malicious Google ads evade detection",
    "link": "https://www.bleepingcomputer.com/news/security/1campaign-platform-helps-malicious-google-ads-evade-detection/",
    "date": "2026-02-24T21:45:05.000Z",
    "source": "Bleeping Computer",
    "summary": "A newly identified cybercrime service known as 1Campaign is enabling threat actors to run malicious Google Ads that remain online for extended periods while evading scrutiny from security researchers...."
  },
  {
    "title": "Attackers Now Need Just 29 Minutes to Own a Network",
    "link": "https://www.darkreading.com/cyber-risk/attackers-now-need-just-29-minutes-to-own-a-network",
    "date": "2026-02-24T21:38:15.000Z",
    "source": "Dark Reading",
    "summary": "Credential misuse, AI tools, and security blind spots help attackers move through breached networks faster than ever, CrowdStrike finds...."
  },
  {
    "title": "Lazarus Group Picks a New Poison: Medusa Ransomware",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/lazarus-group-new-position-medusa-ransomware",
    "date": "2026-02-24T21:18:04.000Z",
    "source": "Dark Reading",
    "summary": "The North Korean threat group also leveraged Comebacker backdoor, Blindingcan RAT, and info stealer Infohook in its recent attacks...."
  },
  {
    "title": "RoguePilot Flaw in GitHub Codespaces Enabled Copilot to Leak GITHUB_TOKEN",
    "link": "https://thehackernews.com/2026/02/roguepilot-flaw-in-github-codespaces.html",
    "date": "2026-02-24T18:52:00.000Z",
    "source": "The Hacker News",
    "summary": "A vulnerability in GitHub Codespaces could have been exploited by bad actors to seize control of repositories by injecting malicious Copilot instructions in a GitHub issue.\nThe artificial intelligence..."
  },
  {
    "title": "CarGurus data breach exposes information of 12.4 million accounts",
    "link": "https://www.bleepingcomputer.com/news/security/cargurus-data-breach-exposes-information-of-124-million-accounts/",
    "date": "2026-02-24T18:08:20.000Z",
    "source": "Bleeping Computer",
    "summary": "The ShinyHunters extortion group has published personal information in more than 12 million records allegedly stolen from CarGurus, a U.S.-based digital auto platform. [...]..."
  },
  {
    "title": "Microsoft adds Copilot data controls to all storage locations",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-adds-copilot-data-controls-to-all-storage-locations/",
    "date": "2026-02-24T17:30:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is expanding data loss prevention (DLP) controls to block the Microsoft 365 Copilot AI assistant from processing confidential Word, Excel, and PowerPoint documents, regardless of their locat..."
  },
  {
    "title": "Identity-First AI Security: Why CISOs Must Add Intent to the Equation",
    "link": "https://www.bleepingcomputer.com/news/security/identity-first-ai-security-why-cisos-must-add-intent-to-the-equation/",
    "date": "2026-02-24T15:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "AI agents now provision infrastructure and approve actions, but many inherit over-scoped privileges without proper governance. Token Security explains why CISOs must treat agents as identities and add..."
  },
  {
    "title": "UK fines Reddit $19 million for using children’s data unlawfully",
    "link": "https://www.bleepingcomputer.com/news/security/uk-fines-reddit-19-million-for-using-childrens-data-unlawfully/",
    "date": "2026-02-24T14:54:24.000Z",
    "source": "Bleeping Computer",
    "summary": "The UK Information Commissioner's Office (ICO) has fined Reddit £14.47 million (over $19.5 million) for collecting and using the personal information of children under 13 without adequate safeguards. ..."
  },
  {
    "title": "UAC-0050 Targets European Financial Institution With Spoofed Domain and RMS Malware",
    "link": "https://thehackernews.com/2026/02/uac-0050-targets-european-financial.html",
    "date": "2026-02-24T14:21:00.000Z",
    "source": "The Hacker News",
    "summary": "A Russia-aligned threat actor has been observed targeting a European financial institution as part of a social engineering attack to likely facilitate intelligence gathering or financial theft, signal..."
  },
  {
    "title": "As Cybersecurity Firms Chase AI, VC Market Skyrockets",
    "link": "https://www.darkreading.com/cybersecurity-analytics/cybersecurity-firms-chase-ai-vc-market-skyrockets",
    "date": "2026-02-24T13:04:04.000Z",
    "source": "Dark Reading",
    "summary": "Investments in cybersecurity startups took off in 2025 as venture capital firms focused not just on AI-native tech but on talent as well...."
  },
  {
    "title": "Critical SolarWinds Serv-U flaws offer root access to servers",
    "link": "https://www.bleepingcomputer.com/news/security/critical-solarwinds-serv-u-flaws-offer-root-access-to-servers/",
    "date": "2026-02-24T13:00:45.000Z",
    "source": "Bleeping Computer",
    "summary": "SolarWinds has patched four critical Serv-U remote code execution vulnerabilities that could grant attackers root access to unpatched servers. [...]..."
  },
  {
    "title": "Identity Prioritization isn't a Backlog Problem - It's a Risk Math Problem",
    "link": "https://thehackernews.com/2026/02/identity-prioritization-isnt-backlog.html",
    "date": "2026-02-24T11:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Most identity programs still prioritize work the way they prioritize IT tickets: by volume, loudness, or “what failed a control check.” That approach breaks the moment your environment stops being mos..."
  },
  {
    "title": "Lazarus Group Uses Medusa Ransomware in Middle East and U.S. Healthcare Attacks",
    "link": "https://thehackernews.com/2026/02/lazarus-group-uses-medusa-ransomware-in.html",
    "date": "2026-02-24T11:52:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korea-linked Lazarus Group (aka Diamond Sleet and Pompilus) has been observed using Medusa ransomware in an attack targeting an unnamed entity in the Middle East, according to a new report b..."
  },
  {
    "title": "ShinyHunters extortion gang claims Odido breach affecting millions",
    "link": "https://www.bleepingcomputer.com/news/security/shinyhunters-extortion-gang-claims-odido-breach-affecting-millions/",
    "date": "2026-02-24T11:40:20.000Z",
    "source": "Bleeping Computer",
    "summary": "The ShinyHunters extortion gang has claimed responsibility for breaching Dutch telecommunications provider Odido and stealing millions of user records from its compromised systems. [...]..."
  },
  {
    "title": "North Korean Lazarus group linked to Medusa ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/north-korean-lazarus-group-linked-to-medusa-ransomware-attacks/",
    "date": "2026-02-24T11:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "North Korean state-backed hackers associated with the Lazarus threat group are targeting U.S. healthcare organizations in extortion attacks using the Medusa ransomware. [...]..."
  },
  {
    "title": "UnsolicitedBooker Targets Central Asian Telecoms With LuciDoor and MarsSnake Backdoors",
    "link": "https://thehackernews.com/2026/02/unsolicitedbooker-targets-central-asian.html",
    "date": "2026-02-24T09:54:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat activity cluster known as UnsolicitedBooker has been observed targeting telecommunications companies in Kyrgyzstan and Tajikistan, marking a shift from prior attacks aimed at Saudi Arabian ..."
  },
  {
    "title": "Anthropic Says Chinese AI Firms Used 16 Million Claude Queries to Copy Model",
    "link": "https://thehackernews.com/2026/02/anthropic-says-chinese-ai-firms-used-16.html",
    "date": "2026-02-24T06:04:00.000Z",
    "source": "The Hacker News",
    "summary": "Anthropic on Monday said it identified \"industrial-scale campaigns\" mounted by three artificial intelligence (AI) companies, DeepSeek, Moonshot AI, and MiniMax, to illegally extract Claude's capabilit..."
  },
  {
    "title": "Android mental health apps with 14.7M installs filled with security flaws",
    "link": "https://www.bleepingcomputer.com/news/security/android-mental-health-apps-with-147m-installs-filled-with-security-flaws/",
    "date": "2026-02-23T22:59:04.000Z",
    "source": "Bleeping Computer",
    "summary": "Several mental health mobile apps with millions of downloads on Google Play contain security vulnerabilities that could expose users' sensitive medical information. [...]..."
  },
  {
    "title": "Spitting Cash: ATM Jackpotting Attacks Surged in 2025",
    "link": "https://www.darkreading.com/cyber-risk/atm-jackpotting-attacks-surged-2025",
    "date": "2026-02-23T22:20:08.000Z",
    "source": "Dark Reading",
    "summary": "The attacks cost banks more than $20 million in losses last year, as criminals used many of the same tools and tactics they have wielded for more than a decade...."
  }
]