[
  {
    "title": "[Virtual Event] Shields Up: Key Technologies Reshaping Cybersecurity Defenses",
    "link": "https://www.darkreading.com/events/shields-up-key-technologies-reshaping-cybersecurity-defenses",
    "date": "2026-02-23T21:21:15.250Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Iran's MuddyWater Targets Orgs With Fresh Malware as Tensions Mount",
    "link": "https://www.darkreading.com/threat-intelligence/iran-muddywater-new-malware-tensions-mount",
    "date": "2026-02-23T20:35:12.000Z",
    "source": "Dark Reading",
    "summary": "The long-active Iranian threat group debuted various attack strains and payloads in attacks against organizations in the Middle East and Africa...."
  },
  {
    "title": "Enigma Cipher Device Still Holds Secrets for Cyber Pros",
    "link": "https://www.darkreading.com/threat-intelligence/enigma-cipher-device-secrets-cyber-pros",
    "date": "2026-02-23T20:11:27.000Z",
    "source": "Dark Reading",
    "summary": "The Nazi relic's history is riddled with resilience errors, and those lessons still apply to defending against modern cyber threats...."
  },
  {
    "title": "Microsoft says bug in classic Outlook hides the mouse pointer",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-bug-in-classic-outlook-hides-the-mouse-pointer/",
    "date": "2026-02-23T19:40:42.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating a known issue that causes the mouse pointer to disappear in the classic Outlook desktop email client for some users. [...]..."
  },
  {
    "title": "Ad tech firm Optimizely confirms data breach after vishing attack",
    "link": "https://www.bleepingcomputer.com/news/security/ad-tech-firm-optimizely-confirms-data-breach-after-vishing-attack/",
    "date": "2026-02-23T18:04:01.000Z",
    "source": "Bleeping Computer",
    "summary": "New York-based ad tech company Optimizely has notified an undisclosed number of customers of a data breach after threat actors compromised some of its systems in a voice phishing attack. [...]..."
  },
  {
    "title": "Wormable XMRig Campaign Uses BYOVD Exploit and Time-Based Logic Bomb",
    "link": "https://thehackernews.com/2026/02/wormable-xmrig-campaign-uses-byovd.html",
    "date": "2026-02-23T17:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new cryptojacking campaign that uses pirated software bundles as lures to deploy a bespoke XMRig miner program on compromised hosts.\n\"Analysis of ..."
  },
  {
    "title": "When identity isn’t the weak link, access still is",
    "link": "https://www.bleepingcomputer.com/news/security/when-identity-isnt-the-weak-link-access-still-is/",
    "date": "2026-02-23T15:00:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Stolen tokens and compromised devices let attackers reuse trust without breaking authentication. Specops Software explains why identity alone isn't enough and how continuous device verification streng..."
  },
  {
    "title": "⚡ Weekly Recap: Double-Tap Skimmers, PromptSpy AI, 30Tbps DDoS, Docker Malware & More",
    "link": "https://thehackernews.com/2026/02/weekly-recap-double-tap-skimmers.html",
    "date": "2026-02-23T13:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Security news rarely moves in a straight line. This week, it feels more like a series of sharp turns, some happening quietly in the background, others playing out in public view. The details are diffe..."
  },
  {
    "title": "How Exposed Endpoints Increase Risk Across LLM Infrastructure",
    "link": "https://thehackernews.com/2026/02/how-exposed-endpoints-increase-risk.html",
    "date": "2026-02-23T11:58:00.000Z",
    "source": "The Hacker News",
    "summary": "As more organizations run their own Large Language Models (LLMs), they are also deploying more internal services and Application Programming Interfaces (APIs) to support those models. Modern security ..."
  },
  {
    "title": "CISA: Recently patched RoundCube flaws now exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-recently-patched-roundcube-flaws-now-exploited-in-attacks/",
    "date": "2026-02-23T11:44:21.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA flagged two Roundcube Webmail vulnerabilities as actively exploited in attacks and ordered U.S. federal agencies to patch them within three weeks. [...]..."
  },
  {
    "title": "Malicious npm Packages Harvest Crypto Keys, CI Secrets, and API Tokens",
    "link": "https://thehackernews.com/2026/02/malicious-npm-packages-harvest-crypto.html",
    "date": "2026-02-23T10:20:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed what they say is an active \"Shai-Hulud-like\" supply chain worm campaign that has leveraged a cluster of at least 19 malicious npm packages to enable credential..."
  },
  {
    "title": "MuddyWater Targets MENA Organizations with GhostFetch, CHAR, and HTTP_VIP",
    "link": "https://thehackernews.com/2026/02/muddywater-targets-mena-organizations.html",
    "date": "2026-02-23T07:25:00.000Z",
    "source": "The Hacker News",
    "summary": "The Iranian hacking group known as MuddyWater (aka Earth Vetala, Mango Sandstorm, and MUDDYCOAST) has targeted several organizations and individuals mainly located across the Middle East and North Afr..."
  },
  {
    "title": "Arkanix Stealer pops up as short-lived AI info-stealer experiment",
    "link": "https://www.bleepingcomputer.com/news/security/arkanix-stealer-pops-up-as-short-lived-ai-info-stealer-experiment/",
    "date": "2026-02-22T15:33:26.000Z",
    "source": "Bleeping Computer",
    "summary": "An information-stealing malware operation named Arkanix Stealer, promoted on multiple dark web forums towards the end of 2025, was likely developed as an AI-assisted experiment. [...]..."
  },
  {
    "title": "Predator spyware hooks iOS SpringBoard to hide mic, camera activity",
    "link": "https://www.bleepingcomputer.com/news/security/predator-spyware-hooks-ios-springboard-to-hide-mic-camera-activity/",
    "date": "2026-02-21T16:13:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Intellexa's Predator spyware can hide iOS recording indicators while secretly streaming camera and microphone feeds to its operators. [...]..."
  },
  {
    "title": "AI-Assisted Threat Actor Compromises 600+ FortiGate Devices in 55 Countries",
    "link": "https://thehackernews.com/2026/02/ai-assisted-threat-actor-compromises.html",
    "date": "2026-02-21T14:49:00.000Z",
    "source": "The Hacker News",
    "summary": "A Russian-speaking, financially motivated threat actor has been observed taking advantage of commercial generative artificial intelligence (AI) services to compromise over 600 FortiGate devices locate..."
  },
  {
    "title": "Amazon: AI-assisted hacker breached 600 Fortinet firewalls in 5 weeks",
    "link": "https://www.bleepingcomputer.com/news/security/amazon-ai-assisted-hacker-breached-600-fortigate-firewalls-in-5-weeks/",
    "date": "2026-02-21T13:50:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Amazon is warning that a Russian-speaking hacker used multiple generative AI services as part of a campaign that breached more than 600 FortiGate firewalls across 55 countries in five weeks. [...]..."
  },
  {
    "title": "Anthropic Launches Claude Code Security for AI-Powered Vulnerability Scanning",
    "link": "https://thehackernews.com/2026/02/anthropic-launches-claude-code-security.html",
    "date": "2026-02-21T07:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence (AI) company Anthropic has begun to roll out a new security feature for Claude Code that can scan a user's software codebase for vulnerabilities and suggest patches.\nThe capabi..."
  },
  {
    "title": "CISA Adds Two Actively Exploited Roundcube Flaws to KEV Catalog",
    "link": "https://thehackernews.com/2026/02/cisa-adds-two-actively-exploited.html",
    "date": "2026-02-21T07:21:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added two security flaws impacting Roundcube webmail software to its Known Exploited Vulnerabilities (KEV) catalog, citing ev..."
  },
  {
    "title": "EC-Council Expands AI Certification Portfolio to Strengthen U.S. AI Workforce Readiness and Security",
    "link": "https://thehackernews.com/2026/02/ec-council-expands-ai-certification.html",
    "date": "2026-02-21T04:30:00.000Z",
    "source": "The Hacker News",
    "summary": "With $5.5 trillion in global AI risk exposure and 700,000 U.S. workers needing reskilling, four new AI certifications and Certified CISO v4 help close the gap between AI adoption and workforce readine..."
  },
  {
    "title": "Attackers Use New Tool to Scan for React2Shell Exposure",
    "link": "https://www.darkreading.com/application-security/attackers-new-tool-scan-react2shell-exposure",
    "date": "2026-02-20T21:07:07.000Z",
    "source": "Dark Reading",
    "summary": "Researchers say threat actors wielded the sophisticated — and unfortunately named — toolkit to target high-value networks for React2Shell exploitation...."
  },
  {
    "title": "‘Starkiller’ Phishing Service Proxies Real Login Pages, MFA",
    "link": "https://krebsonsecurity.com/2026/02/starkiller-phishing-service-proxies-real-login-pages-mfa/",
    "date": "2026-02-20T20:00:30.000Z",
    "source": "Krebs on Security",
    "summary": "Most phishing websites are little more than static copies of login pages for popular online destinations, and they are often quickly taken down by anti-abuse activists and security firms. But a stealt..."
  },
  {
    "title": "'God-Like' Attack Machines: AI Agents Ignore Security Policies",
    "link": "https://www.darkreading.com/application-security/ai-agents-ignore-security-policies",
    "date": "2026-02-20T18:31:58.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft Copilot recently summarized and leaked user emails; but any AI agent will go above and beyond to complete assigned tasks, even breaking through their carefully designed guardrails...."
  },
  {
    "title": "Japanese tech giant Advantest hit by ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/japanese-tech-giant-advantest-hit-by-ransomware-attack/",
    "date": "2026-02-20T18:30:44.000Z",
    "source": "Bleeping Computer",
    "summary": "Advantest Corporation disclosed that its corporate network has been targeted in a ransomware attack that may have affected customer or employee data. [...]..."
  },
  {
    "title": "Lessons From AI Hacking: Every Model, Every Layer Is Risky",
    "link": "https://www.darkreading.com/application-security/lessons-ai-hacking-model-every-layer-risky",
    "date": "2026-02-20T18:02:02.000Z",
    "source": "Dark Reading",
    "summary": "After two years of finding flaws in AI infrastructure, two Wiz researchers advise security pros to worry less about prompt injection and more about vulnerabilities...."
  },
  {
    "title": "CISA: BeyondTrust RCE flaw now exploited in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-beyondtrust-rce-flaw-now-exploited-in-ransomware-attacks/",
    "date": "2026-02-20T17:02:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are actively exploiting the CVE-2026-1731 vulnerability in the BeyondTrust Remote Support product, the U.S. Cybersecurity and Infrastructure Security Agency (CISA) warns. [...]..."
  },
  {
    "title": "Data breach at French bank registry impacts 1.2 million accounts",
    "link": "https://www.bleepingcomputer.com/news/security/data-breach-at-french-bank-registry-impacts-12-million-accounts/",
    "date": "2026-02-20T16:20:40.000Z",
    "source": "Bleeping Computer",
    "summary": "The French Ministry of Finance has published an announcement informing of a cybersecurity incident that has impacted 1.2 million accounts. [...]..."
  },
  {
    "title": "BeyondTrust Flaw Used for Web Shells, Backdoors, and Data Exfiltration",
    "link": "https://thehackernews.com/2026/02/beyondtrust-flaw-used-for-web-shells.html",
    "date": "2026-02-20T15:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed exploiting a recently disclosed critical security flaw impacting BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) products to conduct a wide range of..."
  },
  {
    "title": "Why the shift left dream has become a nightmare for security and developers",
    "link": "https://www.bleepingcomputer.com/news/security/why-the-shift-left-dream-has-become-a-nightmare-for-security-and-developers/",
    "date": "2026-02-20T14:45:54.000Z",
    "source": "Bleeping Computer",
    "summary": "The \"shift left\" approach has increased pressure on developers, as speed demands override security checks in modern CI pipelines. Qualys explains how analyzing 34,000 public container images revealed ..."
  },
  {
    "title": "Cline CLI 2.3.0 Supply Chain Attack Installed OpenClaw on Developer Systems",
    "link": "https://thehackernews.com/2026/02/cline-cli-230-supply-chain-attack.html",
    "date": "2026-02-20T14:20:00.000Z",
    "source": "The Hacker News",
    "summary": "In yet another software supply chain attack, the open-source, artificial intelligence (AI)-powered coding assistant Cline CLI was updated to stealthily install OpenClaw, a self-hosted autonomous AI ag..."
  },
  {
    "title": "Latin America's Cyber Maturity Lags Threat Landscape",
    "link": "https://www.darkreading.com/threat-intelligence/latin-americas-cyber-maturity-lags-threat-landscape",
    "date": "2026-02-20T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The slower pace of upgrades has the unintended impact of creating a haven for attackers, especially for initial access brokers and ransomware gangs...."
  }
]