[
  {
    "title": "[Dark Reading Virtual Event] Cybersecurity Outlook 2026",
    "link": "https://www.darkreading.com/events/dark-reading-virtual-event-cybersecurity-outlook-2026",
    "date": "2025-11-24T12:12:50.348Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Explore Our Online Events",
    "link": "https://www.darkreading.com/events/dark-reading-online-events",
    "date": "2025-11-24T12:12:50.348Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Microsoft to remove WINS support after Windows Server 2025",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-remove-wins-support-after-windows-server-2025/",
    "date": "2025-11-24T11:47:01.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has warned IT administrators to prepare for the removal of Windows Internet Name Service (WINS) from Windows Server releases starting in November 2034. [...]..."
  },
  {
    "title": "Chinese DeepSeek-R1 AI Generates Insecure Code When Prompts Mention Tibet or Uyghurs",
    "link": "https://thehackernews.com/2025/11/chinese-ai-model-deepseek-r1-generates.html",
    "date": "2025-11-24T11:07:00.000Z",
    "source": "The Hacker News",
    "summary": "New research from CrowdStrike has revealed that DeepSeek's artificial intelligence (AI) reasoning model DeepSeek-R1 produces more security vulnerabilities in response to prompts that contain topics de..."
  },
  {
    "title": "Microsoft: Windows 11 24H2 bug crashes Explorer and Start Menu",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-24h2-bug-crashes-key-system-components/",
    "date": "2025-11-24T10:41:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed a critical Windows 11 24H2 bug that causes the File Explorer, the Start Menu, and other key system components to crash after installing cumulative updates released since July 2..."
  },
  {
    "title": "ShadowPad Malware Actively Exploits WSUS Vulnerability for Full System Access",
    "link": "https://thehackernews.com/2025/11/shadowpad-malware-actively-exploits.html",
    "date": "2025-11-24T07:18:00.000Z",
    "source": "The Hacker News",
    "summary": "A recently patched security flaw in Microsoft Windows Server Update Services (WSUS) has been exploited by threat actors to distribute malware known as ShadowPad.\n\"The attacker targeted Windows Servers..."
  },
  {
    "title": "Google enables Pixel-to-iPhone file sharing via Quick Share, AirDrop",
    "link": "https://www.bleepingcomputer.com/news/mobile/google-enables-pixel-to-iphone-file-sharing-via-quick-share-airdrop/",
    "date": "2025-11-23T15:32:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has added interoperability support between Android Quick Share and Apple AirDrop, to let users share files between Pixel devices and iPhones. [...]..."
  },
  {
    "title": "Enterprise password security and secrets management with Passwork 7",
    "link": "https://www.bleepingcomputer.com/news/security/enterprise-password-security-and-secrets-management-with-passwork-7/",
    "date": "2025-11-23T14:45:54.000Z",
    "source": "Bleeping Computer",
    "summary": "Passwork 7 unifies enterprise password and secrets management in a self-hosted platform. Organizations can automate credential workflows and test the full system with a free trial and up to 50% Black ..."
  },
  {
    "title": "Iberia discloses customer data leak after vendor security breach",
    "link": "https://www.bleepingcomputer.com/news/security/iberia-discloses-customer-data-leak-after-vendor-security-breach/",
    "date": "2025-11-23T13:46:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Spanish flag carrier Iberia has begun notifying customers of a data security incident stemming from a compromise at one of its suppliers. The disclosure comes days after a threat actor claimed on hack..."
  },
  {
    "title": "New Costco Gold Star Members also get a $40 Digital Costco Shop Card",
    "link": "https://www.bleepingcomputer.com/news/security/new-costco-gold-star-members-also-get-a-40-digital-costco-shop-card/",
    "date": "2025-11-23T13:09:17.000Z",
    "source": "Bleeping Computer",
    "summary": "The holidays can be hard on any budget, but there may be a way to make it a little easier. Instead of dashing through the snow all around town, get all your shopping done under one roof at Costco. Rig..."
  },
  {
    "title": "WhatsApp API flaw let researchers scrape 3.5 billion accounts",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-api-flaw-let-researchers-scrape-35-billion-accounts/",
    "date": "2025-11-22T18:53:21.000Z",
    "source": "Bleeping Computer",
    "summary": "Researchers compiled a list of 3.5 billion WhatsApp mobile phone numbers and associated personal information by abusing a contact-discovery API that lacked rate limiting. [...]..."
  },
  {
    "title": "China-Linked APT31 Launches Stealthy Cyberattacks on Russian IT Using Cloud Services",
    "link": "https://thehackernews.com/2025/11/china-linked-apt31-launches-stealthy.html",
    "date": "2025-11-22T15:19:00.000Z",
    "source": "The Hacker News",
    "summary": "The China-linked advanced persistent threat (APT) group known as APT31 has been attributed to cyber attacks targeting the Russian information technology (IT) sector between 2024 and 2025 while staying..."
  },
  {
    "title": "Cox Enterprises discloses Oracle E-Business Suite data breach",
    "link": "https://www.bleepingcomputer.com/news/security/cox-enterprises-discloses-oracle-e-business-suite-data-breach/",
    "date": "2025-11-22T15:16:23.000Z",
    "source": "Bleeping Computer",
    "summary": "Cox Enterprises is notifying impacted individuals of a data breach that exposed their personal data to hackers who breached the company network after exploiting a zero-day flaw in Oracle E-Business Su..."
  },
  {
    "title": "Piecing Together the Puzzle: A Qilin Ransomware Investigation",
    "link": "https://www.bleepingcomputer.com/news/security/piecing-together-the-puzzle-a-qilin-ransomware-investigation/",
    "date": "2025-11-22T13:45:53.000Z",
    "source": "Bleeping Computer",
    "summary": "Huntress analysts reconstructed a Qilin ransomware attack from a single endpoint, using limited logs to reveal rogue ScreenConnect access, failed infostealer attempts, and the ransomware execution pat..."
  },
  {
    "title": "Matrix Push C2 Uses Browser Notifications for Fileless, Cross-Platform Phishing Attacks",
    "link": "https://thehackernews.com/2025/11/matrix-push-c2-uses-browser.html",
    "date": "2025-11-22T06:47:00.000Z",
    "source": "The Hacker News",
    "summary": "Bad actors are leveraging browser notifications as a vector for phishing attacks to distribute malicious links by means of a new command-and-control (C2) platform called Matrix Push C2.\n\"This browser-..."
  },
  {
    "title": "CISA Warns of Actively Exploited Critical Oracle Identity Manager Zero-Day Vulnerability",
    "link": "https://thehackernews.com/2025/11/cisa-warns-of-actively-exploited.html",
    "date": "2025-11-22T06:45:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added a critical security flaw impacting Oracle Identity Manager to its Known Exploited Vulnerabilities (KEV) catalog, citing..."
  },
  {
    "title": "CISA warns Oracle Identity Manager RCE flaw is being actively exploited",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-oracle-identity-manager-rce-flaw-is-being-actively-exploited/",
    "date": "2025-11-21T23:50:27.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Cybersecurity & Infrastructure Security Agency (CISA) is warning government agencies to patch an Oracle Identity Manager tracked as CVE-2025-61757 that has been exploited in attacks, potentia..."
  },
  {
    "title": "Deja Vu: Salesforce Customers Hacked Again, Via Gainsight",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/salesforce-customers-hacked-gainsight",
    "date": "2025-11-21T21:22:51.000Z",
    "source": "Dark Reading",
    "summary": "In a repeat of similar attacks during the summer, threat actors affiliated with the ShinyHunters extortion group used a third-party application to steal organizations' Salesforce data...."
  },
  {
    "title": "LINE Messaging Bugs Open Asian Users to Cyber Espionage",
    "link": "https://www.darkreading.com/application-security/line-messaging-bugs-asian-cyber-espionage",
    "date": "2025-11-21T20:18:01.000Z",
    "source": "Dark Reading",
    "summary": "In a potential gift to geopolitical adversaries, the encrypted messaging app uses a leaky custom protocol that allows message replays, impersonation attacks, and sensitive information exposure from ch..."
  },
  {
    "title": "Cloudflare's One-Stop-Shop Convenience Takes Down Global Digital Economy",
    "link": "https://www.darkreading.com/cybersecurity-operations/cloudflares-one-stop-shop-convenience-global-digital-economy",
    "date": "2025-11-21T20:15:07.000Z",
    "source": "Dark Reading",
    "summary": "Even the most advanced systems like Cloudflare can fall victim to software issues and become a global point of failure, Dr. David Utzke argues, adding that the recent outage should be a warning for en..."
  },
  {
    "title": "Hack the Hackers: 6 Laws for Staying Ahead of the Attackers",
    "link": "https://www.darkreading.com/cyber-risk/hack-hackers-6-laws-staying-ahead-cyberattackers",
    "date": "2025-11-21T20:11:28.000Z",
    "source": "Dark Reading",
    "summary": "A new security framework responds to a shift in attackers' tactics, one that allows them to infiltrate enterprises \"silently\" through their own policies...."
  },
  {
    "title": "Nvidia confirms October Windows updates cause gaming issues",
    "link": "https://www.bleepingcomputer.com/news/technology/nvidia-fixes-gaming-issues-caused-by-october-windows-update/",
    "date": "2025-11-21T19:57:48.000Z",
    "source": "Bleeping Computer",
    "summary": "Nvidia has confirmed that last month's security updates are causing gaming performance issues on Windows 11 24H2 and Windows 11 25H2 systems. [...]..."
  },
  {
    "title": "Microsoft: Out-of-band update fixes Windows 11 hotpatch install loop",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-out-of-band-update-fixes-windows-11-hotpatch-install-loop/",
    "date": "2025-11-21T18:02:05.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released an out-of-band cumulative update to fix a known issue causing the November 2025 KB5068966 hotpatch update to reinstall on Windows 11 systems repeatedly. [...]..."
  },
  {
    "title": "Grafana warns of max severity admin spoofing vulnerability",
    "link": "https://www.bleepingcomputer.com/news/security/grafana-warns-of-max-severity-admin-spoofing-vulnerability/",
    "date": "2025-11-21T17:58:32.000Z",
    "source": "Bleeping Computer",
    "summary": "Grafana Labs is warning of a maximum severity vulnerability (CVE-2025-41115) in its Enterprise product that can be exploited to treat new users as administrators or for privilege escalation. [...]..."
  },
  {
    "title": "CrowdStrike catches insider feeding information to hackers",
    "link": "https://www.bleepingcomputer.com/news/security/crowdstrike-catches-insider-feeding-information-to-hackers/",
    "date": "2025-11-21T16:48:41.000Z",
    "source": "Bleeping Computer",
    "summary": "American cybersecurity firm CrowdStrike has confirmed that an insider shared screenshots taken on internal systems with hackers after they were leaked on Telegram by the Scattered Lapsus$ Hunters thre..."
  },
  {
    "title": "Grafana Patches CVSS 10.0 SCIM Flaw Enabling Impersonation and Privilege Escalation",
    "link": "https://thehackernews.com/2025/11/grafana-patches-cvss-100-scim-flaw.html",
    "date": "2025-11-21T15:40:00.000Z",
    "source": "The Hacker News",
    "summary": "Grafana has released security updates to address a maximum severity security flaw that could allow privilege escalation or user impersonation under certain configurations.\nThe vulnerability, tracked a..."
  },
  {
    "title": "With AI Reshaping Entry-Level Cyber, What Happens to the Security Talent Pipeline?",
    "link": "https://www.darkreading.com/cybersecurity-careers/with-ai-reshaping-entry-level-cyber-what-happens-to-the-security-talent-pipeline-",
    "date": "2025-11-21T15:02:45.000Z",
    "source": "Dark Reading",
    "summary": "Automation is rewriting early-career cybersecurity work, raising urgent questions about how the next generation of security professionals will gain real-world expertise...."
  },
  {
    "title": "Switching to Offense: US Makes Cyber Strategy Changes",
    "link": "https://www.darkreading.com/cyber-risk/us-makes-cyber-strategy-changes",
    "date": "2025-11-21T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The US national cyber director describes the next cyber strategy as focusing \"on shaping adversary behavior,\" adding consequences and aggressive response...."
  },
  {
    "title": "Google Brings AirDrop Compatibility to Android’s Quick Share Using Rust-Hardened Security",
    "link": "https://thehackernews.com/2025/11/google-adds-airdrop-compatibility-to.html",
    "date": "2025-11-21T13:00:00.000Z",
    "source": "The Hacker News",
    "summary": "In a surprise move, Google on Thursday announced that it has updated Quick Share, its peer-to-peer file transfer service, to work with Apple's equipment AirDrop, allowing users to more easily share fi..."
  },
  {
    "title": "Why IT Admins Choose Samsung for Mobile Security",
    "link": "https://thehackernews.com/2025/11/why-it-admins-choose-samsung-for-mobile.html",
    "date": "2025-11-21T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Ever wonder how some IT teams keep corporate data safe without slowing down employees? Of course you have.\nMobile devices are essential for modern work—but with mobility comes risk. IT admins, like yo..."
  }
]