[
  {
    "title": "Ransomware Defense Using the Wazuh Open Source Platform",
    "link": "https://thehackernews.com/2025/11/ransomware-defense-using-wazuh-open.html",
    "date": "2025-11-04T11:06:00.000Z",
    "source": "The Hacker News",
    "summary": "Ransomware is malicious software designed to block access to a computer system or encrypt data until a ransom is paid. This cyberattack is one of the most prevalent and damaging threats in the digital..."
  },
  {
    "title": "Operation SkyCloak Deploys Tor-Enabled OpenSSH Backdoor Targeting Defense Sectors",
    "link": "https://thehackernews.com/2025/11/operation-skycloak-deploys-tor-enabled.html",
    "date": "2025-11-04T10:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors are leveraging weaponized attachments distributed via phishing emails to deliver malware likely targeting the defense sector in Russia and Belarus.\nAccording to multiple reports from Cyb..."
  },
  {
    "title": "Google’s AI ‘Big Sleep’ Finds 5 New Vulnerabilities in Apple’s Safari WebKit",
    "link": "https://thehackernews.com/2025/11/googles-ai-big-sleep-finds-5-new.html",
    "date": "2025-11-04T08:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Google's artificial intelligence (AI)-powered cybersecurity agent called Big Sleep has been credited by Apple for discovering as many as five different security flaws in the WebKit component used in i..."
  },
  {
    "title": "Hackers exploit critical auth bypass flaw in JobMonster WordPress theme",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-critical-auth-bypass-flaw-in-jobmonster-wordpress-theme/",
    "date": "2025-11-04T07:49:31.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are targeting a critical vulnerability in the JobMonster WordPress theme that allows hijacking of administrator accounts under certain conditions. [...]..."
  },
  {
    "title": "U.S. Prosecutors Indict Cybersecurity Insiders Accused of BlackCat Ransomware Attacks",
    "link": "https://thehackernews.com/2025/11/us-prosecutors-indict-cybersecurity.html",
    "date": "2025-11-04T07:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Federal prosecutors in the U.S. have accused a trio of allegedly hacking the networks of five U.S. companies with BlackCat (aka ALPHV) ransomware between May and November 2023 and extorting them.\nRyan..."
  },
  {
    "title": "Microsoft Detects \"SesameOp\" Backdoor Using OpenAI's API as a Stealth Command Channel",
    "link": "https://thehackernews.com/2025/11/microsoft-detects-sesameop-backdoor.html",
    "date": "2025-11-04T05:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has disclosed details of a novel backdoor dubbed SesameOp that uses OpenAI Assistants Application Programming Interface (API) for command-and-control (C2) communications.\n\"Instead of relying..."
  },
  {
    "title": "Android Malware Mutes Alerts, Drains Crypto Wallets",
    "link": "https://www.darkreading.com/vulnerabilities-threats/android-malware-mutes-alerts-drains-crypto-wallets",
    "date": "2025-11-03T22:19:13.000Z",
    "source": "Dark Reading",
    "summary": "Android/BankBot-YNRK is currently targeting users in Indonesia by masquerading as legitimate applications...."
  },
  {
    "title": "Hacker steals over $120 million from Balancer DeFi crypto protocol",
    "link": "https://www.bleepingcomputer.com/news/cryptocurrency/hacker-steals-over-120-million-from-balancer-defi-crypto-protocol/",
    "date": "2025-11-03T21:53:35.000Z",
    "source": "Bleeping Computer",
    "summary": "The Balancer Protocol announced that hackers had targeted its v2 pools, with losses reportedly estimated to be more than $128 million. [...]..."
  },
  {
    "title": "Fake Solidity VSCode extension on Open VSX backdoors developers",
    "link": "https://www.bleepingcomputer.com/news/security/fake-solidity-vscode-extension-on-open-vsx-backdoors-developers/",
    "date": "2025-11-03T20:50:10.000Z",
    "source": "Bleeping Computer",
    "summary": "A remote access trojan dubbed SleepyDuck, and disguised as the well-known Solidity extension in the Open VSX open-source registry, uses an Ethereum smart contract to establish a communication channel ..."
  },
  {
    "title": "Hackers Weaponize Remote Tools to Hijack Cargo Freight",
    "link": "https://www.darkreading.com/identity-access-management-security/hackers-weaponize-remote-tools-hijack-cargo-freight",
    "date": "2025-11-03T19:01:15.000Z",
    "source": "Dark Reading",
    "summary": "Researchers uncovered a new threat campaign in which attackers use RMM tools to steal physical cargo out of the supply chain...."
  },
  {
    "title": "Microsoft: SesameOp malware abuses OpenAI Assistants API in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-sesameop-malware-abuses-openai-assistants-api-in-attacks/",
    "date": "2025-11-03T18:35:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft security researchers have discovered a new backdoor malware that uses the OpenAI Assistants API as a covert command-and-control channel. [...]..."
  },
  {
    "title": "Malicious VSX Extension \"SleepyDuck\" Uses Ethereum to Keep Its Command Server Alive",
    "link": "https://thehackernews.com/2025/11/malicious-vsx-extension-sleepyduck-uses.html",
    "date": "2025-11-03T18:08:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have flagged a new malicious extension in the Open VSX registry that harbors a remote access trojan called SleepyDuck.\nAccording to Secure Annex's John Tuckner, the extension..."
  },
  {
    "title": "US cybersecurity experts indicted for BlackCat ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/us-cybersecurity-experts-indicted-for-blackcat-ransomware-attacks/",
    "date": "2025-11-03T17:15:39.000Z",
    "source": "Bleeping Computer",
    "summary": "Three former employees of cybersecurity incident response companies DigitalMint and Sygnia have been indicted for allegedly hacking the networks of five U.S. companies in BlackCat (ALPHV) ransomware a..."
  },
  {
    "title": "Hackers use RMM tools to breach freighters and steal cargo shipments",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-use-rmm-tools-to-breach-freighters-and-steal-cargo-shipments/",
    "date": "2025-11-03T16:46:40.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are targeting freight brokers and trucking carriers with malicious links and emails to deploy remote monitoring and management tools (RMMs) that enable them to hijack cargo and steal phy..."
  },
  {
    "title": "Microsoft: Patch for WSUS flaw disabled Windows Server hotpatching",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-patch-for-wsus-flaw-disabled-windows-server-hotpatching/",
    "date": "2025-11-03T15:22:12.000Z",
    "source": "Bleeping Computer",
    "summary": "An out-of-band (OOB) security update that patches an actively exploited Windows Server Update Service (WSUS) vulnerability has broken hotpatching on some Windows Server 2025 devices. [...]..."
  },
  {
    "title": "OAuth Device Code Phishing: Azure vs. Google Compared",
    "link": "https://www.bleepingcomputer.com/news/security/oauth-device-code-phishing-azure-vs-google-compared/",
    "date": "2025-11-03T15:11:21.000Z",
    "source": "Bleeping Computer",
    "summary": "Device code phishing abuses the OAuth device flow, and Google and Azure produce strikingly different attack surfaces. Register for Huntress Labs' Live Hack to learn about attack techniques, defensive ..."
  },
  {
    "title": "Let's Get Physical: A New Convergence for Electrical Grid Security",
    "link": "https://www.darkreading.com/cybersecurity-operations/physical-convergence-electrical-grid-cybersecurity",
    "date": "2025-11-03T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The power grid is being attacked online and IRL. Increasingly, regulators and industry experts agree: Security teams need to focus on both cyber and physical threats, together...."
  },
  {
    "title": "Cybercriminals Exploit Remote Monitoring Tools to Infiltrate Logistics and Freight Networks",
    "link": "https://thehackernews.com/2025/11/cybercriminals-exploit-remote.html",
    "date": "2025-11-03T13:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Bad actors are increasingly training their sights on trucking and logistics companies with an aim to infect them with remote monitoring and management (RMM) software for financial gain and ultimately ..."
  },
  {
    "title": "⚡ Weekly Recap: Lazarus Hits Web3, Intel/AMD TEEs Cracked, Dark Web Leak Tool & More",
    "link": "https://thehackernews.com/2025/11/weekly-recap-lazarus-hits-web3-intelamd.html",
    "date": "2025-11-03T12:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Cyberattacks are getting smarter and harder to stop. This week, hackers used sneaky tools, tricked trusted systems, and quickly took advantage of new security problems—some just hours after being foun..."
  },
  {
    "title": "AI Developed Code: 5 Critical Security Checkpoints for Human Oversight",
    "link": "https://www.darkreading.com/application-security/ai-code-security-checkpoints",
    "date": "2025-11-03T12:00:00.000Z",
    "source": "Dark Reading",
    "summary": "To write secure code with LLMs developers must have the skills to use AI as a collaborative assistant rather than an autonomous tool, Madou argues...."
  },
  {
    "title": "The Evolution of SOC Operations: How Continuous Exposure Management Transforms Security Operations",
    "link": "https://thehackernews.com/2025/11/the-evolution-of-soc-operations-how.html",
    "date": "2025-11-03T11:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Security Operations Centers (SOC) today are overwhelmed. Analysts handle thousands of alerts every day, spending much time chasing false positives and adjusting detection rules reactively. SOCs often ..."
  },
  {
    "title": "Researchers Uncover BankBot-YNRK and DeliveryRAT Android Trojans Stealing Financial Data",
    "link": "https://thehackernews.com/2025/11/researchers-uncover-bankbot-ynrk-and.html",
    "date": "2025-11-03T11:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have shed light on two different Android trojans called BankBot-YNRK and DeliveryRAT that are capable of harvesting sensitive data from compromised devices.\nAccording to CYFI..."
  },
  {
    "title": "'TruffleNet' Attack Wields Stolen Credentials Against AWS",
    "link": "https://www.darkreading.com/vulnerabilities-threats/trufflenet-attack-stolen-credentials-aws",
    "date": "2025-11-03T10:59:03.000Z",
    "source": "Dark Reading",
    "summary": "Reconnaissance and BEC are among the malicious activities attackers commit after compromising cloud accounts, using a framework based on the TruffleHog tool...."
  },
  {
    "title": "New HttpTroy Backdoor Poses as VPN Invoice in Targeted Cyberattack on South Korea",
    "link": "https://thehackernews.com/2025/11/new-httptroy-backdoor-poses-as-vpn.html",
    "date": "2025-11-03T10:42:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korea-linked threat actor known as Kimsuky has distributed a previously undocumented backdoor codenamed HttpTroy as part of a likely spear-phishing attack targeting a single victim in South ..."
  },
  {
    "title": "Microsoft: Windows Task Manager won’t quit after KB5067036 update",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-task-manager-wont-quit-after-kb5067036-update/",
    "date": "2025-11-03T10:12:47.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed a known issue that is preventing users from quitting the Windows 11 Task Manager after installing the October 2025 optional update. [...]..."
  },
  {
    "title": "Penn hacker claims to have stolen 1.2 million donor records in data breach",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-hacker-claims-1.2-million-donor-data-breach/",
    "date": "2025-11-02T22:07:14.000Z",
    "source": "Bleeping Computer",
    "summary": "A hacker has taken responsibility for last week's University of Pennsylvania \"We got hacked\" email incident, saying it was a far more extensive breach that exposed data on 1.2 million donors and inter..."
  },
  {
    "title": "Alleged Jabber Zeus Coder ‘MrICQ’ in U.S. Custody",
    "link": "https://krebsonsecurity.com/2025/11/alleged-jabber-zeus-coder-mricq-in-u-s-custody/",
    "date": "2025-11-02T20:37:24.000Z",
    "source": "Krebs on Security",
    "summary": "A Ukrainian man indicted in 2012 for conspiring with a prolific hacking group to steal tens of millions of dollars from U.S. businesses was arrested in Italy and is now in custody in the United States..."
  },
  {
    "title": "Open VSX rotates access tokens used in supply-chain malware attack",
    "link": "https://www.bleepingcomputer.com/news/security/open-vsx-rotates-tokens-used-in-supply-chain-malware-attack/",
    "date": "2025-11-02T15:09:19.000Z",
    "source": "Bleeping Computer",
    "summary": "The Open VSX registry rotated access tokens after they were accidentally leaked by developers in public repositories and allowed threat actors to publish malicious extensions in an attempted supply-ch..."
  },
  {
    "title": "OpenAI is going Meta route, as it considers memory-based ads on ChatGPT",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-going-meta-route-as-it-considers-memory-based-ads-on-chatgpt/",
    "date": "2025-11-01T20:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is planning to introduce ads on ChatGPT, as it continues to struggle with revenue from paid users. [...]..."
  },
  {
    "title": "Google confirms AI search will have ads, but they may look different",
    "link": "https://www.bleepingcomputer.com/news/google/google-confirms-ai-search-will-have-ads-but-they-may-look-different/",
    "date": "2025-11-01T16:56:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google Ads are not going anywhere. Eventually, AI Search results on Google and likely other properties will have ads. [...]..."
  }
]