[
  {
    "title": "CISA orders federal agencies to replace end-of-life edge devices",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-federal-agencies-to-replace-end-of-life-edge-devices/",
    "date": "2026-02-06T08:41:11.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a new binding operational directive requiring federal agencies to identify and remove network edge devices that no longer re..."
  },
  {
    "title": "Compromised dYdX npm and PyPI Packages Deliver Wallet Stealers and RAT Malware",
    "link": "https://thehackernews.com/2026/02/compromised-dydx-npm-and-pypi-packages.html",
    "date": "2026-02-06T08:40:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new supply chain attack in which legitimate packages on npm and the Python Package Index (PyPI) repository have been compromised to push malicious versions ..."
  },
  {
    "title": "Claude Opus 4.6 Finds 500+ High-Severity Flaws Across Major Open-Source Libraries",
    "link": "https://thehackernews.com/2026/02/claude-opus-46-finds-500-high-severity.html",
    "date": "2026-02-06T05:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence (AI) company Anthropic revealed that its latest large language model (LLM), Claude Opus 4.6, has found more than 500 previously unknown high-severity security flaws in open-sou..."
  },
  {
    "title": "EnCase Driver Weaponized as EDR Killers Persist",
    "link": "https://www.darkreading.com/threat-intelligence/encase-driver-weaponized-edr-killers-persist",
    "date": "2026-02-05T22:35:20.000Z",
    "source": "Dark Reading",
    "summary": "The forensic tool's driver was signed with a digital certificate that expired years ago, but major security gaps allowed Windows to load it...."
  },
  {
    "title": "Agentic AI Site 'Moltbook' Is Riddled With Security Risks",
    "link": "https://www.darkreading.com/cyber-risk/agentic-ai-moltbook-security-risks",
    "date": "2026-02-05T22:03:29.000Z",
    "source": "Dark Reading",
    "summary": "Someone used AI to build an entire Web platform, which then did something predictable and preventable: It exposed all its data through a publicly accessible API...."
  },
  {
    "title": "Spain's Ministry of Science shuts down systems after breach claims",
    "link": "https://www.bleepingcomputer.com/news/security/spains-ministry-of-science-shuts-down-systems-after-breach-claims/",
    "date": "2026-02-05T21:23:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Spain's Ministry of Science (Ministerio de Ciencia) announced a partial shutdown of its IT systems, affecting several citizen- and company-facing services. [...]..."
  },
  {
    "title": "Ransomware gang uses ISPsystem VMs for stealthy payload delivery",
    "link": "https://www.bleepingcomputer.com/news/security/ransomware-gang-uses-ispsystem-vms-for-stealthy-payload-delivery/",
    "date": "2026-02-05T20:57:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Ransomware operators are hosting and delivering malicious payloads at scale by abusing virtual machines (VMs) provisioned by ISPsystem, a legitimate virtual infrastructure management provider. [...]..."
  },
  {
    "title": "Microsoft to shut down Exchange Online EWS in April 2027",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-shut-down-exchange-web-services-in-cloud-in-2027/",
    "date": "2026-02-05T18:07:41.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced today that the Exchange Web Services (EWS) API for Exchange Online will be shut down in April 2027, after nearly 20 years. [...]..."
  },
  {
    "title": "AISURU/Kimwolf Botnet Launches Record-Setting 31.4 Tbps DDoS Attack",
    "link": "https://thehackernews.com/2026/02/aisurukimwolf-botnet-launches-record.html",
    "date": "2026-02-05T17:25:00.000Z",
    "source": "The Hacker News",
    "summary": "The distributed denial-of-service (DDoS) botnet known as AISURU/Kimwolf has been attributed to a record-setting attack that peaked at 31.4 Terabits per second (Tbps) and lasted only 35 seconds.\nCloudf..."
  },
  {
    "title": "Italian university La Sapienza goes offline after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/italian-university-la-sapienza-goes-offline-after-cyberattack/",
    "date": "2026-02-05T17:02:45.000Z",
    "source": "Bleeping Computer",
    "summary": "Rome's \"La Sapienza\" university has been targeted by a cyberattack that impacted its IT systems and caused widespread operational disruptions at the educational institute. [...]..."
  },
  {
    "title": "Romanian oil pipeline operator Conpet discloses cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/romanian-oil-pipeline-operator-conpet-discloses-cyberattack-qilin-ransomware/",
    "date": "2026-02-05T15:15:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Conpet, Romania's national oil pipeline operator, has disclosed that a cyberattack disrupted its business systems and took down the company's website on Tuesday. [...]..."
  },
  {
    "title": "When cloud logs fall short, the network tells the truth ",
    "link": "https://www.bleepingcomputer.com/news/security/when-cloud-logs-fall-short-the-network-tells-the-truth/",
    "date": "2026-02-05T15:00:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Cloud logs can be inconsistent or incomplete, creating blind spots as environments scale and change. Corelight shows how network-level telemetry provides reliable visibility when cloud logs fall short..."
  },
  {
    "title": "Cyber Success Trifecta: Education, Certifications &amp; Experience",
    "link": "https://www.darkreading.com/cybersecurity-operations/the-trifecta-of-cyber-success-education-certifications-and-experience",
    "date": "2026-02-05T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Col. Georgeo Xavier Pulikkathara, CISO at iMerit, discusses the importance of fundamentals, continuous learning, and human ingenuity in the face of AI-driven cybersecurity evolution...."
  },
  {
    "title": "ThreatsDay Bulletin: Codespaces RCE, AsyncRAT C2, BYOVD Abuse, AI Cloud Intrusions & 15+ Stories",
    "link": "https://thehackernews.com/2026/02/threatsday-bulletin-codespaces-rce.html",
    "date": "2026-02-05T12:57:00.000Z",
    "source": "The Hacker News",
    "summary": "This week didn’t produce one big headline. It produced many small signals — the kind that quietly shape what attacks will look like next.\nResearchers tracked intrusions that start in ordinary places: ..."
  },
  {
    "title": "Newsletter platform Substack notifies users of data breach",
    "link": "https://www.bleepingcomputer.com/news/security/newsletter-platform-substack-notifies-users-of-data-breach/",
    "date": "2026-02-05T12:54:48.000Z",
    "source": "Bleeping Computer",
    "summary": "Newsletter platform Substack is notifying users of a data breach after attackers stole their email addresses and phone numbers in October 2025. [...]..."
  },
  {
    "title": "The Buyer’s Guide to AI Usage Control",
    "link": "https://thehackernews.com/2026/02/the-buyers-guide-to-ai-usage-control.html",
    "date": "2026-02-05T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Today’s “AI everywhere” reality is woven into everyday workflows across the enterprise, embedded in SaaS platforms, browsers, copilots, extensions, and a rapidly expanding universe of shadow tools tha..."
  },
  {
    "title": "Data breach at fintech firm Betterment exposes 1.4 million accounts",
    "link": "https://www.bleepingcomputer.com/news/security/data-breach-at-fintech-firm-betterment-exposes-14-million-accounts/",
    "date": "2026-02-05T11:16:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers stole email addresses and other personal information from 1.4 million accounts after breaching the systems of automated investment platform Betterment in January. [...]..."
  },
  {
    "title": "Infy Hackers Resume Operations with New C2 Servers After Iran Internet Blackout Ends",
    "link": "https://thehackernews.com/2026/02/infy-hackers-resume-operations-with-new.html",
    "date": "2026-02-05T10:25:00.000Z",
    "source": "The Hacker News",
    "summary": "The elusive Iranian threat group known as Infy (aka Prince of Persia) has evolved its tactics as part of efforts to hide its tracks, even as it readied new command-and-control (C2) infrastructure coin..."
  },
  {
    "title": "Zendesk spam wave returns, floods users with 'Activate account' emails",
    "link": "https://www.bleepingcomputer.com/news/security/zendesk-spam-wave-returns-floods-users-with-activate-account-emails/",
    "date": "2026-02-05T10:22:36.000Z",
    "source": "Bleeping Computer",
    "summary": "A fresh wave of spam is hitting inboxes worldwide, with users reporting that they are once again being bombarded by automated emails generated through companies' unsecured Zendesk support systems. Som..."
  },
  {
    "title": "Protests Don't Impede Iranian Spying on Expats, Syrians, Israelis",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/iran-spies-expats-syrians-israelis",
    "date": "2026-02-05T07:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Iranian threat actors have been stealing credentials from people of interest across the Middle East, using spear-phishing and social engineering...."
  },
  {
    "title": "Critical n8n Flaw CVE-2026-25049 Enables System Command Execution via Malicious Workflows",
    "link": "https://thehackernews.com/2026/02/critical-n8n-flaw-cve-2026-25049.html",
    "date": "2026-02-05T06:16:00.000Z",
    "source": "The Hacker News",
    "summary": "A new, critical security vulnerability has been disclosed in the n8n workflow automation platform that, if successfully exploited, could result in the execution of arbitrary system commands.\nThe flaw,..."
  },
  {
    "title": "Malicious NGINX Configurations Enable Large-Scale Web Traffic Hijacking Campaign",
    "link": "https://thehackernews.com/2026/02/hackers-exploit-react2shell-to-hijack.html",
    "date": "2026-02-05T04:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of an active web traffic hijacking campaign that has targeted NGINX installations and management panels like Baota (BT) in an attempt to route it throu..."
  },
  {
    "title": "Hackers compromise NGINX servers to redirect user traffic",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-compromise-nginx-servers-to-redirect-user-traffic/",
    "date": "2026-02-04T23:26:56.000Z",
    "source": "Bleeping Computer",
    "summary": "A threat actor is compromising NGINX servers in a campaign that hijacks user traffic and reroutes it through the attacker's backend infrastructure. [...]..."
  },
  {
    "title": "Ransomware Gang Goes Full 'Godfather' With Cartel",
    "link": "https://www.darkreading.com/cyber-risk/ransomware-gang-full-godfather-cartel",
    "date": "2026-02-04T22:14:19.000Z",
    "source": "Dark Reading",
    "summary": "DragonForce is taking cues from organized crime, emphasizing cooperation and coordination among ransomware gangs...."
  },
  {
    "title": "CISA Makes Unpublicized Ransomware Updates to KEV Catalog",
    "link": "https://www.darkreading.com/threat-intelligence/cisa-hidden-ransomware-updates-kev-catalog",
    "date": "2026-02-04T21:48:57.000Z",
    "source": "Dark Reading",
    "summary": "A third of the \"flipped\" CVEs affected network edge devices, leading one researcher to conclude, \"Ransomware operators are building playbooks around your perimeter.\"..."
  },
  {
    "title": "Critical n8n flaws disclosed along with public exploits",
    "link": "https://www.bleepingcomputer.com/news/security/critical-n8n-flaws-disclosed-along-with-public-exploits/",
    "date": "2026-02-04T21:14:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Multiple critical vulnerabilities in the popular n8n open-source workflow automation platform allow escaping the confines of the environment and taking complete control of the host server. [...]..."
  },
  {
    "title": "Attackers Use Windows Screensavers to Drop Malware, RMM Tools",
    "link": "https://www.darkreading.com/application-security/attackers-use-screensavers-drop-malware-rmm-tools",
    "date": "2026-02-04T21:06:28.000Z",
    "source": "Dark Reading",
    "summary": "By tapping the unusual .scr file type, attackers leverage \"executables that don't always receive executable-level controls,\" one researcher noted...."
  },
  {
    "title": "Microsoft Develops Scanner to Detect Backdoors in Open-Weight Large Language Models",
    "link": "https://thehackernews.com/2026/02/microsoft-develops-scanner-to-detect.html",
    "date": "2026-02-04T17:52:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Wednesday said it built a lightweight scanner that it said can detect backdoors in open-weight large language models (LLMs) and improve the overall trust in artificial intelligence (AI) s..."
  },
  {
    "title": "CISA: VMware ESXi flaw now exploited in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-vmware-esxi-flaw-now-exploited-in-ransomware-attacks/",
    "date": "2026-02-04T17:38:46.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA confirmed on Wednesday that ransomware gangs have begun exploiting a high-severity VMware ESXi sandbox escape vulnerability that was used in zero-day attacks since at least February 2024. [...]..."
  },
  {
    "title": "DEAD#VAX Malware Campaign Deploys AsyncRAT via IPFS-Hosted VHD Phishing Files",
    "link": "https://thehackernews.com/2026/02/deadvax-malware-campaign-deploys.html",
    "date": "2026-02-04T17:24:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters have disclosed details of a new, stealthy malware campaign dubbed DEAD#VAX that employs a mix of \"disciplined tradecraft and clever abuse of legitimate system features\" to bypass tradit..."
  }
]