[
  {
    "title": "ConnectWise fixes Automate bug allowing AiTM update attacks",
    "link": "https://www.bleepingcomputer.com/news/security/connectwise-fixes-automate-bug-allowing-aitm-update-attacks/",
    "date": "2025-10-17T19:29:22.000Z",
    "source": "Bleeping Computer",
    "summary": "ConnectWise released a security update to address vulnerabilities, one of them with critical severity, in Automate product that could expose sensitive communications to interception and modification. ..."
  },
  {
    "title": "American Airlines subsidiary Envoy confirms Oracle data theft attack",
    "link": "https://www.bleepingcomputer.com/news/security/american-airlines-subsidiary-envoy-confirms-oracle-data-theft-attack/",
    "date": "2025-10-17T19:11:52.000Z",
    "source": "Bleeping Computer",
    "summary": "Envoy Air, a regional airline carrier owned by American Airlines, confirms that data was compromised from its Oracle E-Business Suite application after the Clop extortion gang listed American Airlines..."
  },
  {
    "title": "Microsoft Disrupts Ransomware Campaign Abusing Azure Certificates",
    "link": "https://www.darkreading.com/threat-intelligence/microsoft-disrupts-ransomware-abusing-azure-certificates",
    "date": "2025-10-17T18:00:45.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft revoked more than 200 digital certificates that threat actors used to sign fake Teams binaries that set the stage for Rhysida ransomware attacks...."
  },
  {
    "title": "Microsoft lifts more safeguard holds blocking Windows 11 updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-lifts-more-safeguard-holds-blocking-windows-11-updates/",
    "date": "2025-10-17T17:22:16.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has removed two more compatibility holds preventing customers from installing Windows 11 24H2 via Windows Update. [...]..."
  },
  {
    "title": "Europol dismantles SIM box operation renting numbers for cybercrime",
    "link": "https://www.bleepingcomputer.com/news/security/europol-dismantles-sim-box-operation-renting-numbers-for-cybercrime/",
    "date": "2025-10-17T17:01:51.000Z",
    "source": "Bleeping Computer",
    "summary": "European law enforcement in an operation codenamed 'SIMCARTEL' has dismantled an illegal SIM-box service that enabled more than 3,200 fraud cases and caused at least 4.5 million euros in losses. [...]..."
  },
  {
    "title": "AI Agent Security: Whose Responsibility Is It?",
    "link": "https://www.darkreading.com/cybersecurity-operations/ai-agent-security-awareness-responsibility",
    "date": "2025-10-17T16:23:40.000Z",
    "source": "Dark Reading",
    "summary": "The shared responsibility model of data security, familiar from cloud deployments, is key to agentic services, but cybersecurity teams and corporate users often struggle with awareness and managing th..."
  },
  {
    "title": "AI Chat Data Is History's Most Thorough Record of Enterprise Secrets. Secure It Wisely",
    "link": "https://www.darkreading.com/application-security/ai-chat-data-is-history-s-most-thorough-record-of-enterprise-secrets-secure-it-accordingly",
    "date": "2025-10-17T15:41:55.000Z",
    "source": "Dark Reading",
    "summary": "AI interactions are becoming one of the most revealing records of human thinking, and we're only beginning to understand what that means for law enforcement, accountability, and privacy...."
  },
  {
    "title": "Microsoft fixes highest-severity ASP.NET Core flaw ever",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-highest-severity-aspnet-core-flaw-ever/",
    "date": "2025-10-17T15:35:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Earlier this week, Microsoft patched a vulnerability that was flagged with the \"highest ever\" severity rating received by an ASP.NET Core security flaw. [...]..."
  },
  {
    "title": "VMware Certification: Your Next Career Power Move",
    "link": "https://www.bleepingcomputer.com/news/security/vmware-certification-your-next-career-power-move/",
    "date": "2025-10-17T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "VMware certification isn't just about passing exams — it's about mastering systems, proving expertise, and your career. Gain hands-on labs, discounts, and mentorship with VMUG Advantage to reach your ..."
  },
  {
    "title": "Microsoft fixes Windows bug breaking localhost HTTP connections",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-bug-breaking-localhost-http-connections/",
    "date": "2025-10-17T13:58:27.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has fixed a known issue breaking HTTP/2 localhost (127.0.0.1) connections and IIS websites after installing recent Windows security updates. [...]..."
  },
  {
    "title": "North Korean Hackers Combine BeaverTail and OtterCookie into Advanced JS Malware",
    "link": "https://thehackernews.com/2025/10/north-korean-hackers-combine-beavertail.html",
    "date": "2025-10-17T13:33:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korean threat actor linked to the Contagious Interview campaign has been observed merging some of the functionality of two of its malware programs, indicating that the hacking group is activ..."
  },
  {
    "title": "Over 266,000 F5 BIG-IP instances exposed to remote attacks",
    "link": "https://www.bleepingcomputer.com/news/security/over-266-000-f5-big-ip-instances-exposed-to-remote-attacks/",
    "date": "2025-10-17T12:16:23.000Z",
    "source": "Bleeping Computer",
    "summary": "Internet security nonprofit Shadowserver Foundation has found more than 266,000 F5 BIG-IP instances exposed online after the security breach disclosed by cybersecurity company F5 this week. [...]..."
  },
  {
    "title": "Email Bombs Exploit Lax Authentication in Zendesk",
    "link": "https://krebsonsecurity.com/2025/10/email-bombs-exploit-lax-authentication-in-zendesk/",
    "date": "2025-10-17T11:26:27.000Z",
    "source": "Krebs on Security",
    "summary": "Cybercriminals are abusing a widespread lack of authentication in the customer service platform Zendesk to flood targeted email inboxes with menacing messages that come from hundreds of Zendesk corpor..."
  },
  {
    "title": "Identity Security: Your First and Last Line of Defense",
    "link": "https://thehackernews.com/2025/10/identity-security-your-first-and-last.html",
    "date": "2025-10-17T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "The danger isn’t that AI agents have bad days — it’s that they never do. They execute faithfully, even when what they’re executing is a mistake. A single misstep in logic or access can turn flawless a..."
  },
  {
    "title": "Researchers Uncover WatchGuard VPN Bug That Could Let Attackers Take Over Devices",
    "link": "https://thehackernews.com/2025/10/researchers-uncover-watchguard-vpn-bug.html",
    "date": "2025-10-17T09:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a recently patched critical security flaw in WatchGuard Fireware that could allow unauthenticated attackers to execute arbitrary code.\nThe vulnerabi..."
  },
  {
    "title": "Microsoft Revokes 200 Fraudulent Certificates Used in Rhysida Ransomware Campaign",
    "link": "https://thehackernews.com/2025/10/microsoft-revokes-200-fraudulent.html",
    "date": "2025-10-17T06:03:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Thursday disclosed that it revoked more than 200 certificates used by a threat actor it tracks as Vanilla Tempest to fraudulently sign malicious binaries in ransomware attacks.\nThe certif..."
  },
  {
    "title": "Windows 11 updates break localhost (127.0.0.1) HTTP/2 connections",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-updates-break-localhost-127001-http-2-connections/",
    "date": "2025-10-16T22:25:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft's October Windows 11 updates have broken the \"localhost\" functionality, making applications that connect back to 127.0.0.1 over HTTP/2 no longer function properly. [...]..."
  },
  {
    "title": "Cyberattackers Target LastPass, Top Password Managers",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/cyberattackers-target-lastpass-password-managers",
    "date": "2025-10-16T20:33:11.000Z",
    "source": "Dark Reading",
    "summary": "Be aware: a rash of phishing campaigns are leveraging the anxiety and trust employees have in password vaults securing all of their credentials...."
  },
  {
    "title": "Leaks in Microsoft VS Code Marketplace Put Supply Chain at Risk",
    "link": "https://www.darkreading.com/application-security/leaks-microsoft-vs-code-marketplaces-supply-chain-risks",
    "date": "2025-10-16T19:54:20.000Z",
    "source": "Dark Reading",
    "summary": "Researchers discovered more than 550 unique secrets exposed in Visual Studio Code marketplaces, prompting Microsoft to bolster security measures...."
  },
  {
    "title": "Auction giant Sotheby’s says data breach exposed financial information",
    "link": "https://www.bleepingcomputer.com/news/security/auction-giant-sothebys-says-data-breach-exposed-financial-information/",
    "date": "2025-10-16T19:24:13.000Z",
    "source": "Bleeping Computer",
    "summary": "Major international auction house Sotheby's is notifying individuals of a data breach incident on its systems where threat actors stole sensitive information, including financial details. [...]..."
  },
  {
    "title": "Have I Been Pwned: Prosper data breach impacts 17.6 million accounts",
    "link": "https://www.bleepingcomputer.com/news/security/have-i-been-pwned-warns-of-prosper-data-breach-impacting-176-million-accounts/",
    "date": "2025-10-16T19:19:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers stole the personal information of over 17.6 million people after breaching the systems of financial services company Prosper. [...]..."
  },
  {
    "title": "Hackers exploit Cisco SNMP flaw to deploy rootkit on switches",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-cisco-snmp-flaw-to-deploy-rootkit-on-switches/",
    "date": "2025-10-16T18:13:32.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors exploited a recently patched remote code execution vulnerability (CVE-2025-20352) in Cisco networking devices to deploy a rootkit and target unprotected Linux systems. [...]..."
  },
  {
    "title": "China Hackers Test AI-Optimized Attack Chains in Taiwan",
    "link": "https://www.darkreading.com/threat-intelligence/china-hackers-ai-optimized-attack-taiwan",
    "date": "2025-10-16T17:02:24.000Z",
    "source": "Dark Reading",
    "summary": "AI might help some threat actors in certain respects, but one group is proving that its use for cyberattacks has its limits...."
  },
  {
    "title": "Microsoft disrupts ransomware attacks targeting Teams users",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-disrupts-ransomware-attacks-targeting-teams-users/",
    "date": "2025-10-16T16:58:36.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has disrupted a wave of Rhysida ransomware attacks in early October by revoking over 200 certificates used to sign malicious Teams installers. [...]..."
  },
  {
    "title": "North Korean Hackers Use EtherHiding to Hide Malware Inside Blockchain Smart Contracts",
    "link": "https://thehackernews.com/2025/10/north-korean-hackers-use-etherhiding-to.html",
    "date": "2025-10-16T14:56:00.000Z",
    "source": "The Hacker News",
    "summary": "A threat actor with ties to the Democratic People's Republic of Korea (aka North Korea) has been observed leveraging the EtherHiding technique to distribute malware and enable cryptocurrency theft, ma..."
  },
  {
    "title": "Hackers Abuse Blockchain Smart Contracts to Spread Malware via Infected WordPress Sites",
    "link": "https://thehackernews.com/2025/10/hackers-abuse-blockchain-smart.html",
    "date": "2025-10-16T14:52:00.000Z",
    "source": "The Hacker News",
    "summary": "A financially motivated threat actor codenamed UNC5142 has been observed abusing blockchain smart contracts as a way to facilitate the distribution of information stealers, such as Atomic (AMOS), Lumm..."
  },
  {
    "title": "LinkPro Linux Rootkit Uses eBPF to Hide and Activates via Magic TCP Packets",
    "link": "https://thehackernews.com/2025/10/linkpro-linux-rootkit-uses-ebpf-to-hide.html",
    "date": "2025-10-16T14:28:00.000Z",
    "source": "The Hacker News",
    "summary": "An investigation into the compromise of an Amazon Web Services (AWS)-hosted infrastructure has led to the discovery of a new GNU/Linux rootkit dubbed LinkPro, according to findings from Synacktiv.\n\"Th..."
  },
  {
    "title": "Architectures, Risks, and Adoption: How to Assess and Choose the Right AI-SOC Platform",
    "link": "https://thehackernews.com/2025/10/architectures-risks-and-adoption-how-to.html",
    "date": "2025-10-16T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Scaling the SOC with AI - Why now? \nSecurity Operations Centers (SOCs) are under unprecedented pressure. According to SACR’s AI-SOC Market Landscape 2025, the average organization now faces around 960..."
  },
  {
    "title": "Hackers Deploy Linux Rootkits via Cisco SNMP Flaw in 'Zero Disco' Attacks",
    "link": "https://thehackernews.com/2025/10/hackers-deploy-linux-rootkits-via-cisco.html",
    "date": "2025-10-16T11:38:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new campaign that exploited a recently disclosed security flaw impacting Cisco IOS Software and IOS XE Software to deploy Linux rootkits on older,..."
  },
  {
    "title": "Beware the Hidden Costs of Pen Testing",
    "link": "https://thehackernews.com/2025/10/beware-hidden-costs-of-pen-testing.html",
    "date": "2025-10-16T10:50:00.000Z",
    "source": "The Hacker News",
    "summary": "Penetration testing helps organizations ensure IT systems are secure, but it should never be treated in a one-size-fits-all approach. Traditional approaches can be rigid and cost your organization tim..."
  }
]