[
  {
    "title": "Over 25,000 FortiCloud SSO devices exposed to remote attacks",
    "link": "https://www.bleepingcomputer.com/news/security/over-25-000-forticloud-sso-devices-exposed-to-remote-attacks/",
    "date": "2025-12-19T15:00:45.000Z",
    "source": "Bleeping Computer",
    "summary": "Internet security watchdog Shadowserver has found over 25,000 Fortinet devices exposed online with FortiCloud SSO enabled, amid ongoing attacks targeting a critical authentication bypass vulnerability..."
  },
  {
    "title": "Criminal IP and Palo Alto Networks Cortex XSOAR integrate to bring AI-driven exposure intelligence to automated incident response",
    "link": "https://www.bleepingcomputer.com/news/security/criminal-ip-and-palo-alto-networks-cortex-xsoar-integrate-to-bring-ai-driven-exposure-intelligence-to-automated-incident-response/",
    "date": "2025-12-19T14:30:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Criminal IP (criminalip.io), the AI-powered threat intelligence and attack surface monitoring platform developed by AI SPERA, is now officially integrated into Palo Alto Networks' Cortex XSOAR. [...]..."
  },
  {
    "title": "A Cybersecurity Playbook for AI Adoption",
    "link": "https://www.darkreading.com/cyber-risk/cybersecurity-playbook-ai-adoption",
    "date": "2025-12-19T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "AI adds real value to cybersecurity today, but it cannot yet serve as a single security guardian. Here's how organizations can safely combine AI-driven analysis with deterministic rules and proven sec..."
  },
  {
    "title": "A Good Year for North Korean Cybercriminals",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/good-year-north-korean-cybercriminals",
    "date": "2025-12-19T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "North Korea shifted its strategy to patiently target \"bigger fish\" for larger payouts, using sophisticated methods to execute attacks at opportune times...."
  },
  {
    "title": "Denmark blames Russia for destructive cyberattack on water utility",
    "link": "https://www.bleepingcomputer.com/news/security/denmark-blames-russia-for-destructive-cyberattack-on-water-utility/",
    "date": "2025-12-19T12:28:48.000Z",
    "source": "Bleeping Computer",
    "summary": "Danish intelligence officials blamed Russia for orchestrating cyberattacks against Denmark's critical infrastructure, as part of Moscow's hybrid attacks against Western nations. [...]..."
  },
  {
    "title": "WatchGuard Warns of Active Exploitation of Critical Fireware OS VPN Vulnerability",
    "link": "https://thehackernews.com/2025/12/watchguard-warns-of-active-exploitation.html",
    "date": "2025-12-19T11:23:00.000Z",
    "source": "The Hacker News",
    "summary": "WatchGuard has released fixes to address a critical security flaw in Fireware OS that it said has been exploited in real-world attacks.\nTracked as CVE-2025-14733 (CVSS score: 9.3), the vulnerability h..."
  },
  {
    "title": "Nigeria Arrests RaccoonO365 Phishing Developer Linked to Microsoft 365 Attacks",
    "link": "https://thehackernews.com/2025/12/nigeria-arrests-raccoono365-phishing.html",
    "date": "2025-12-19T10:26:00.000Z",
    "source": "The Hacker News",
    "summary": "Authorities in Nigeria have announced the arrest of three \"high-profile internet fraud suspects\" who are alleged to have been involved in phishing attacks targeting major corporations, including the m..."
  },
  {
    "title": "New critical WatchGuard Firebox firewall flaw exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/watchguard-warns-of-new-rce-flaw-in-firebox-firewalls-exploited-in-attacks/",
    "date": "2025-12-19T10:25:06.000Z",
    "source": "Bleeping Computer",
    "summary": "WatchGuard has warned customers to patch a critical, actively exploited remote code execution (RCE) vulnerability in its Firebox firewalls. [...]..."
  },
  {
    "title": "FTC: Instacart to refund $60M over deceptive subscription tactics",
    "link": "https://www.bleepingcomputer.com/news/legal/instacart-to-refund-60m-over-deceptive-subscription-tactics/",
    "date": "2025-12-19T09:19:40.000Z",
    "source": "Bleeping Computer",
    "summary": "Grocery delivery service Instacart will refund $60 million to settle FTC claims that it misled customers with false advertising and unlawfully enrolled them in paid subscriptions. [...]..."
  },
  {
    "title": "New UEFI Flaw Enables Early-Boot DMA Attacks on ASRock, ASUS, GIGABYTE, MSI Motherboards",
    "link": "https://thehackernews.com/2025/12/new-uefi-flaw-enables-early-boot-dma.html",
    "date": "2025-12-19T08:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Certain motherboard models from vendors like ASRock, ASUSTeK Computer, GIGABYTE, and MSI are affected by a security vulnerability that leaves them susceptible to early-boot direct memory access (DMA) ..."
  },
  {
    "title": "Windows 10 OOB update released to fix Message Queuing (MSMQ) issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-oob-update-released-to-fix-message-queuing-msmq-issues/",
    "date": "2025-12-19T01:15:19.000Z",
    "source": "Bleeping Computer",
    "summary": "This month's extended security update for Windows 11 broke Message Queuing (MSMQ), which is typically used by enterprises to manage background tasks. [...]..."
  },
  {
    "title": "SonicWall Edge Access Devices Hit by Zero-Day Attacks",
    "link": "https://www.darkreading.com/vulnerabilities-threats/sonicwall-edge-devices-zero-day-attacks",
    "date": "2025-12-18T22:25:46.000Z",
    "source": "Dark Reading",
    "summary": "In the latest attacks against the vendor's SMA1000 devices, threat actors have chained a new zero-day flaw with a critical vulnerability disclosed earlier this year...."
  },
  {
    "title": "University of Sydney suffers data breach exposing student and staff info",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-sydney-suffers-data-breach-exposing-student-and-staff-info/",
    "date": "2025-12-18T20:22:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers gained access to an online coding repository belonging to the University of Sydney and stole files with personal information of staff and students. [...]..."
  },
  {
    "title": "Clop ransomware targets Gladinet CentreStack in data theft attacks",
    "link": "https://www.bleepingcomputer.com/news/security/clop-ransomware-targets-gladinet-centrestack-servers-for-extortion/",
    "date": "2025-12-18T20:16:55.000Z",
    "source": "Bleeping Computer",
    "summary": "The Clop ransomware gang is targeting Internet-exposed Gladinet CentreStack file servers in a new data theft extortion campaign. [...]..."
  },
  {
    "title": "China-Aligned Threat Group Uses Windows Group Policy to Deploy Espionage Malware",
    "link": "https://thehackernews.com/2025/12/china-aligned-threat-group-uses-windows.html",
    "date": "2025-12-18T17:34:00.000Z",
    "source": "The Hacker News",
    "summary": "A previously undocumented China-aligned threat cluster dubbed LongNosedGoblin has been attributed to a series of cyber attacks targeting governmental entities in Southeast Asia and Japan.\nThe end goal..."
  },
  {
    "title": "New password spraying attacks target Cisco, PAN VPN gateways",
    "link": "https://www.bleepingcomputer.com/news/security/new-password-spraying-attacks-target-cisco-pan-vpn-gateways/",
    "date": "2025-12-18T17:27:25.000Z",
    "source": "Bleeping Computer",
    "summary": "An automated campaign is targeting multiple VPN platforms, with credential-based attacks being observed on Palo Alto Networks GlobalProtect and Cisco SSL VPN. [...]..."
  },
  {
    "title": "US seizes E-Note crypto exchange for laundering ransomware payments",
    "link": "https://www.bleepingcomputer.com/news/security/us-seizes-e-note-crypto-exchange-for-laundering-ransomware-payments/",
    "date": "2025-12-18T16:13:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Law enforcement has seized the servers and domains of the E-Note cryptocurrency exchange, allegedly used by cybercriminal groups to launder more than $70 million. [...]..."
  },
  {
    "title": "NIS2 compliance: How to get passwords and MFA right",
    "link": "https://www.bleepingcomputer.com/news/security/nis2-compliance-how-to-get-passwords-and-mfa-right/",
    "date": "2025-12-18T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "NIS2 puts identity and access controls under the spotlight, with weak passwords and poor authentication now a compliance risk. Specops Software explains how to align password policies and MFA with NIS..."
  },
  {
    "title": "HPE OneView Flaw Rated CVSS 10.0 Allows Unauthenticated Remote Code Execution",
    "link": "https://thehackernews.com/2025/12/hpe-oneview-flaw-rated-cvss-100-allows.html",
    "date": "2025-12-18T14:39:00.000Z",
    "source": "The Hacker News",
    "summary": "Hewlett Packard Enterprise (HPE) has resolved a maximum-severity security flaw in OneView Software that, if successfully exploited, could result in remote code execution.\nThe critical vulnerability, a..."
  },
  {
    "title": "France arrests Latvian for installing malware on Italian ferry",
    "link": "https://www.bleepingcomputer.com/news/security/france-arrests-latvian-for-installing-malware-on-italian-ferry/",
    "date": "2025-12-18T13:47:59.000Z",
    "source": "Bleeping Computer",
    "summary": "French authorities arrested two crew members of an Italian passenger ferry suspected of infecting the ship with malware that could have enabled them to remotely control the vessel. [...]..."
  },
  {
    "title": "ThreatsDay Bulletin: WhatsApp Hijacks, MCP Leaks, AI Recon, React2Shell Exploit and 15 More Stories",
    "link": "https://thehackernews.com/2025/12/threatsday-bulletin-whatsapp-hijacks.html",
    "date": "2025-12-18T13:10:00.000Z",
    "source": "The Hacker News",
    "summary": "This week’s ThreatsDay Bulletin tracks how attackers keep reshaping old tools and finding new angles in familiar systems. Small changes in tactics are stacking up fast, and each one hints at where the..."
  },
  {
    "title": "North Korea-Linked Hackers Steal $2.02 Billion in 2025, Leading Global Crypto Theft",
    "link": "https://thehackernews.com/2025/12/north-korea-linked-hackers-steal-202.html",
    "date": "2025-12-18T13:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with ties to the Democratic People's Republic of Korea (DPRK or North Korea) have been instrumental in driving a surge in global cryptocurrency theft in 2025, accounting for at least $2...."
  },
  {
    "title": "Dormant Iran APT is Still Alive, Spying on Dissidents",
    "link": "https://www.darkreading.com/threat-intelligence/iran-apt-spying-dissidents",
    "date": "2025-12-18T13:00:00.000Z",
    "source": "Dark Reading",
    "summary": "\"Prince of Persia\" has rewritten the rules of persistence with advanced operational security and cryptographic communication with its command-and-control server...."
  },
  {
    "title": "The Case for Dynamic AI-SaaS Security as Copilots Scale",
    "link": "https://thehackernews.com/2025/12/the-case-for-dynamic-ai-saas-security.html",
    "date": "2025-12-18T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Within the past year, artificial intelligence copilots and agents have quietly permeated the SaaS applications businesses use every day. Tools like Zoom, Slack, Microsoft 365, Salesforce, and ServiceN..."
  },
  {
    "title": "Kimsuky Spreads DocSwap Android Malware via QR Phishing Posing as Delivery App",
    "link": "https://thehackernews.com/2025/12/kimsuky-spreads-docswap-android-malware.html",
    "date": "2025-12-18T07:43:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korean threat actor known as Kimsuky has been linked to a new campaign that distributes a new variant of Android malware called DocSwap via QR codes hosted on phishing sites mimicking Seoul-..."
  },
  {
    "title": "CISA Flags Critical ASUS Live Update Flaw After Evidence of Active Exploitation",
    "link": "https://thehackernews.com/2025/12/cisa-flags-critical-asus-live-update.html",
    "date": "2025-12-18T05:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a critical flaw impacting ASUS Live Update to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of ..."
  },
  {
    "title": "Cisco Warns of Active Attacks Exploiting Unpatched 0-Day in AsyncOS Email Security Appliances",
    "link": "https://thehackernews.com/2025/12/cisco-warns-of-active-attacks.html",
    "date": "2025-12-18T04:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has alerted users to a maximum-severity zero-day flaw in Cisco AsyncOS software that has been actively exploited by a China-nexus advanced persistent threat (APT) actor codenamed UAT-9686 in att..."
  },
  {
    "title": "Critical Fortinet Flaws Under Active Attack",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/critical-fortinet-flaws-under-active-attack",
    "date": "2025-12-17T22:44:38.000Z",
    "source": "Dark Reading",
    "summary": "Attackers are targeting admin accounts, and once authenticated, exporting device configurations including hashed credentials and other sensitive information...."
  },
  {
    "title": "In Cybersecurity, Claude Leaves Other LLMs in the Dust",
    "link": "https://www.darkreading.com/cybersecurity-analytics/cybersecurity-claude-llms",
    "date": "2025-12-17T22:01:58.000Z",
    "source": "Dark Reading",
    "summary": "Anthropic proves that LLMs can be fairly resistant to abuse. Most developers are either incapable of building safer tools, or unwilling to invest in doing so...."
  },
  {
    "title": "'Cellik' Android RAT Leverages Google Play Store",
    "link": "https://www.darkreading.com/threat-intelligence/cellik-android-rat-leverages-google-play-store",
    "date": "2025-12-17T21:38:50.000Z",
    "source": "Dark Reading",
    "summary": "The remote access Trojan lets an attacker remotely control a victim's phone and can generate malicious apps from inside the Play Store...."
  }
]