[
  {
    "title": "HPE OneView Flaw Rated CVSS 10.0 Allows Unauthenticated Remote Code Execution",
    "link": "https://thehackernews.com/2025/12/hpe-oneview-flaw-rated-cvss-100-allows.html",
    "date": "2025-12-18T14:39:00.000Z",
    "source": "The Hacker News",
    "summary": "Hewlett Packard Enterprise (HPE) has resolved a maximum-severity security flaw in OneView Software that, if successfully exploited, could result in remote code execution.\nThe critical vulnerability, a..."
  },
  {
    "title": "France arrests Latvian for installing malware on Italian ferry",
    "link": "https://www.bleepingcomputer.com/news/security/france-arrests-latvian-for-installing-malware-on-italian-ferry/",
    "date": "2025-12-18T13:47:59.000Z",
    "source": "Bleeping Computer",
    "summary": "French authorities arrested two crew members of an Italian passenger ferry suspected of infecting the ship with malware that could have enabled them to remotely control the vessel. [...]..."
  },
  {
    "title": "ThreatsDay Bulletin: WhatsApp Hijacks, MCP Leaks, AI Recon, React2Shell Exploit and 15 More Stories",
    "link": "https://thehackernews.com/2025/12/threatsday-bulletin-whatsapp-hijacks.html",
    "date": "2025-12-18T13:10:00.000Z",
    "source": "The Hacker News",
    "summary": "This week’s ThreatsDay Bulletin tracks how attackers keep reshaping old tools and finding new angles in familiar systems. Small changes in tactics are stacking up fast, and each one hints at where the..."
  },
  {
    "title": "North Korea-Linked Hackers Steal $2.02 Billion in 2025, Leading Global Crypto Theft",
    "link": "https://thehackernews.com/2025/12/north-korea-linked-hackers-steal-202.html",
    "date": "2025-12-18T13:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors with ties to the Democratic People's Republic of Korea (DPRK or North Korea) have been instrumental in driving a surge in global cryptocurrency theft in 2025, accounting for at least $2...."
  },
  {
    "title": "Dormant Iran APT is Still Alive, Spying on Dissidents",
    "link": "https://www.darkreading.com/threat-intelligence/iran-apt-spying-dissidents",
    "date": "2025-12-18T13:00:00.000Z",
    "source": "Dark Reading",
    "summary": "\"Prince of Persia\" has rewritten the rules of persistence with advanced operational security and cryptographic communication with its command-and-control server...."
  },
  {
    "title": "HPE warns of maximum severity RCE flaw in OneView software",
    "link": "https://www.bleepingcomputer.com/news/security/hpe-warns-of-maximum-severity-rce-flaw-in-oneview-software/",
    "date": "2025-12-18T11:35:53.000Z",
    "source": "Bleeping Computer",
    "summary": "Hewlett Packard Enterprise (HPE) has patched a maximum-severity vulnerability in its HPE OneView software that enables attackers to execute arbitrary code remotely. [...]..."
  },
  {
    "title": "The Case for Dynamic AI-SaaS Security as Copilots Scale",
    "link": "https://thehackernews.com/2025/12/the-case-for-dynamic-ai-saas-security.html",
    "date": "2025-12-18T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Within the past year, artificial intelligence copilots and agents have quietly permeated the SaaS applications businesses use every day. Tools like Zoom, Slack, Microsoft 365, Salesforce, and ServiceN..."
  },
  {
    "title": "Microsoft: Recent Windows updates break RemoteApp connections",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-recent-updates-break-azure-virtual-desktop-remoteapp-sessions/",
    "date": "2025-12-18T10:04:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed that recent Windows updates trigger RemoteApp connection failures on Windows 11 24H2/25H2 and Windows Server 2025 devices in Azure Virtual Desktop environments. [...]..."
  },
  {
    "title": "Kimsuky Spreads DocSwap Android Malware via QR Phishing Posing as Delivery App",
    "link": "https://thehackernews.com/2025/12/kimsuky-spreads-docswap-android-malware.html",
    "date": "2025-12-18T07:43:00.000Z",
    "source": "The Hacker News",
    "summary": "The North Korean threat actor known as Kimsuky has been linked to a new campaign that distributes a new variant of Android malware called DocSwap via QR codes hosted on phishing sites mimicking Seoul-..."
  },
  {
    "title": "CISA Flags Critical ASUS Live Update Flaw After Evidence of Active Exploitation",
    "link": "https://thehackernews.com/2025/12/cisa-flags-critical-asus-live-update.html",
    "date": "2025-12-18T05:01:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added a critical flaw impacting ASUS Live Update to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of ..."
  },
  {
    "title": "Cisco Warns of Active Attacks Exploiting Unpatched 0-Day in AsyncOS Email Security Appliances",
    "link": "https://thehackernews.com/2025/12/cisco-warns-of-active-attacks.html",
    "date": "2025-12-18T04:10:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has alerted users to a maximum-severity zero-day flaw in Cisco AsyncOS software that has been actively exploited by a China-nexus advanced persistent threat (APT) actor codenamed UAT-9686 in att..."
  },
  {
    "title": "Zeroday Cloud hacking event awards $320,0000 for 11 zero days",
    "link": "https://www.bleepingcomputer.com/news/security/zeroday-cloud-hacking-event-awards-320-0000-for-11-zero-days/",
    "date": "2025-12-17T23:09:36.000Z",
    "source": "Bleeping Computer",
    "summary": "The Zeroday Cloud hacking competition in London has awarded researchers $320,000 for demonstrating critical remote code execution vulnerabilities in components used in cloud infrastructure. [...]..."
  },
  {
    "title": "Critical Fortinet Flaws Under Active Attack",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/critical-fortinet-flaws-under-active-attack",
    "date": "2025-12-17T22:44:38.000Z",
    "source": "Dark Reading",
    "summary": "Attackers are targeting admin accounts, and once authenticated, exporting device configurations including hashed credentials and other sensitive information...."
  },
  {
    "title": "France arrests suspect tied to cyberattack on Interior Ministry",
    "link": "https://www.bleepingcomputer.com/news/security/france-arrests-suspect-tied-to-cyberattack-on-interior-ministry/",
    "date": "2025-12-17T22:20:02.000Z",
    "source": "Bleeping Computer",
    "summary": "French authorities arrested a 22-year-old suspect on Tuesday for a cyberattack that targeted France's Ministry of the Interior earlier this month. [...]..."
  },
  {
    "title": "In Cybersecurity, Claude Leaves Other LLMs in the Dust",
    "link": "https://www.darkreading.com/cybersecurity-analytics/cybersecurity-claude-llms",
    "date": "2025-12-17T22:01:58.000Z",
    "source": "Dark Reading",
    "summary": "Anthropic proves that LLMs can be fairly resistant to abuse. Most developers are either incapable of building safer tools, or unwilling to invest in doing so...."
  },
  {
    "title": "Amazon: Ongoing cryptomining campaign uses hacked AWS accounts",
    "link": "https://www.bleepingcomputer.com/news/security/amazon-ongoing-cryptomining-campaign-uses-hacked-aws-accounts/",
    "date": "2025-12-17T21:48:33.000Z",
    "source": "Bleeping Computer",
    "summary": "Amazon's AWS GuardDuty security team is warning of an ongoing crypto-mining campaign that targets its Elastic Compute Cloud (EC2) and Elastic Container Service (ECS) using compromised credentials for ..."
  },
  {
    "title": "'Cellik' Android RAT Leverages Google Play Store",
    "link": "https://www.darkreading.com/threat-intelligence/cellik-android-rat-leverages-google-play-store",
    "date": "2025-12-17T21:38:50.000Z",
    "source": "Dark Reading",
    "summary": "The remote access Trojan lets an attacker remotely control a victim's phone and can generate malicious apps from inside the Play Store...."
  },
  {
    "title": "Securing the Network Edge: A Comprehensive Framework for Modern Cybersecurity",
    "link": "https://www.darkreading.com/endpoint-security/securing-network-edge-comprehensive-framework-modern-cybersecurity",
    "date": "2025-12-17T21:14:12.000Z",
    "source": "Dark Reading",
    "summary": "The future of cybersecurity means defending everywhere. Securing IoT, cloud, and remote work requires a unified edge-to-cloud strategy. (First in a three-part series.)..."
  },
  {
    "title": "The Future of Quantum-Safe Networks Depends on Interoperable Standards",
    "link": "https://www.darkreading.com/endpoint-security/securing-future-building-quantum-safe-networks-today",
    "date": "2025-12-17T20:46:43.000Z",
    "source": "Dark Reading",
    "summary": "As quantum computing advances, secure, interoperable standards will be critical to making quantum key distribution (QKD) practical, trusted, and future-proof...."
  },
  {
    "title": "WhatsApp device linking abused in account hijacking attacks",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-device-linking-abused-in-account-hijacking-attacks/",
    "date": "2025-12-17T19:14:30.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are abusing the legitimate device-linking feature to hijack WhatsApp accounts via pairing codes in a campaign dubbed GhostPairing. [...]..."
  },
  {
    "title": "Cisco warns of unpatched AsyncOS zero-day exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-unpatched-asyncos-zero-day-exploited-in-attacks/",
    "date": "2025-12-17T18:45:36.000Z",
    "source": "Bleeping Computer",
    "summary": "​Cisco warned customers today of an unpatched, maximum-severity Cisco AsyncOS zero-day actively exploited in attacks targeting Secure Email Gateway (SEG) and Secure Email and Web Manager (SEWM) applia..."
  },
  {
    "title": "SonicWall Fixes Actively Exploited CVE-2025-40602 in SMA 100 Appliances",
    "link": "https://thehackernews.com/2025/12/sonicwall-fixes-actively-exploited-cve.html",
    "date": "2025-12-17T18:17:00.000Z",
    "source": "The Hacker News",
    "summary": "SonicWall has rolled out fixes to address a security flaw in Secure Mobile Access (SMA) 100 series appliances that it said has been actively exploited in the wild.\nThe vulnerability, tracked as CVE-20..."
  },
  {
    "title": "Kimwolf Botnet Hijacks 1.8 Million Android TVs, Launches Large-Scale DDoS Attacks",
    "link": "https://thehackernews.com/2025/12/kimwolf-botnet-hijacks-18-million.html",
    "date": "2025-12-17T18:09:00.000Z",
    "source": "The Hacker News",
    "summary": "A new distributed denial-of-service (DDoS) botnet known as Kimwolf has enlisted a massive army of no less than 1.8 million infected devices comprising Android-based TVs, set-top boxes, and tablets, an..."
  },
  {
    "title": "Sonicwall warns of new SMA1000 zero-day exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/sonicwall-warns-of-new-sma1000-zero-day-exploited-in-attacks/",
    "date": "2025-12-17T17:44:18.000Z",
    "source": "Bleeping Computer",
    "summary": "SonicWall warned customers today to patch a vulnerability in the SonicWall SMA1000 Appliance Management Console (AMC) that was chained in zero-day attacks to escalate privileges. [...]..."
  },
  {
    "title": "Attackers Use Stolen AWS Credentials in Cryptomining Campaign",
    "link": "https://www.darkreading.com/cloud-security/attackers-use-stolen-aws-credentials-cryptomining",
    "date": "2025-12-17T16:33:22.000Z",
    "source": "Dark Reading",
    "summary": "Threat actors wielding stolen AWS Identity and Access Management (IAM) credentials leverage Amazon EC and EC2 infrastructure across multiple customer environments...."
  },
  {
    "title": "Critical React2Shell flaw exploited in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/critical-react2shell-flaw-exploited-in-ransomware-attacks/",
    "date": "2025-12-17T16:09:51.000Z",
    "source": "Bleeping Computer",
    "summary": "A ransomware gang exploited the critical React2Shell vulnerability (CVE-2025-55182) to gain initial access to corporate networks and deployed the file-encrypting malware less than a minute later. [......"
  },
  {
    "title": "APT28 Targets Ukrainian UKR-net Users in Long-Running Credential Phishing Campaign",
    "link": "https://thehackernews.com/2025/12/apt28-targets-ukrainian-ukr-net-users.html",
    "date": "2025-12-17T15:30:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russian state-sponsored threat actor known as APT28 has been attributed to what has been described as a \"sustained\" credential-harvesting campaign targeting users of UKR[.]net, a webmail and news ..."
  },
  {
    "title": "&quot;Fake Proof&quot; and AI Slop Hobble Defenders",
    "link": "https://www.darkreading.com/application-security/fake-proof-ai-slop-hobble-defenders",
    "date": "2025-12-17T14:58:31.000Z",
    "source": "Dark Reading",
    "summary": "In the React2Shell saga, non-working and trivial proof-of-concept exploits led to confusion and perhaps a false sense of security. Can the onslaught of PoCs be tamed?..."
  },
  {
    "title": "New ForumTroll Phishing Attacks Target Russian Scholars Using Fake eLibrary Emails",
    "link": "https://thehackernews.com/2025/12/new-forumtroll-phishing-attacks-target.html",
    "date": "2025-12-17T14:54:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor linked to Operation ForumTroll has been attributed to a fresh set of phishing attacks targeting individuals within Russia, according to Kaspersky.\nThe Russian cybersecurity vendor sai..."
  },
  {
    "title": "Your MFA Is Costing You Millions. It Doesn't Have To.",
    "link": "https://www.bleepingcomputer.com/news/security/your-mfa-is-costing-you-millions-it-doesnt-have-to/",
    "date": "2025-12-17T14:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Passwords and app-based MFA add hidden costs through lost productivity, frequent resets, and risk of phishing and social engineering attacks. Token explains how wireless biometric, passwordless authen..."
  }
]