[
  {
    "title": "[Virtual Event] Strategic Security for the Modern Enterprise",
    "link": "https://www.darkreading.com/events/-virtual-event-strategic-security-for-the-modern-enterprise",
    "date": "2025-05-20T15:26:20.115Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "100+ Fake Chrome Extensions Found Hijacking Sessions, Stealing Credentials, Injecting Ads",
    "link": "https://thehackernews.com/2025/05/100-fake-chrome-extensions-found.html",
    "date": "2025-05-20T15:01:00.000Z",
    "source": "The Hacker News",
    "summary": "An unknown threat actor has been attributed to creating several malicious Chrome Browser extensions since February 2024 that masquerade as seemingly benign utilities but incorporate covert functionali..."
  },
  {
    "title": "'Hazy Hawk' Cybercrime Gang Swoops In for Cloud Resources",
    "link": "https://www.darkreading.com/cloud-security/hazy-hawk-cybercrime-gang-cloud-resources",
    "date": "2025-05-20T15:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Since December 2023, the threat group has preyed on domains belonging to the US Centers for Disease Control and Prevention (CDC) and numerous other reputable organizations worldwide to redirect users ..."
  },
  {
    "title": "RVTools hit in supply chain attack to deliver Bumblebee malware",
    "link": "https://www.bleepingcomputer.com/news/security/rvtools-hit-in-supply-chain-attack-to-deliver-bumblebee-malware/",
    "date": "2025-05-20T14:39:17.000Z",
    "source": "Bleeping Computer",
    "summary": "The official website for the RVTools VMware management tool was taken offline in what appears to be a supply chain attack that distributed a trojanized installer to drop the Bumblebee malware loader o..."
  },
  {
    "title": "Service desks are under attack: What can you do about it?",
    "link": "https://www.bleepingcomputer.com/news/security/service-desks-are-under-attack-what-can-you-do-about-it/",
    "date": "2025-05-20T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Service desks are on the front lines of defense—and attackers know it. Attackers are using social engineering attacks to trick agents into changing passwords, disabling MFA, and granting access. Learn..."
  },
  {
    "title": "Why Rigid Security Programs Keep Failing",
    "link": "https://www.darkreading.com/vulnerabilities-threats/rigid-security-programs-fail",
    "date": "2025-05-20T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Organizations that stay ahead of attacks won't be the most compliant ones — they'll be the ones most honest about what actually works...."
  },
  {
    "title": "Novel Phishing Attack Combines AES With Poisoned npm Packages",
    "link": "https://www.darkreading.com/threat-intelligence/novel-phishing-attack-combines-aes-npm-packages",
    "date": "2025-05-20T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Researchers discovered a phishing attack in the wild that takes multiple well-tread technologies like open source packages and AES encryption and combines them...."
  },
  {
    "title": "A security key for every employee? YubiKey-as-a-Service goes global",
    "link": "https://www.zdnet.com/article/a-security-key-for-every-employee-yubikey-as-a-service-goes-global/",
    "date": "2025-05-20T13:00:00.000Z",
    "source": "ZDNet Security",
    "summary": "Yubico's roaming authenticators can now be provisioned and delivered in 175 countries. Here's what the service offers...."
  },
  {
    "title": "AWS Default IAM Roles Found to Enable Lateral Movement and Cross-Service Exploitation",
    "link": "https://thehackernews.com/2025/05/aws-default-iam-roles-found-to-enable.html",
    "date": "2025-05-20T12:42:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered risky default identity and access management (IAM) roles impacting Amazon Web Services that could open the door for attackers to escalate privileges, manipula..."
  },
  {
    "title": "The Crowded Battle: Key Insights from the 2025 State of Pentesting Report",
    "link": "https://thehackernews.com/2025/05/the-crowded-battle-key-insights-from.html",
    "date": "2025-05-20T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "In the newly released 2025 State of Pentesting Report, Pentera surveyed 500 CISOs from global enterprises (200 from within the USA) to understand the strategies, tactics, and tools they use to cope wi..."
  },
  {
    "title": "South Asian Ministries Hit by SideWinder APT Using Old Office Flaws and Custom Malware",
    "link": "https://thehackernews.com/2025/05/south-asian-ministries-hit-by.html",
    "date": "2025-05-20T10:57:00.000Z",
    "source": "The Hacker News",
    "summary": "High-level government institutions in Sri Lanka, Bangladesh, and Pakistan have emerged as the target of a new campaign orchestrated by a threat actor known as SideWinder.\n\"The attackers used spear phi..."
  },
  {
    "title": "Chinese Hackers Deploy MarsSnake Backdoor in Multi-Year Attack on Saudi Organization",
    "link": "https://thehackernews.com/2025/05/chinese-hackers-deploy-marssnake.html",
    "date": "2025-05-20T09:32:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters have exposed the tactics of a China-aligned threat actor called UnsolicitedBooker that targeted an unnamed international organization in Saudi Arabia with a previously undocumented back..."
  },
  {
    "title": "Go-Based Malware Deploys XMRig Miner on Linux Hosts via Redis Configuration Abuse",
    "link": "https://thehackernews.com/2025/05/go-based-malware-deploys-xmrig-miner-on.html",
    "date": "2025-05-20T08:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a new Linux cryptojacking campaign that's targeting publicly accessible Redis servers.\nThe malicious activity has been codenamed RedisRaider by Datad..."
  },
  {
    "title": "Malicious PyPI Packages Exploit Instagram and TikTok APIs to Validate User Accounts",
    "link": "https://thehackernews.com/2025/05/malicious-pypi-packages-exploit.html",
    "date": "2025-05-20T05:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have uncovered malicious packages uploaded to the Python Package Index (PyPI) repository that act as checker tools to validate stolen email addresses against TikTok and Insta..."
  },
  {
    "title": "OpenAI plans to combine multiple models into GPT-5",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-plans-to-combine-multiple-models-into-gpt-5/",
    "date": "2025-05-19T22:11:51.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is planning to combine multiple products (features or models) into its next foundational model, which is called GPT-5. [...]..."
  },
  {
    "title": "'Operation RoundPress' Targets Ukraine in XSS Webmail Attacks",
    "link": "https://www.darkreading.com/threat-intelligence/operation-roundpress-ukraine-xss-webmail-attacks",
    "date": "2025-05-19T21:20:04.000Z",
    "source": "Dark Reading",
    "summary": "A cyber-espionage campaign is targeting Ukrainian government entities with a series of sophisticated spear-phishing attacks that exploit XSS vulnerabilities...."
  },
  {
    "title": "Fake KeePass password manager leads to ESXi ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/fake-keepass-password-manager-leads-to-esxi-ransomware-attack/",
    "date": "2025-05-19T21:17:33.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors have been distributing trojanized versions of the KeePass password manager for at least eight months to install Cobalt Strike beacons, steal credentials, and ultimately, deploy ransomwar..."
  },
  {
    "title": "O2 UK patches bug leaking mobile user location from call metadata",
    "link": "https://www.bleepingcomputer.com/news/security/o2-uk-patches-bug-leaking-mobile-user-location-from-call-metadata/",
    "date": "2025-05-19T19:20:04.000Z",
    "source": "Bleeping Computer",
    "summary": "A flaw in O2 UK's implementation of VoLTE and WiFi Calling technologies could allow anyone to expose the general location of a person and other identifiers by calling the target. [...]..."
  },
  {
    "title": "A drug developer is buying 23andMe - what does that mean for your DNA data?",
    "link": "https://www.zdnet.com/article/a-drug-developer-is-buying-23andme-what-does-that-mean-for-your-dna-data/",
    "date": "2025-05-19T19:20:00.000Z",
    "source": "ZDNet Security",
    "summary": "The top bidder in the DNA testing firm's bankruptcy auction, Regeneron vows to prioritize the privacy, security, and ethical use of customer data...."
  },
  {
    "title": "S. Dakota CIO Gottumukkala Signs on as CISA Deputy Director",
    "link": "https://www.darkreading.com/threat-intelligence/gottumukkala-cisa-deputy-director",
    "date": "2025-05-19T19:13:39.000Z",
    "source": "Dark Reading",
    "summary": "The addition is an important hire for the No. 2 position at the cyber agency. The main director role remains unfilled post-Easterly, with Bridget Bean taking over acting duties for now...."
  },
  {
    "title": "Legal Aid Agency Warns Lawyers, Defendants on Data Breach",
    "link": "https://www.darkreading.com/remote-workforce/legal-aid-agency-data-breach",
    "date": "2025-05-19T18:38:52.000Z",
    "source": "Dark Reading",
    "summary": "The online service has since been shut down as the agency grapples with the cyberattack, though it assures the public that those most in need of legal assistance will still be able to access help...."
  },
  {
    "title": "Windows 10 emergency updates fix BitLocker recovery issues",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-emergency-updates-fix-bitlocker-recovery-issues/",
    "date": "2025-05-19T17:59:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released out-of-band updates to fix a known issue causing Windows 10 systems to boot into BitLocker recovery after installing the May 2025 security updates. [...]..."
  },
  {
    "title": "Arla Foods confirms cyberattack disrupts production, causes delays",
    "link": "https://www.bleepingcomputer.com/news/security/arla-foods-confirms-cyberattack-disrupts-production-causes-delays/",
    "date": "2025-05-19T17:53:27.000Z",
    "source": "Bleeping Computer",
    "summary": "Arla Foods has confirmed to BleepingComputer that it was targeted by a cyberattack that has disrupted its production operations. [...]..."
  },
  {
    "title": "Microsoft unveils Windows AI Foundry for AI-powered PC apps",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-windows-ai-foundry-for-ai-powered-pc-apps/",
    "date": "2025-05-19T16:18:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is replacing 'Copilot Runtime' with Windows AI Foundry to help developers build, experiment, and reach users with AI experiences in their apps. [...]..."
  },
  {
    "title": "Microsoft confirms new \"Advanced\" Settings for Windows 11",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-new-advanced-settings-for-windows-11/",
    "date": "2025-05-19T16:06:46.000Z",
    "source": "Bleeping Computer",
    "summary": "At the Build 2025 developer conference, Microsoft announced a new 'Advanced Settings' feature to help users and developers personalize the OS experience. [...]..."
  },
  {
    "title": "Microsoft goes all in on Anthropic's MCP standard for safer AI agent deployments",
    "link": "https://www.zdnet.com/article/microsoft-goes-all-in-on-anthropics-mcp-standard-for-safer-ai-agent-deployments/",
    "date": "2025-05-19T16:00:25.000Z",
    "source": "ZDNet Security",
    "summary": "Microsoft anounced support for the AI data connection standard across its platform at Build 2025...."
  },
  {
    "title": "Microsoft open-sources Windows Subsystem for Linux at Build 2025",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-open-sources-windows-subsystem-for-linux-at-build-2025/",
    "date": "2025-05-19T16:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has open-sourced the Windows Subsystem for Linux (WSL), making its source code available on GitHub, except for a few components that are part of Windows. [...]..."
  },
  {
    "title": "RVTools Official Site Hacked to Deliver Bumblebee Malware via Trojanized Installer",
    "link": "https://thehackernews.com/2025/05/rvtools-official-site-hacked-to-deliver.html",
    "date": "2025-05-19T15:48:00.000Z",
    "source": "The Hacker News",
    "summary": "The official site for RVTools has been hacked to serve a compromised installer for the popular VMware environment reporting utility.\n\"Robware.net and RVTools.com are currently offline. We are working ..."
  },
  {
    "title": "UK Legal Aid Agency confirms applicant data stolen in data breach",
    "link": "https://www.bleepingcomputer.com/news/security/uk-legal-aid-agency-confirms-applicant-data-stolen-in-data-breach/",
    "date": "2025-05-19T15:10:44.000Z",
    "source": "Bleeping Computer",
    "summary": "The United Kingdom's Legal Aid Agency (LAA) has confirmed that a recent cyberattack is more serious than first believed, with hackers stealing a large trove of sensitive applicant data in a data breac..."
  },
  {
    "title": "Ransomware Gangs Use Skitnet Malware for Stealthy Data Theft and Remote Access",
    "link": "https://thehackernews.com/2025/05/ransomware-gangs-use-skitnet-malware.html",
    "date": "2025-05-19T14:38:00.000Z",
    "source": "The Hacker News",
    "summary": "Several ransomware actors are using a malware called Skitnet as part of their post-exploitation efforts to steal sensitive data and establish remote control over compromised hosts.\n\"Skitnet has been s..."
  }
]