[
  {
    "title": "Secure Your Spot at RSAC 2026 Conference",
    "link": "https://www.darkreading.com/events/rsac-2026-conference",
    "date": "2026-01-20T15:36:27.123Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Make Identity Threat Detection your security strategy for 2026",
    "link": "https://www.bleepingcomputer.com/news/security/make-identity-threat-detection-your-security-strategy-for-2026/",
    "date": "2026-01-20T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Identity-based attacks are one of the primary paths attackers use to breach corporate networks. Tenfold shows how Identity Threat Detection helps spot suspicious account activity before real damage oc..."
  },
  {
    "title": "Three Flaws in Anthropic MCP Git Server Enable File Access and Code Execution",
    "link": "https://thehackernews.com/2026/01/three-flaws-in-anthropic-mcp-git-server.html",
    "date": "2026-01-20T13:55:00.000Z",
    "source": "The Hacker News",
    "summary": "A set of three security vulnerabilities has been disclosed in mcp-server-git, the official Git Model Context Protocol (MCP) server maintained by Anthropic, that could be exploited to read or delete ar..."
  },
  {
    "title": "Hackers Use LinkedIn Messages to Spread RAT Malware Through DLL Sideloading",
    "link": "https://thehackernews.com/2026/01/hackers-use-linkedin-messages-to-spread.html",
    "date": "2026-01-20T13:46:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have uncovered a new phishing campaign that exploits social media private messages to propagate malicious payloads, likely with the intent to deploy a remote access trojan (R..."
  },
  {
    "title": "Webinar: Aligning cybersecurity purchases with what your SOC team needs",
    "link": "https://www.bleepingcomputer.com/news/security/webinar-aligning-cybersecurity-purchases-with-what-your-soc-team-needs/",
    "date": "2026-01-20T13:15:23.000Z",
    "source": "Bleeping Computer",
    "summary": "Learn how security leaders and SOC teams can work together to close the gap between platform decisions and operational needs. Join Sumo Logic and BleepingComputer on January 29 for a practical webinar..."
  },
  {
    "title": "The Hidden Risk of Orphan Accounts",
    "link": "https://thehackernews.com/2026/01/the-hidden-risk-of-orphan-accounts.html",
    "date": "2026-01-20T11:58:00.000Z",
    "source": "The Hacker News",
    "summary": "The Problem: The Identities Left Behind\nAs organizations grow and evolve, employees, contractors, services, and systems come and go - but their accounts often remain. These abandoned or “orphan” accou..."
  },
  {
    "title": "Evelyn Stealer Malware Abuses VS Code Extensions to Steal Developer Credentials and Crypto",
    "link": "https://thehackernews.com/2026/01/evelyn-stealer-malware-abuses-vs-code.html",
    "date": "2026-01-20T11:48:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a malware campaign that's targeting software developers with a new information stealer called Evelyn Stealer by weaponizing the Microsoft Visual Stu..."
  },
  {
    "title": "Cloudflare Fixes ACME Validation Bug Allowing WAF Bypass to Origin Servers",
    "link": "https://thehackernews.com/2026/01/cloudflare-fixes-acme-validation-bug.html",
    "date": "2026-01-20T11:12:00.000Z",
    "source": "The Hacker News",
    "summary": "Cloudflare has addressed a security vulnerability impacting its Automatic Certificate Management Environment (ACME) validation logic that made it possible to bypass security controls and access origin..."
  },
  {
    "title": "Why Secrets in JavaScript Bundles are Still Being Missed",
    "link": "https://thehackernews.com/2026/01/why-secrets-in-javascript-bundles-are.html",
    "date": "2026-01-20T10:45:00.000Z",
    "source": "The Hacker News",
    "summary": "Leaked API keys are no longer unusual, nor are the breaches that follow. So why are sensitive tokens still being so easily exposed?\nTo find out, Intruder’s research team looked at what traditional vul..."
  },
  {
    "title": "Tudou Guarantee Marketplace Halts Telegram Transactions After Processing Over $12 Billion",
    "link": "https://thehackernews.com/2026/01/tudou-guarantee-marketplace-halts.html",
    "date": "2026-01-20T07:40:00.000Z",
    "source": "The Hacker News",
    "summary": "A Telegram-based guarantee marketplace known for advertising a broad range of illicit services appears to be winding down its operations, according to new findings from Elliptic.\nThe blockchain intell..."
  },
  {
    "title": "ChatGPT Go now unlocks unlimited access to GPT-5.2 Instant for $8",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-go-now-unlocks-unlimited-access-to-gpt-52-instant-for-8/",
    "date": "2026-01-20T01:24:25.000Z",
    "source": "Bleeping Computer",
    "summary": "ChatGPT Go is finally worth your money, as OpenAI has almost doubled the usage limits and enabled ultimate access to GPT 5.2 Instant. [...]..."
  },
  {
    "title": "You can get ChatGPT's $20 Plus subscription for free for a limited time",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/you-can-get-chatgpts-20-plus-subscription-for-free-for-a-limited-time/",
    "date": "2026-01-20T01:07:57.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is offering ChatGPT Plus, which costs $20 in the United States, for free, but the offer is valid for some accounts only, and it's a limited-time deal. [...]..."
  },
  {
    "title": "Fake ad blocker extension crashes the browser for ClickFix attacks",
    "link": "https://www.bleepingcomputer.com/news/security/fake-ad-blocker-extension-crashes-the-browser-for-clickfix-attacks/",
    "date": "2026-01-19T22:49:46.000Z",
    "source": "Bleeping Computer",
    "summary": "A malvertising campaign is using a fake ad-blocking Chrome and Edge extension named NexShield that intentionally crashes the browser in preparation for ClickFix attacks. [...]..."
  },
  {
    "title": "New PDFSider Windows malware deployed on Fortune 100 firm's network",
    "link": "https://www.bleepingcomputer.com/news/security/new-pdfsider-windows-malware-deployed-on-fortune-100-firms-network/",
    "date": "2026-01-19T21:00:34.000Z",
    "source": "Bleeping Computer",
    "summary": "Ransomware attackers targeting a Fortune 100 company in the finance sector used a new malware strain, dubbed PDFSider, to deliver malicious payloads on Windows systems. [...]..."
  },
  {
    "title": "ChatGPT Health Raises Big Security, Safety Concerns",
    "link": "https://www.darkreading.com/remote-workforce/chatgpt-health-security-safety-concerns",
    "date": "2026-01-19T17:57:52.000Z",
    "source": "Dark Reading",
    "summary": "ChatGPT Health promises robust data protection, but elements of the rollout raise big questions regarding user security and safety...."
  },
  {
    "title": "Google Gemini Prompt Injection Flaw Exposed Private Calendar Data via Malicious Invites",
    "link": "https://thehackernews.com/2026/01/google-gemini-prompt-injection-flaw.html",
    "date": "2026-01-19T17:21:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a security flaw that leverages indirect prompt injection targeting Google Gemini as a way to bypass authorization guardrails and use Google Calendar..."
  },
  {
    "title": "UK govt. warns about ongoing Russian hacktivist group attacks",
    "link": "https://www.bleepingcomputer.com/news/security/uk-govt-warns-about-ongoing-russian-hacktivist-group-attacks/",
    "date": "2026-01-19T17:20:39.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.K. government is warning of continued malicious activity from Russian-aligned hacktivist groups targeting critical infrastructure and local government organizations in the country in disruptive ..."
  },
  {
    "title": "Hacker admits to leaking stolen Supreme Court data on Instagram",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-admits-to-leaking-stolen-supreme-court-data-on-instagram/",
    "date": "2026-01-19T16:04:14.000Z",
    "source": "Bleeping Computer",
    "summary": "A Tennessee man has pleaded guilty to hacking the U.S. Supreme Court's electronic filing system and breaching accounts at the AmeriCorps U.S. federal agency and the Department of Veterans Affairs. [....."
  },
  {
    "title": "Jordanian pleads guilty to selling access to 50 corporate networks",
    "link": "https://www.bleepingcomputer.com/news/security/jordanian-pleads-guilty-to-selling-access-to-50-corporate-networks/",
    "date": "2026-01-19T14:38:32.000Z",
    "source": "Bleeping Computer",
    "summary": "A Jordanian man has pleaded guilty to operating as an \"access broker\" who sold access to the computer networks of at least 50 companies. [...]..."
  },
  {
    "title": "Ingram Micro says ransomware attack affected 42,000 people",
    "link": "https://www.bleepingcomputer.com/news/security/ingram-micro-says-ransomware-attack-affected-42-000-people/",
    "date": "2026-01-19T13:33:45.000Z",
    "source": "Bleeping Computer",
    "summary": "​Information technology giant Ingram Micro has revealed that a ransomware attack on its systems in July 2025 led to a data breach affecting over 42,000 individuals. [...]..."
  },
  {
    "title": "⚡ Weekly Recap: Fortinet Exploits, RedLine Clipjack, NTLM Crack, Copilot Attack & More",
    "link": "https://thehackernews.com/2026/01/weekly-recap-fortinet-exploits-redline.html",
    "date": "2026-01-19T13:17:00.000Z",
    "source": "The Hacker News",
    "summary": "In cybersecurity, the line between a normal update and a serious incident keeps getting thinner. Systems that once felt reliable are now under pressure from constant change. New AI tools, connected de..."
  },
  {
    "title": "DevOps & SaaS Downtime: The High (and Hidden) Costs for Cloud-First Businesses",
    "link": "https://thehackernews.com/2026/01/high-costs-of-devops-saas-downtime.html",
    "date": "2026-01-19T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Just a few years ago, the cloud was touted as the “magic pill” for any cyber threat or performance issue. Many were lured by the “always-on” dream, trading granular control for the convenience of mana..."
  },
  {
    "title": "New StackWarp Hardware Flaw Breaks AMD SEV-SNP Protections on Zen 1–5 CPUs",
    "link": "https://thehackernews.com/2026/01/new-stackwarp-hardware-flaw-breaks-amd.html",
    "date": "2026-01-19T11:31:00.000Z",
    "source": "The Hacker News",
    "summary": "A team of academics from the CISPA Helmholtz Center for Information Security in Germany has disclosed the details of a new hardware vulnerability affecting AMD processors.\nThe security flaw, codenamed..."
  },
  {
    "title": "CrashFix Chrome Extension Delivers ModeloRAT Using ClickFix-Style Browser Crash Lures",
    "link": "https://thehackernews.com/2026/01/crashfix-chrome-extension-delivers.html",
    "date": "2026-01-19T09:09:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of an ongoing campaign dubbed KongTuke that used a malicious Google Chrome extension masquerading as an ad blocker to deliberately crash the web browse..."
  },
  {
    "title": "Security Bug in StealC Malware Panel Let Researchers Spy on Threat Actor Operations",
    "link": "https://thehackernews.com/2026/01/security-bug-in-stealc-malware-panel.html",
    "date": "2026-01-19T06:53:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a cross-site scripting (XSS) vulnerability in the web-based control panel used by operators of the StealC information stealer, allowing them to gather crucial ..."
  },
  {
    "title": "OpenAI hostname hints at a new ChatGPT feature codenamed \"Sonata\"",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-hostname-hints-at-a-new-chatgpt-feature-codenamed-sonata/",
    "date": "2026-01-19T01:47:00.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is reportedly testing a new feature or product codenamed \"Sonata,\" and it could be related to music or audio-related experiences on ChatGPT. [...]..."
  },
  {
    "title": "New OpenAI leak hints at upcoming ChatGPT features",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/new-openai-leak-hints-at-upcoming-chatgpt-features/",
    "date": "2026-01-19T00:29:05.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is internally testing a new update for ChatGPT, at least on the web. It'll begin rolling out in the coming weeks. [...]..."
  },
  {
    "title": "Microsoft releases OOB Windows updates to fix shutdown, Cloud PC bugs",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-oob-windows-updates-to-fix-shutdown-cloud-pc-bugs/",
    "date": "2026-01-18T18:16:27.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released multiple emergency, out-of-band updates for Windows 10, Windows 11, and Windows Server to fix two issues caused by the January Patch Tuesday updates. [...]..."
  },
  {
    "title": "CIRO confirms data breach exposed info on 750,000 Canadian investors",
    "link": "https://www.bleepingcomputer.com/news/security/ciro-data-breach-last-year-exposed-info-on-750-000-canadian-investors/",
    "date": "2026-01-18T15:17:45.000Z",
    "source": "Bleeping Computer",
    "summary": "The Canadian Investment Regulatory Organization (CIRO) confirmed that the data breach it suffered last year impacts about 750,000 Canadian investors. [...]..."
  },
  {
    "title": "Google Chrome tests Gemini-powered AI \"Skills\"",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-chrome-tests-gemini-powered-ai-skills/",
    "date": "2026-01-18T03:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google is testing \"Skills\" for Gemini in Chrome, which will allow AI in Chrome to perform tasks automatically, and it could challenge Perplexity Comet or Edge's Copilot mode. [...]..."
  }
]