[
  {
    "title": "'IntelBroker' Suspect Arrested, Charged in High-Profile Breaches",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/intebroker-suspect-arrested-charged-breaches",
    "date": "2025-06-26T20:59:04.000Z",
    "source": "Dark Reading",
    "summary": "A British national arrested earlier this year in France was charged by the US Department of Justice in connection with a string of major cyberattacks...."
  },
  {
    "title": "FTC approves $126 million in Fortnite refunds over ‘dark patterns’",
    "link": "https://www.bleepingcomputer.com/news/legal/ftc-approves-126-million-in-fortnite-refunds-over-dark-patterns/",
    "date": "2025-06-26T20:27:08.000Z",
    "source": "Bleeping Computer",
    "summary": "The Federal Trade Commission (FTC) has approved $126,000,000 in refunds to be sent to 969,173 Fortnite players as part of a settlement over allegations that Epic Games tricked users into making unwant..."
  },
  {
    "title": "Brother printer bug in 689 models exposes default admin passwords",
    "link": "https://www.bleepingcomputer.com/news/security/brother-printer-bug-in-689-models-exposes-default-admin-passwords/",
    "date": "2025-06-26T18:10:25.000Z",
    "source": "Bleeping Computer",
    "summary": "A total of 689 printer models from Brother, along with 53 other models from Fujifilm, Toshiba, and Konica Minolta, come with a default administrator password that remote attackers can generate. Even w..."
  },
  {
    "title": "Critical Open VSX Registry Flaw Exposes Millions of Developers to Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/06/critical-open-vsx-registry-flaw-exposes.html",
    "date": "2025-06-26T16:46:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed a critical vulnerability in the Open VSX Registry (\"open-vsx[.]org\") that, if successfully exploited, could have enabled attackers to take control of the entir..."
  },
  {
    "title": "Ex-student charged over hacking university for cheap parking, data breaches",
    "link": "https://www.bleepingcomputer.com/news/security/ex-student-charged-over-hacking-university-for-cheap-parking-data-breaches/",
    "date": "2025-06-26T16:24:59.000Z",
    "source": "Bleeping Computer",
    "summary": "New South Wales police in Australia have arrested a 27-year-old former Western Sydney University (WSU) student for allegedly hacking into the University's systems on multiple occasions, starting with ..."
  },
  {
    "title": "Microsoft rolls out Windows security changes to prevent another CrowdStrike meltdown",
    "link": "https://www.zdnet.com/article/microsoft-rolls-out-windows-security-changes-to-prevent-another-crowdstrike-meltdown/",
    "date": "2025-06-26T16:03:00.000Z",
    "source": "ZDNet Security",
    "summary": "It's been almost a year since CrowdStrike crashed Windows PCs and disrupted businesses worldwide. New changes to the Windows security architecture will make those outages less likely and easier to rec..."
  },
  {
    "title": "Cisco warns of max severity RCE flaws in Identity Services Engine",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-max-severity-rce-flaws-in-identity-services-engine/",
    "date": "2025-06-26T15:20:56.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco has published a bulletin to warn about two critical, unauthenticated remote code execution (RCE) vulnerabilities affecting Cisco Identity Services Engine (ISE) and the Passive Identity Connector..."
  },
  {
    "title": "Man pleads guilty to hacking networks to pitch security services",
    "link": "https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-networks-to-pitch-security-services/",
    "date": "2025-06-26T14:03:40.000Z",
    "source": "Bleeping Computer",
    "summary": "A Kansas City man has pleaded guilty to hacking multiple organizations to advertise his cybersecurity services, the U.S. Department of Justice announced on Wednesday. [...]..."
  },
  {
    "title": "3 key takeaways from the Scattered Spider attacks on insurance firms",
    "link": "https://www.bleepingcomputer.com/news/security/3-key-takeaways-from-the-scattered-spider-attacks-on-insurance-firms/",
    "date": "2025-06-26T14:02:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Scattered Spider recently pivoted from targeting worldwide retailers to U.S. based insurance firms, with no signs of slowing down. Learn about Scattered Spider TTPs and how to defend your organization..."
  },
  {
    "title": "How Geopolitical Tensions Are Shaping Cyber Warfare",
    "link": "https://www.darkreading.com/vulnerabilities-threats/geopolitical-tensions-shape-cyber-warfare",
    "date": "2025-06-26T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "In today's cyber battlefield, resilience starts with readiness, and the cost of falling short increases by the day...."
  },
  {
    "title": "The $177 million AT&T data breach settlement could mean a payout for you - how to qualify",
    "link": "https://www.zdnet.com/article/the-177-million-at-t-data-breach-settlement-could-mean-a-payout-for-you-how-to-qualify/",
    "date": "2025-06-26T13:48:00.000Z",
    "source": "ZDNet Security",
    "summary": "The wireless carrier is offering compensation to users who had their personal information leaked and sold to the dark web...."
  },
  {
    "title": "Critical RCE Flaws in Cisco ISE and ISE-PIC Allow Unauthenticated Attackers to Gain Root Access",
    "link": "https://thehackernews.com/2025/06/critical-rce-flaws-in-cisco-ise-and-ise.html",
    "date": "2025-06-26T13:24:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has released updates to address two maximum-severity security flaws in Identity Services Engine (ISE) and ISE Passive Identity Connector (ISE-PIC) that could permit an unauthenticated attacker t..."
  },
  {
    "title": "New FileFix Method Emerges as a Threat Following 517% Rise in ClickFix Attacks",
    "link": "https://thehackernews.com/2025/06/new-filefix-method-emerges-as-threat.html",
    "date": "2025-06-26T13:03:00.000Z",
    "source": "The Hacker News",
    "summary": "The ClickFix social engineering tactic as an initial access vector using fake CAPTCHA verifications increased by 517% between the second half of 2024 and the first half of this year, according to data..."
  },
  {
    "title": "Microsoft 365 'Direct Send' abused to send phishing as internal users",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-365-direct-send-abused-to-send-phishing-as-internal-users/",
    "date": "2025-06-26T13:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "An ongoing phishing campaign abuses a little‑known feature in Microsoft 365 called \"Direct Send\" to evade detection by email security and steal credentials. [...]..."
  },
  {
    "title": "The Hidden Risks of SaaS: Why Built-In Protections Aren't Enough for Modern Data Resilience",
    "link": "https://thehackernews.com/2025/06/the-hidden-risks-of-saas-why-built-in.html",
    "date": "2025-06-26T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "SaaS Adoption is Skyrocketing, Resilience Hasn’t Kept Pace\nSaaS platforms have revolutionized how businesses operate. They simplify collaboration, accelerate deployment, and reduce the overhead of man..."
  },
  {
    "title": "Microsoft fixes Outlook bug causing crashes when opening emails",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-outlook-bug-causing-crashes-when-opening-emails/",
    "date": "2025-06-26T10:26:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has fixed a known issue that will cause the classic Outlook email client to crash when opening emails or starting a new message. [...]..."
  },
  {
    "title": "You should probably delete any sensitive screenshots you have in your phone right now. Here's why",
    "link": "https://www.zdnet.com/article/you-should-probably-delete-any-sensitive-screenshots-you-have-in-your-phone-right-now-heres-why/",
    "date": "2025-06-26T10:00:18.000Z",
    "source": "ZDNet Security",
    "summary": "A new Trojan malware is targeting sensitive information, including crypto wallet seed phrases...."
  },
  {
    "title": "Microsoft confirms Family Safety blocks Google Chrome from launching",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-confirms-family-safety-blocks-google-chrome-from-launching/",
    "date": "2025-06-26T09:50:18.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed that its Family Safety parental control service is blocking users from launching Google Chrome and other web browsers on Windows systems. [...]..."
  },
  {
    "title": "Iranian APT35 Hackers Targeting Israeli Tech Experts with AI-Powered Phishing Attacks",
    "link": "https://thehackernews.com/2025/06/iranian-apt35-hackers-targeting-israeli.html",
    "date": "2025-06-26T08:45:00.000Z",
    "source": "The Hacker News",
    "summary": "An Iranian state-sponsored hacking group associated with the Islamic Revolutionary Guard Corps (IRGC) has been linked to a spear-phishing campaign targeting journalists, high-profile cyber security ex..."
  },
  {
    "title": "CISA: AMI MegaRAC bug enabling server hijacks exploited in attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-ami-megarac-bug-that-lets-hackers-brick-servers-now-actively-exploited/",
    "date": "2025-06-26T08:38:05.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA says a maximum severity vulnerability in AMI's MegaRAC Baseboard Management Controller (BMC) software, which enables attackers to hijack and brick servers, is currently under active exploitation...."
  },
  {
    "title": "Cyber Criminals Exploit Open-Source Tools to Compromise Financial Institutions Across Africa",
    "link": "https://thehackernews.com/2025/06/cyber-criminals-exploit-open-source.html",
    "date": "2025-06-26T07:19:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a series of cyber attacks targeting financial organizations across Africa since at least July 2023 using a mix of open-source and publicly available ..."
  },
  {
    "title": "CISA Adds 3 Flaws to KEV Catalog, Impacting AMI MegaRAC, D-Link, Fortinet",
    "link": "https://thehackernews.com/2025/06/cisa-adds-3-flaws-to-kev-catalog.html",
    "date": "2025-06-26T06:02:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday added three security flaws, each impacting AMI MegaRAC, D-Link DIR-859 router, and Fortinet FortiOS, to its Known Exploite..."
  },
  {
    "title": "Charming Kitten APT Tries Spying on Israeli Cybersecurity Experts",
    "link": "https://www.darkreading.com/threat-intelligence/iran-apt-spying-israeli-cybersecurity-experts",
    "date": "2025-06-26T06:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Israel's cyber pros are having to put theory into practice, as a notorious nation-state APT sponsored by Iran targets them with spear-phishing attacks...."
  },
  {
    "title": "WhatsApp Adds AI-Powered Message Summaries for Faster Chat Previews",
    "link": "https://thehackernews.com/2025/06/whatsapp-adds-ai-powered-message.html",
    "date": "2025-06-26T04:36:00.000Z",
    "source": "The Hacker News",
    "summary": "Popular messaging platform WhatsApp has added a new artificial intelligence (AI)-powered feature that leverages its in-house solution Meta AI to summarize unread messages in chats.\nThe feature, called..."
  },
  {
    "title": "Hacker 'IntelBroker' charged in US for global data theft breaches",
    "link": "https://www.bleepingcomputer.com/news/security/british-hacker-intelbroker-charged-with-25m-in-cybercrime-damages/",
    "date": "2025-06-25T23:54:22.000Z",
    "source": "Bleeping Computer",
    "summary": "A British national known online as \"IntelBroker\" has been charged by the U.S. for stealing and selling sensitive data from dozens of victims, causing an estimated $25 million in damages. [...]..."
  },
  {
    "title": "Cloud Repatriation Driven by AI, Cost, and Security",
    "link": "https://www.darkreading.com/cloud-security/cloud-repatriation-ai-cost-security",
    "date": "2025-06-25T22:36:53.000Z",
    "source": "Dark Reading",
    "summary": "Organizations are moving away from the public cloud and embracing a more hybrid approach due to big changes over the past five years...."
  },
  {
    "title": "Hackers turn ScreenConnect into malware using Authenticode stuffing",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-turn-screenconnect-into-malware-using-authenticode-stuffing/",
    "date": "2025-06-25T21:51:46.000Z",
    "source": "Bleeping Computer",
    "summary": "Threat actors are abusing the ConnectWise ScreenConnect installer to build signed remote access malware by modifying hidden settings within the client's  Authenticode signature. [...]..."
  },
  {
    "title": "And Now Malware That Tells AI to Ignore It?",
    "link": "https://www.darkreading.com/cloud-security/malware-tells-ai-to-ignore-it",
    "date": "2025-06-25T21:26:17.000Z",
    "source": "Dark Reading",
    "summary": "Though rudimentary and largely non-functional, the wryly named \"Skynet\" binary could be a harbinger of things to come on the malware front...."
  },
  {
    "title": "Hackers abuse Microsoft ClickOnce and AWS services for stealthy attacks",
    "link": "https://www.bleepingcomputer.com/news/security/oneclik-attacks-use-microsoft-clickonce-and-aws-to-target-energy-sector/",
    "date": "2025-06-25T20:34:38.000Z",
    "source": "Bleeping Computer",
    "summary": "A sophisticated malicious campaign that researchers call OneClik has been leveraging Microsoft's ClickOnce software deployment tool and custom Golang backdoors to compromise organizations within the e..."
  },
  {
    "title": "Taming Agentic AI Risks Requires Securing Non-Human Identities",
    "link": "https://www.darkreading.com/cybersecurity-operations/taming-agentic-ai-risks-securing-nhi",
    "date": "2025-06-25T19:02:51.000Z",
    "source": "Dark Reading",
    "summary": "As the definition of machine identities broadens, AI agents working on behalf of users and gaining access to various services blurs the lines of non-human identities even more...."
  }
]