[
  {
    "title": "Russian Hackers Weaponize Microsoft Office Bug in Just 3 Days",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/russian-hackers-weaponize-office-bug-within-days",
    "date": "2026-02-03T21:52:22.000Z",
    "source": "Dark Reading",
    "summary": "APT28's attacks rely on specially crafted Microsoft Rich Text Format (RTF) documents to kick off a multistage infection chain to deliver malicious payloads...."
  },
  {
    "title": "GlassWorm Malware Returns to Shatter Developer Ecosystems",
    "link": "https://www.darkreading.com/application-security/glassworm-malware-developer-ecosystems",
    "date": "2026-02-03T20:55:51.000Z",
    "source": "Dark Reading",
    "summary": "The self-replicating malware has poisoned a fresh set of Open VSX software components, leaving potential downstream victims with infostealer infections...."
  },
  {
    "title": "Docker Fixes Critical Ask Gordon AI Flaw Allowing Code Execution via Image Metadata",
    "link": "https://thehackernews.com/2026/02/docker-fixes-critical-ask-gordon-ai.html",
    "date": "2026-02-03T16:41:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a now-patched security flaw impacting Ask Gordon, an artificial intelligence (AI) assistant built into Docker Desktop and the Docker Command-Line In..."
  },
  {
    "title": "8-Minute Access: AI Accelerates Breach of AWS Environment",
    "link": "https://www.darkreading.com/cloud-security/8-minute-access-ai-aws-environment-breach",
    "date": "2026-02-03T16:38:11.000Z",
    "source": "Dark Reading",
    "summary": "The AI-assisted attack, which started with exposed credentials from public S3 buckets, rapidly achieved administrative privilges...."
  },
  {
    "title": "Dark Patterns Undermine Security, One Click at a Time",
    "link": "https://www.darkreading.com/cyber-risk/dark-patterns-undermine-security-one-click-at-a-time",
    "date": "2026-02-03T16:30:41.000Z",
    "source": "Dark Reading",
    "summary": "People trust organizations to do the right thing, but some websites and apps have user interfaces that ultimately lead to inadequate security for users...."
  },
  {
    "title": "[Webinar] The Smarter SOC Blueprint: Learn What to Build, Buy, and Automate",
    "link": "https://thehackernews.com/2026/02/webinar-smarter-soc-blueprint-learn.html",
    "date": "2026-02-03T14:14:00.000Z",
    "source": "The Hacker News",
    "summary": "Most security teams today are buried under tools. Too many dashboards. Too much noise. Not enough real progress.\nEvery vendor promises “complete coverage” or “AI-powered automation,” but inside most S..."
  },
  {
    "title": "Hackers Exploit Metro4Shell RCE Flaw in React Native CLI npm Package",
    "link": "https://thehackernews.com/2026/02/hackers-exploit-metro4shell-rce-flaw-in.html",
    "date": "2026-02-03T14:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat actors have been observed exploiting a critical security flaw impacting the Metro Development Server in the popular \"@react-native-community/cli\" npm package.\nCybersecurity company VulnCheck sa..."
  },
  {
    "title": "When Cloud Outages Ripple Across the Internet",
    "link": "https://thehackernews.com/2026/02/when-cloud-outages-ripple-across.html",
    "date": "2026-02-03T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Recent major cloud service outages have been hard to miss. High-profile incidents affecting providers such as AWS, Azure, and Cloudflare have disrupted large parts of the internet, taking down website..."
  },
  {
    "title": "APT28 Uses Microsoft Office CVE-2026-21509 in Espionage-Focused Malware Attacks",
    "link": "https://thehackernews.com/2026/02/apt28-uses-microsoft-office-cve-2026.html",
    "date": "2026-02-03T09:12:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russia-linked state-sponsored threat actor known as APT28 (aka UAC-0001) has been attributed to attacks exploiting a newly disclosed security flaw in Microsoft Office as part of a campaign codenam..."
  },
  {
    "title": "Mozilla Adds One-Click Option to Disable Generative AI Features in Firefox",
    "link": "https://thehackernews.com/2026/02/mozilla-adds-one-click-option-to.html",
    "date": "2026-02-03T05:39:00.000Z",
    "source": "The Hacker News",
    "summary": "Mozilla on Monday announced a new controls section in its Firefox desktop browser settings that allows users to completely turn off generative artificial intelligence (GenAI) features.\n\"It provides a ..."
  },
  {
    "title": "Notepad++ Hosting Breach Attributed to China-Linked Lotus Blossom Hacking Group",
    "link": "https://thehackernews.com/2026/02/notepad-hosting-breach-attributed-to.html",
    "date": "2026-02-03T04:55:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-linked threat actor known as Lotus Blossom has been attributed with medium confidence to the recently discovered compromise of the infrastructure hosting Notepad++.\nThe attack enabled the stat..."
  },
  {
    "title": "Attackers Harvest Dropbox Logins Via Fake PDF Lures",
    "link": "https://www.darkreading.com/cloud-security/attackers-harvest-dropbox-logins-fake-pdf-lures",
    "date": "2026-02-02T22:21:33.000Z",
    "source": "Dark Reading",
    "summary": "A malware-free phishing campaign targets corporate inboxes and asks employees to view \"request orders,\" ultimately leading to Dropbox credential theft...."
  },
  {
    "title": "County Pays $600K to Wrongfully Jailed Pen Testers",
    "link": "https://www.darkreading.com/cybersecurity-operations/county-pays-600k-wrongfully-jailed-pen-testers",
    "date": "2026-02-02T21:57:51.000Z",
    "source": "Dark Reading",
    "summary": "Iowa police arrested two penetration testers in 2019 for doing their jobs, highlighting the risk to security professionals in red teaming exercises...."
  },
  {
    "title": "Chinese Hackers Hijack Notepad++ Updates for 6 Months",
    "link": "https://www.darkreading.com/application-security/chinese-hackers-hijack-notepad-updates-6-months",
    "date": "2026-02-02T19:57:02.000Z",
    "source": "Dark Reading",
    "summary": "State-sponsored threat actors compromised the popular code editor's hosting provider to redirect targeted users to malicious downloads...."
  },
  {
    "title": "Researchers Find 341 Malicious ClawHub Skills Stealing Data from OpenClaw Users",
    "link": "https://thehackernews.com/2026/02/researchers-find-341-malicious-clawhub.html",
    "date": "2026-02-02T17:49:00.000Z",
    "source": "The Hacker News",
    "summary": "A security audit of 2,857 skills on ClawHub has found 341 malicious skills across multiple campaigns, according to new findings from Koi Security, exposing users to new supply chain risks.\nClawHub is ..."
  },
  {
    "title": "OpenClaw Bug Enables One-Click Remote Code Execution via Malicious Link",
    "link": "https://thehackernews.com/2026/02/openclaw-bug-enables-one-click-remote.html",
    "date": "2026-02-02T16:28:00.000Z",
    "source": "The Hacker News",
    "summary": "A high-severity security flaw has been disclosed in OpenClaw (formerly referred to as Clawdbot and Moltbot) that could allow remote code execution (RCE) through a crafted malicious link.\nThe issue, wh..."
  },
  {
    "title": "ShinyHunters Expands Scope of SaaS Extortion Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/shinyhunters-expands-scope-saas-extortion-attacks",
    "date": "2026-02-02T16:07:57.000Z",
    "source": "Dark Reading",
    "summary": "Following their attacks on Salesforce instances last year, members of the cybercrime group have broadened their targeting and gotten more aggressive with extortion tactics...."
  },
  {
    "title": "Microsoft Begins NTLM Phase-Out With Three-Stage Plan to Move Windows to Kerberos",
    "link": "https://thehackernews.com/2026/02/microsoft-begins-ntlm-phase-out-with.html",
    "date": "2026-02-02T15:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has announced a three-phase approach to phase out New Technology LAN Manager (NTLM) as part of its efforts to shift Windows environments toward stronger, Kerberos-based options.\nThe developm..."
  },
  {
    "title": "⚡ Weekly Recap: Proxy Botnet, Office Zero-Day, MongoDB Ransoms, AI Hijacks & New Threats",
    "link": "https://thehackernews.com/2026/02/weekly-recap-proxy-botnet-office-zero.html",
    "date": "2026-02-02T11:59:00.000Z",
    "source": "The Hacker News",
    "summary": "Every week brings new discoveries, attacks, and defenses that shape the state of cybersecurity. Some threats are stopped quickly, while others go unseen until they cause real damage.\nSometimes a singl..."
  },
  {
    "title": "Securing the Mid-Market Across the Complete Threat Lifecycle",
    "link": "https://thehackernews.com/2026/02/securing-mid-market-across-complete.html",
    "date": "2026-02-02T11:45:00.000Z",
    "source": "The Hacker News",
    "summary": "For mid-market organizations, cybersecurity is a constant balancing act. Proactive, preventative security measures are essential to protect an expanding attack surface. Combined with effective protect..."
  },
  {
    "title": "Notepad++ Official Update Mechanism Hijacked to Deliver Malware to Select Users",
    "link": "https://thehackernews.com/2026/02/notepad-official-update-mechanism.html",
    "date": "2026-02-02T08:55:00.000Z",
    "source": "The Hacker News",
    "summary": "The maintainer of Notepad++ has revealed that state-sponsored attackers hijacked the utility's update mechanism to redirect update traffic to malicious servers instead.\n\"The attack involved [an] infra..."
  },
  {
    "title": "eScan Antivirus Update Servers Compromised to Deliver Multi-Stage Malware",
    "link": "https://thehackernews.com/2026/02/escan-antivirus-update-servers.html",
    "date": "2026-02-02T05:47:00.000Z",
    "source": "The Hacker News",
    "summary": "The update infrastructure for eScan antivirus, a security solution developed by Indian cybersecurity company MicroWorld Technologies, has been compromised by unknown attackers to deliver a persistent ..."
  },
  {
    "title": "Open VSX Supply Chain Attack Used Compromised Dev Account to Spread GlassWorm",
    "link": "https://thehackernews.com/2026/02/open-vsx-supply-chain-attack-used.html",
    "date": "2026-02-02T05:04:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a supply chain attack targeting the Open VSX Registry in which unidentified threat actors compromised a legitimate developer's resources to push mal..."
  },
  {
    "title": "Iran-Linked RedKitten Cyber Campaign Targets Human Rights NGOs and Activists",
    "link": "https://thehackernews.com/2026/01/iran-linked-redkitten-cyber-campaign.html",
    "date": "2026-01-31T12:02:00.000Z",
    "source": "The Hacker News",
    "summary": "A Farsi-speaking threat actor aligned with Iranian state interests is suspected to be behind a new campaign targeting non-governmental organizations and individuals involved in documenting recent huma..."
  },
  {
    "title": "Mandiant Finds ShinyHunters-Style Vishing Attacks Stealing MFA to Breach SaaS Platforms",
    "link": "https://thehackernews.com/2026/01/mandiant-finds-shinyhunters-using.html",
    "date": "2026-01-31T07:58:00.000Z",
    "source": "The Hacker News",
    "summary": "Google-owned Mandiant on Friday said it identified an \"expansion in threat activity\" that uses tradecraft consistent with extortion-themed attacks orchestrated by a financially motivated hacking group..."
  },
  {
    "title": "CERT Polska Details Coordinated Cyber Attacks on 30+ Wind and Solar Farms",
    "link": "https://thehackernews.com/2026/01/poland-attributes-december-cyber.html",
    "date": "2026-01-31T07:05:00.000Z",
    "source": "The Hacker News",
    "summary": "CERT Polska, the Polish computer emergency response team, revealed that coordinated cyber attacks targeted more than 30 wind and photovoltaic farms, a private company from the manufacturing sector, an..."
  },
  {
    "title": "Torq Moves SOCs Beyond SOAR With AI-Powered Hyper Automation",
    "link": "https://www.darkreading.com/remote-workforce/torq-moves-socs-soar-ai-powered-hyper-automation",
    "date": "2026-01-30T22:14:31.000Z",
    "source": "Dark Reading",
    "summary": "Investors poured $140 million into Torq's Series D Round, raising the startup's valuation to $1.2 billion, to bring AI-based \"hyper automation\" to SOCs...."
  },
  {
    "title": "2026: The Year Agentic AI Becomes the Attack-Surface Poster Child",
    "link": "https://www.darkreading.com/threat-intelligence/2026-agentic-ai-attack-surface-poster-child",
    "date": "2026-01-30T21:16:15.000Z",
    "source": "Dark Reading",
    "summary": "Dark Reading asked readers whether agentic AI attacks, advanced deepfake threats, board recognition of cyber as a top priority, or password-less technology adoption would be most likely to become a tr..."
  },
  {
    "title": "Out-of-the-Box Expectations for 2026 Reveal a Grab Bag of Risk",
    "link": "https://www.darkreading.com/threat-intelligence/cyber-expectations-2026-grab-bag-risk",
    "date": "2026-01-30T21:14:32.000Z",
    "source": "Dark Reading",
    "summary": "Security teams need to be thinking about this list of emerging cybersecurity realities to avoid rolling the dice on enterprise security risks (and opportunities)...."
  },
  {
    "title": "Tenable Tackles AI Governance, Shadow AI Risks, Data Exposure",
    "link": "https://www.darkreading.com/cyber-risk/tenable-tackles-ai-governance-shadow-ai-risks-data-exposure",
    "date": "2026-01-30T20:23:53.000Z",
    "source": "Dark Reading",
    "summary": "The Tenable One AI Exposure add-on discovers unsanctioned AI use in the organization and enforces policy compliance with approved tools...."
  }
]