[
  {
    "title": "Johnson Controls starts notifying people affected by 2023 breach",
    "link": "https://www.bleepingcomputer.com/news/security/johnson-controls-starts-notifying-people-affected-by-2023-breach/",
    "date": "2025-07-01T11:47:26.000Z",
    "source": "Bleeping Computer",
    "summary": "Building automation giant Johnson Controls is notifying individuals whose data was stolen in a massive ransomware attack that impacted the company's operations worldwide in September 2023. [...]..."
  },
  {
    "title": "Microsoft Authenticator won't manage your passwords anymore - here's why and what's next",
    "link": "https://www.zdnet.com/article/microsoft-authenticator-wont-manage-your-passwords-anymore-heres-why-and-whats-next/",
    "date": "2025-07-01T11:40:00.000Z",
    "source": "ZDNet Security",
    "summary": "Starting in August, your saved passwords will no longer be accessible in Microsoft's Authenticator app. You have several options...."
  },
  {
    "title": "A New Maturity Model for Browser Security: Closing the Last-Mile Risk",
    "link": "https://thehackernews.com/2025/07/a-new-maturity-model-for-browser.html",
    "date": "2025-07-01T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Despite years of investment in Zero Trust, SSE, and endpoint protection, many enterprises are still leaving one critical layer exposed: the browser.\nIt’s where 85% of modern work now happens. It’s als..."
  },
  {
    "title": "Google fixes fourth actively exploited Chrome zero-day of 2025",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-fourth-actively-exploited-chrome-zero-day-of-2025/",
    "date": "2025-07-01T10:59:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has released emergency updates to patch another Chrome zero-day vulnerability exploited in attacks, marking the fourth such flaw fixed since the start of the year. [...]..."
  },
  {
    "title": "Chrome Zero-Day CVE-2025-6554 Under Active Attack — Google Issues Security Update",
    "link": "https://thehackernews.com/2025/07/google-patches-critical-zero-day-flaw.html",
    "date": "2025-07-01T08:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Google has released security updates to address a vulnerability in its Chrome browser for which an exploit exists in the wild.\nThe zero-day vulnerability, tracked as CVE-2025-6554 (CVSS score: N/A), h..."
  },
  {
    "title": "U.S. Arrests Facilitator in North Korean IT Worker Scheme; Seizes 29 Domains and Raids 21 Laptop Farms",
    "link": "https://thehackernews.com/2025/07/us-arrests-key-facilitator-in-north.html",
    "date": "2025-07-01T07:53:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Department of Justice (DoJ) on Monday announced sweeping actions targeting the North Korean information technology (IT) worker scheme, leading to the arrest of one individual and the seizure ..."
  },
  {
    "title": "Microsoft Removes Password Management from Authenticator App Starting August 2025",
    "link": "https://thehackernews.com/2025/07/microsoft-removes-password-management.html",
    "date": "2025-07-01T04:21:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has said that it's ending support for passwords in its Authenticator app starting August 1, 2025.\nMicrosoft’s move is part of a much larger shift away from traditional password-based logins...."
  },
  {
    "title": "U.S. warns of Iranian cyber threats on critical infrastructure",
    "link": "https://www.bleepingcomputer.com/news/security/us-warns-of-iranian-cyber-threats-on-critical-infrastructure/",
    "date": "2025-06-30T22:24:46.000Z",
    "source": "Bleeping Computer",
    "summary": "U.S. cyber agencies, the FBI, and NSA issued an urgent warning today about potential cyberattacks from Iranian-affiliated hackers targeting U.S. critical infrastructure. [...]..."
  },
  {
    "title": "Scattered Spider Hacking Spree Continues With Airline Sector Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/scattered-spider-hacking-spree-airline-sector",
    "date": "2025-06-30T21:36:46.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft has called the hacker collective one of the most dangerous current cyberthreats...."
  },
  {
    "title": "Hired Hacker Assists Drug Cartel in Finding, Killing FBI Sources",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/hacker-drug-cartel-killing-fbi-sources",
    "date": "2025-06-30T21:06:32.000Z",
    "source": "Dark Reading",
    "summary": "According to a government report, El Chapo's Sinaloa drug cartel used a hacker to spy on people connected to the FBI's 2018 investigation against the kingpin, which led to deadly consequences...."
  },
  {
    "title": "Chinese Company Hikvision Banned By Canadian Government",
    "link": "https://www.darkreading.com/threat-intelligence/hikvision-banned-canadian-government",
    "date": "2025-06-30T20:57:03.000Z",
    "source": "Dark Reading",
    "summary": "Though the company's video surveillance products will be prohibited for government use, individuals and private businesses can still buy the vendor's products...."
  },
  {
    "title": "Airoha Chip Vulns Put Sony, Bose Earbuds &amp; Headphones at Risk",
    "link": "https://www.darkreading.com/vulnerabilities-threats/airoha-chip-vulns-sony-bose-earbuds-headphones",
    "date": "2025-06-30T19:33:09.000Z",
    "source": "Dark Reading",
    "summary": "The vulnerabilities, which have yet to be published, could allow a threat actor to hijack not only Bluetooth earbuds and headphones but also the devices connected to them...."
  },
  {
    "title": "The best Bluetooth trackers of 2025: Expert tested",
    "link": "https://www.zdnet.com/article/best-bluetooth-tracker/",
    "date": "2025-06-30T18:47:00.000Z",
    "source": "ZDNet Security",
    "summary": "We've tested and reviewed the best Bluetooth trackers for iOS and Android. Our recommendations will make sure your valuables are always easy to find...."
  },
  {
    "title": "Germany asks Google, Apple to remove DeepSeek AI from app stores",
    "link": "https://www.bleepingcomputer.com/news/security/germany-asks-google-apple-remove-deepseek-ai-from-app-stores/",
    "date": "2025-06-30T18:03:31.000Z",
    "source": "Bleeping Computer",
    "summary": "The Berlin Commissioner for Data Protection has formally requested Google and Apple to remove the DeepSeek AI application from the application stores due to GDPR violations. [...]..."
  },
  {
    "title": "Senator Chides FBI for Weak Advice on Mobile Security",
    "link": "https://krebsonsecurity.com/2025/06/senator-chides-fbi-for-weak-advice-on-mobile-security/",
    "date": "2025-06-30T17:33:59.000Z",
    "source": "Krebs on Security",
    "summary": "Agents with the Federal Bureau of Investigation (FBI) briefed Capitol Hill staff recently on hardening the security of their mobile devices, after a contacts list stolen from the personal phone of the..."
  },
  {
    "title": "Got a Brother printer? It could have a critical security flaw -  how to check and what to do next",
    "link": "https://www.zdnet.com/article/got-a-brother-printer-it-could-have-a-critical-security-flaw-how-to-check-and-what-to-do-next/",
    "date": "2025-06-30T16:35:00.000Z",
    "source": "ZDNet Security",
    "summary": "If your Brother printer is affected, you need to change its default admin password now. Here's how...."
  },
  {
    "title": "U.S. Agencies Warn of Rising Iranian Cyberattacks on Defense, OT Networks, and Critical Infrastructure",
    "link": "https://thehackernews.com/2025/06/us-agencies-warn-of-rising-iranian.html",
    "date": "2025-06-30T16:29:00.000Z",
    "source": "The Hacker News",
    "summary": "U.S. cybersecurity and intelligence agencies have issued a joint advisory warning of potential cyber attacks from Iranian state-sponsored or affiliated threat actors. \n\"Over the past several months, t..."
  },
  {
    "title": "Trump's big, revised bill will slash AI funding for states that regulate AI",
    "link": "https://www.zdnet.com/article/trumps-big-revised-bill-will-slash-ai-funding-for-states-that-regulate-ai/",
    "date": "2025-06-30T16:19:00.000Z",
    "source": "ZDNet Security",
    "summary": "Senators add exemptions for state laws targeting unfair or deceptive practices and child sexual abuse material...."
  },
  {
    "title": "Microsoft Defender for Office 365 now blocks email bombing attacks",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-defender-for-office-365-now-blocks-email-bombing-attacks/",
    "date": "2025-06-30T16:04:20.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft says its Defender for Office 365 cloud-based email security suite will now automatically detect and block email bombing attacks. [...]..."
  },
  {
    "title": "Switzerland says government data stolen in ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/switzerland-says-government-data-stolen-in-ransomware-attack/",
    "date": "2025-06-30T15:39:42.000Z",
    "source": "Bleeping Computer",
    "summary": "The government in Switzerland is informing that sensitive information from various federal offices has been impacted by a ransomware attack at the third-party organization Radix. [...]..."
  },
  {
    "title": "Europol Dismantles $540 Million Cryptocurrency Fraud Network, Arrests Five Suspects",
    "link": "https://thehackernews.com/2025/06/europol-dismantles-540-million.html",
    "date": "2025-06-30T15:17:00.000Z",
    "source": "The Hacker News",
    "summary": "Europol on Monday announced the takedown of a cryptocurrency investment fraud ring that laundered €460 million ($540 million) from more than 5,000 victims across the world.\nThe international effort, c..."
  },
  {
    "title": "AI-Themed SEO Poisoning Attacks Spread Info, Crypto Stealers",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/ai-seo-poisoning-attack-info-crypto-stealers",
    "date": "2025-06-30T14:52:11.000Z",
    "source": "Dark Reading",
    "summary": "Malicious websites designed to rank high in Google search results for ChatGPT and Luma AI deliver the Lumma and Vidar infostealers and other malware...."
  },
  {
    "title": "Hikvision Canada ordered to cease operations over security risks",
    "link": "https://www.bleepingcomputer.com/news/security/hikvision-canada-ordered-to-cease-operations-over-security-risks/",
    "date": "2025-06-30T14:11:17.000Z",
    "source": "Bleeping Computer",
    "summary": "The Canadian government has ordered Hikvision's subsidiary in the country to cease all operations following a review that determined them to pose a national security risk. [...]..."
  },
  {
    "title": "Why Cybersecurity Should Come Before AI in Schools",
    "link": "https://www.darkreading.com/endpoint-security/cybersecurity-before-ai-schools",
    "date": "2025-06-30T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The sooner we integrate cybersecurity basics into school curriculum, the stronger and more resilient our children — and their futures — will be...."
  },
  {
    "title": "Microsoft warns of Windows update delays due to wrong timestamp",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-warns-of-Windows-security-update-delays-due-to-incorrect-metadata-timestamp/",
    "date": "2025-06-30T13:48:49.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has confirmed a new known issue causing delivery delays for June 2025 Windows security updates due to an incorrect metadata timestamp. [...]..."
  },
  {
    "title": "Blind Eagle Uses Proton66 Hosting for Phishing, RAT Deployment on Colombian Banks",
    "link": "https://thehackernews.com/2025/06/blind-eagle-uses-proton66-hosting-for.html",
    "date": "2025-06-30T13:30:00.000Z",
    "source": "The Hacker News",
    "summary": "The threat actor known as Blind Eagle has been attributed with high confidence to the use of the Russian bulletproof hosting service Proton66.\nTrustwave SpiderLabs, in a report published last week, sa..."
  },
  {
    "title": "Europol helps disrupt $540 million crypto investment fraud ring",
    "link": "https://www.bleepingcomputer.com/news/security/europol-helps-disrupt-540-million-crypto-investment-fraud-ring/",
    "date": "2025-06-30T13:20:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Spanish authorities have arrested five individuals in Madrid and the Canary Islands, suspected of laundering $540 million (€460 million) from illegal cryptocurrency investment schemes and defrauding m..."
  },
  {
    "title": "FBI: Cybercriminals steal health data posing as fraud investigators",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-warns-cybercriminals-steal-health-data-posing-as-fraud-investigators/",
    "date": "2025-06-30T12:42:01.000Z",
    "source": "Bleeping Computer",
    "summary": "The Federal Bureau of Investigation (FBI) has warned Americans of cybercriminals impersonating health fraud investigators to steal their sensitive information. [...]..."
  },
  {
    "title": "Over 1,200 Citrix servers unpatched against critical auth bypass flaw",
    "link": "https://www.bleepingcomputer.com/news/security/over-1-200-citrix-servers-unpatched-against-critical-auth-bypass-flaw/",
    "date": "2025-06-30T11:47:38.000Z",
    "source": "Bleeping Computer",
    "summary": "Over 1,200 Citrix NetScaler ADC and NetScaler Gateway appliances exposed online are unpatched against a critical vulnerability believed to be actively exploited, allowing threat actors to bypass authe..."
  },
  {
    "title": "Leveraging Credentials As Unique Identifiers: A Pragmatic Approach To NHI Inventories ",
    "link": "https://thehackernews.com/2025/06/leveraging-credentials-as-unique.html",
    "date": "2025-06-30T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Identity-based attacks are on the rise. Attacks in which malicious actors assume the identity of an entity to easily gain access to resources and sensitive data have been increasing in number and freq..."
  }
]