[
  {
    "title": "GISEC GLOBAL 2026 – The Middle East &amp; Africa’s Largest Cybersecurity Event",
    "link": "https://www.darkreading.com/events/gisec-global",
    "date": "2025-12-11T15:08:57.405Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "AI in OT Sparks Cascade of Complex Challenges",
    "link": "https://www.darkreading.com/ics-ot-security/ai-ot-too-incompatible-work-securely",
    "date": "2025-12-11T14:50:59.000Z",
    "source": "Dark Reading",
    "summary": "Using artificial intelligence in operational technology environments could be a bumpy ride full of trust issues and security challenges...."
  },
  {
    "title": "ThreatsDay Bulletin: Spyware Alerts, Mirai Strikes, Docker Leaks, ValleyRAT Rootkit — and 20 More Stories",
    "link": "https://thehackernews.com/2025/12/threatsday-bulletin-spyware-alerts.html",
    "date": "2025-12-11T13:40:00.000Z",
    "source": "The Hacker News",
    "summary": "This week’s cyber stories show how fast the online world can turn risky. Hackers are sneaking malware into movie downloads, browser add-ons, and even software updates people trust. Tech giants and gov..."
  },
  {
    "title": "Hackers exploit unpatched Gogs zero-day to breach 700 servers",
    "link": "https://www.bleepingcomputer.com/news/security/unpatched-gogs-zero-day-rce-flaw-actively-exploited-in-attacks/",
    "date": "2025-12-11T13:19:50.000Z",
    "source": "Bleeping Computer",
    "summary": "An unpatched zero-day vulnerability in Gogs, a popular self-hosted Git service, has enabled attackers to gain remote code execution on Internet-facing instances and compromise hundreds of servers. [....."
  },
  {
    "title": "NANOREMOTE Malware Uses Google Drive API for Hidden Control on Windows Systems",
    "link": "https://thehackernews.com/2025/12/nanoremote-malware-uses-google-drive.html",
    "date": "2025-12-11T13:16:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new fully-featured Windows backdoor called NANOREMOTE that uses the Google Drive API for command-and-control (C2) purposes.\nAccording to a report ..."
  },
  {
    "title": "The Impact of Robotic Process Automation (RPA) on Identity and Access Management",
    "link": "https://thehackernews.com/2025/12/the-impact-of-robotic-process.html",
    "date": "2025-12-11T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "As enterprises refine their strategies for handling Non-Human Identities (NHIs), Robotic Process Automation (RPA) has become a powerful tool for streamlining operations and enhancing security. However..."
  },
  {
    "title": "WIRTE Leverages AshenLoader Sideloading to Install the AshTag Espionage Backdoor",
    "link": "https://thehackernews.com/2025/12/wirte-leverages-ashenloader-sideloading.html",
    "date": "2025-12-11T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "An advanced persistent threat (APT) known as WIRTE has been attributed to attacks targeting government and diplomatic entities across the Middle East with a previously undocumented malware suite dubbe..."
  },
  {
    "title": "Unpatched Gogs Zero-Day Exploited Across 700+ Instances Amid Active Attacks",
    "link": "https://thehackernews.com/2025/12/unpatched-gogs-zero-day-exploited.html",
    "date": "2025-12-11T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "A high-severity unpatched security vulnerability in Gogs has come under active exploitation, with more than 700 compromised instances accessible over the internet, according to new findings from Wiz.\n..."
  },
  {
    "title": "Microsoft fixes Windows Explorer white flashes in dark mode",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-explorer-white-flashes-in-dark-mode/",
    "date": "2025-12-11T10:09:52.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has fixed a known issue that caused bright white flashes when launching File Explorer in dark mode on Windows 11 systems after installing the KB5070311 optional update. [...]..."
  },
  {
    "title": "Copilot's No-Code AI Agents Liable to Leak Company Data",
    "link": "https://www.darkreading.com/application-security/copilot-no-code-ai-agents-leak-company-data",
    "date": "2025-12-11T10:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Microsoft puts the power of AI in the hands of everyday non-technical Joes. It's a nice idea, and a surefire recipe for security issues...."
  },
  {
    "title": "Google fixes eighth Chrome zero-day exploited in attacks in 2025",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-eighth-chrome-zero-day-exploited-in-attacks-in-2025/",
    "date": "2025-12-11T08:01:21.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has released emergency updates to fix another Chrome zero-day vulnerability exploited in the wild, marking the eighth such security flaw patched since the start of the year. [...]..."
  },
  {
    "title": "Chrome Targeted by Active In-the-Wild Exploit Tied to Undisclosed High-Severity Flaw",
    "link": "https://thehackernews.com/2025/12/chrome-targeted-by-active-in-wild.html",
    "date": "2025-12-11T07:09:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Wednesday shipped security updates for its Chrome browser to address three security flaws, including one it said has come under active exploitation in the wild.\nThe vulnerability, rated high..."
  },
  {
    "title": "Active Attacks Exploit Gladinet's Hard-Coded Keys for Unauthorized Access and Code Execution",
    "link": "https://thehackernews.com/2025/12/hard-coded-gladinet-keys-let-attackers.html",
    "date": "2025-12-11T05:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Huntress is warning of a new actively exploited vulnerability in Gladinet's CentreStack and Triofox products stemming from the use of hard-coded cryptographic keys that have affected nine organization..."
  },
  {
    "title": "Google ads for shared ChatGPT, Grok guides push macOS infostealer malware",
    "link": "https://www.bleepingcomputer.com/news/security/google-ads-for-shared-chatgpt-grok-guides-push-macos-infostealer-malware/",
    "date": "2025-12-10T23:50:56.000Z",
    "source": "Bleeping Computer",
    "summary": "A new AMOS infostealer campaign is abusing Google search ads to lure users into Grok and ChatGPT conversations that appear to offer \"helpful\" instructions but ultimately lead to installing the AMOS in..."
  },
  {
    "title": "Storm-0249 Abuses EDR Processes in Stealthy Attacks",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/storm-0249-edr-processes-stealthy-attacks",
    "date": "2025-12-10T21:59:32.000Z",
    "source": "Dark Reading",
    "summary": "The initial access broker has been weaponizing endpoint detection and response (EDR) platforms and Windows utilities in recent high-precision attacks...."
  },
  {
    "title": "New DroidLock malware locks Android devices and demands a ransom",
    "link": "https://www.bleepingcomputer.com/news/security/new-droidlock-malware-locks-android-devices-and-demands-a-ransom/",
    "date": "2025-12-10T21:53:12.000Z",
    "source": "Bleeping Computer",
    "summary": "A new Android malware called DroidLock has emerged with capabilities to lock screens for ransom payments, erase data, access text messages, call logs, contacts, and audio data. [...]..."
  },
  {
    "title": "ClickFix Style Attack Uses Grok, ChatGPT for Malware Delivery",
    "link": "https://www.darkreading.com/vulnerabilities-threats/clickfix-style-attack-grok-chatgpt-malware",
    "date": "2025-12-10T21:02:30.000Z",
    "source": "Dark Reading",
    "summary": "A new twist on the social engineering tactic is making waves, combining SEO poisoning and legitimate AI domains to install malware on victims' computers...."
  },
  {
    "title": "React2Shell Exploitation Delivers Crypto Miners and New Malware Across Multiple Sectors",
    "link": "https://thehackernews.com/2025/12/react2shell-exploitation-delivers.html",
    "date": "2025-12-10T20:19:00.000Z",
    "source": "The Hacker News",
    "summary": "React2Shell continues to witness heavy exploitation, with threat actors leveraging the maximum-severity security flaw in React Server Components (RSC) to deliver cryptocurrency miners and an array of ..."
  },
  {
    "title": "Microsoft Teams to warn of suspicious traffic with external domains",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-teams-to-warn-of-suspicious-traffic-with-external-domains/",
    "date": "2025-12-10T19:32:08.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is working on a new Teams security feature that will analyze suspicious traffic with external domains to help IT administrators tackle potential security threats. [...]..."
  },
  {
    "title": ".NET SOAPwn Flaw Opens Door for File Writes and Remote Code Execution via Rogue WSDL",
    "link": "https://thehackernews.com/2025/12/net-soapwn-flaw-opens-door-for-file.html",
    "date": "2025-12-10T19:21:00.000Z",
    "source": "The Hacker News",
    "summary": "New research has uncovered exploitation primitives in the .NET Framework that could be leveraged against enterprise-grade applications to achieve remote code execution.\nWatchTowr Labs, which has coden..."
  },
  {
    "title": "Over 10,000 Docker Hub images found leaking credentials, auth keys",
    "link": "https://www.bleepingcomputer.com/news/security/over-10-000-docker-hub-images-found-leaking-credentials-auth-keys/",
    "date": "2025-12-10T18:22:25.000Z",
    "source": "Bleeping Computer",
    "summary": "More than 10,000 Docker Hub container images expose data that should be protected, including live credentials to production systems, CI/CD databases, or LLM model keys. [...]..."
  },
  {
    "title": "Why a secure software development life cycle is critical for manufacturers",
    "link": "https://www.bleepingcomputer.com/news/security/why-a-secure-software-development-life-cycle-is-critical-for-manufacturers/",
    "date": "2025-12-10T15:00:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Recent supply-chain breaches show how attackers exploit development tools, compromised credentials, and malicious NPM packages to infiltrate manufacturing and production environments. Acronis explains..."
  },
  {
    "title": "New Spiderman phishing service targets dozens of European banks",
    "link": "https://www.bleepingcomputer.com/news/security/new-spiderman-phishing-service-targets-dozens-of-european-banks/",
    "date": "2025-12-10T14:53:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A new phishing kit called Spiderman is being used to target customers of dozens of European banks and cryptocurrency holders with pixel-perfect cloned sites impersonating brands and organizations. [....."
  },
  {
    "title": "Three PCIe Encryption Weaknesses Expose PCIe 5.0+ Systems to Faulty Data Handling",
    "link": "https://thehackernews.com/2025/12/three-pcie-encryption-weaknesses-expose.html",
    "date": "2025-12-10T13:32:00.000Z",
    "source": "The Hacker News",
    "summary": "Three security vulnerabilities have been disclosed in the Peripheral Component Interconnect Express (PCIe) Integrity and Data Encryption (IDE) protocol specification that could expose a local attacker..."
  },
  {
    "title": "Feds: Pro-Russia Hacktivists Target US Critical Infrastructure",
    "link": "https://www.darkreading.com/threat-intelligence/hactivists-target-critical-infrastructure",
    "date": "2025-12-10T12:56:02.000Z",
    "source": "Dark Reading",
    "summary": "So far the attacks, which compromise virtual network computing (VNC) connections in OT systems, have not been particularly destructive, but this could change as they evolve...."
  },
  {
    "title": "Ukrainian hacker charged with helping Russian hacktivist groups",
    "link": "https://www.bleepingcomputer.com/news/security/ukrainian-hacker-charged-with-helping-russian-hacktivist-groups/",
    "date": "2025-12-10T12:26:32.000Z",
    "source": "Bleeping Computer",
    "summary": "U.S. prosecutors have charged a Ukrainian national for her role in cyberattacks targeting critical infrastructure worldwide, including U.S. water systems, election systems, and nuclear facilities, on ..."
  },
  {
    "title": "Warning: WinRAR Vulnerability CVE-2025-6218 Under Active Attack by Multiple Threat Groups",
    "link": "https://thehackernews.com/2025/12/warning-winrar-vulnerability-cve-2025.html",
    "date": "2025-12-10T11:54:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added a security flaw impacting the WinRAR file archiver and compression utility to its Known Exploited Vulnerabilities (KEV..."
  },
  {
    "title": "Webinar: How Attackers Exploit Cloud Misconfigurations Across AWS, AI Models, and Kubernetes",
    "link": "https://thehackernews.com/2025/12/webinar-how-attackers-exploit-cloud.html",
    "date": "2025-12-10T11:54:00.000Z",
    "source": "The Hacker News",
    "summary": "Cloud security is changing. Attackers are no longer just breaking down the door; they are finding unlocked windows in your configurations, your identities, and your code.\nStandard security tools often..."
  },
  {
    "title": "Microsoft Issues Security Fixes for 56 Flaws, Including Active Exploit and Two Zero-Days",
    "link": "https://thehackernews.com/2025/12/microsoft-issues-security-fixes-for-56.html",
    "date": "2025-12-10T08:50:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft closed out 2025 with patches for 56 security flaws in various products across the Windows platform, including one vulnerability that has been actively exploited in the wild.\nOf the 56 flaws,..."
  },
  {
    "title": "Fortinet, Ivanti, and SAP Issue Urgent Patches for Authentication and Code Execution Flaws",
    "link": "https://thehackernews.com/2025/12/fortinet-ivanti-and-sap-issue-urgent.html",
    "date": "2025-12-10T04:50:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortinet, Ivanti, and SAP have moved to address critical security flaws in their products that, if successfully exploited, could result in an authentication bypass and code execution.\nThe Fortinet vul..."
  }
]