[
  {
    "title": "Secure Your Spot at RSAC 2026 Conference",
    "link": "https://www.darkreading.com/events/rsac-2026-conference",
    "date": "2026-01-26T04:18:43.886Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "ChatGPT Temporary chat feature is getting a much-needed upgrade",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-temporary-chat-feature-is-getting-a-much-needed-upgrade/",
    "date": "2026-01-26T01:01:12.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is testing a big upgrade for ChatGPT's temporary chat feature. The update will allow you to retain personalization in temporary chat, and still block temporary chat from influencing your accoun..."
  },
  {
    "title": "1Password adds pop-up warnings for suspected phishing sites",
    "link": "https://www.bleepingcomputer.com/news/security/1password-adds-pop-up-warnings-for-suspected-phishing-sites/",
    "date": "2026-01-25T15:17:12.000Z",
    "source": "Bleeping Computer",
    "summary": "The 1Password digital vault and password manager has added built-in protection against phishing URLs to help users identify malicious pages and prevent them from sharing account credentials with threa..."
  },
  {
    "title": "Microsoft investigates Windows 11 boot failures after January updates",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-windows-11-boot-failures-after-january-updates/",
    "date": "2026-01-25T13:20:28.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft is investigating reports that some Windows 11 devices are failing to boot with \"UNMOUNTABLE_BOOT_VOLUME\" errors after installing the January 2026 Patch Tuesday security updates. [...]..."
  },
  {
    "title": "Microsoft releases emergency OOB update to fix Outlook freezes",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-emergency-oob-update-to-fix-outlook-freezes/",
    "date": "2026-01-25T01:59:15.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released emergency, out-of-band updates on Saturday for Windows 10, Windows 11, and Windows Server to fix an issue that prevented Microsoft Outlook classic from opening when using PSTs s..."
  },
  {
    "title": "Sandworm hackers linked to failed wiper attack on Poland’s energy systems",
    "link": "https://www.bleepingcomputer.com/news/security/sandworm-hackers-linked-to-failed-wiper-attack-on-polands-energy-systems/",
    "date": "2026-01-24T21:58:42.000Z",
    "source": "Bleeping Computer",
    "summary": "A cyberattack targeting Poland's power grid in late December 2025 has been linked to the Russian state-sponsored hacking group Sandworm, which attempted to deploy a new destructive data-wiping malware..."
  },
  {
    "title": "Konni hackers target blockchain engineers with AI-built malware",
    "link": "https://www.bleepingcomputer.com/news/security/konni-hackers-target-blockchain-engineers-with-ai-built-malware/",
    "date": "2026-01-24T15:23:46.000Z",
    "source": "Bleeping Computer",
    "summary": "The North Korean hacker group Konni (Opal Sleet, TA406) is using AI-generated PowerShell malware to target developers and engineers in the blockchain sector. [...]..."
  },
  {
    "title": "Multi-Stage Phishing Campaign Targets Russia with Amnesia RAT and Ransomware",
    "link": "https://thehackernews.com/2026/01/multi-stage-phishing-campaign-targets.html",
    "date": "2026-01-24T11:09:00.000Z",
    "source": "The Hacker News",
    "summary": "A new multi-stage phishing campaign has been observed targeting users in Russia with ransomware and a remote access trojan called Amnesia RAT.\n\"The attack begins with social engineering lures delivere..."
  },
  {
    "title": "New DynoWiper Malware Used in Attempted Sandworm Attack on Polish Power Sector",
    "link": "https://thehackernews.com/2026/01/new-dynowiper-malware-used-in-attempted.html",
    "date": "2026-01-24T08:21:00.000Z",
    "source": "The Hacker News",
    "summary": "The Russian nation-state hacking group known as Sandworm has been attributed to what has been described as the \"largest cyber attack\" targeting Poland's power system in the last week of December 2025...."
  },
  {
    "title": "Who Approved This Agent? Rethinking Access, Accountability, and Risk in the Age of AI Agents",
    "link": "https://thehackernews.com/2026/01/who-approved-this-agent-rethinking.html",
    "date": "2026-01-24T08:20:00.000Z",
    "source": "The Hacker News",
    "summary": "AI agents are accelerating how work gets done. They schedule meetings, access data, trigger workflows, write code, and take action in real time, pushing productivity beyond human speed across the ente..."
  },
  {
    "title": "CISA Adds Actively Exploited VMware vCenter Flaw CVE-2024-37079 to KEV Catalog",
    "link": "https://thehackernews.com/2026/01/cisa-adds-actively-exploited-vmware.html",
    "date": "2026-01-24T08:09:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added a critical security flaw affecting Broadcom VMware vCenter Server that was patched in June 2024 to its Known Exploited ..."
  },
  {
    "title": "2025 Was a Wake-Up Call to Protect Human Decisions, Not Just Systems",
    "link": "https://www.darkreading.com/cyber-risk/wake-up-call-to-protect-human-decisions-not-just-systems",
    "date": "2026-01-24T00:55:56.000Z",
    "source": "Dark Reading",
    "summary": "Cybersecurity must shift from solely protecting systems to safeguarding human decision-making under uncertainty and system failures...."
  },
  {
    "title": "ShinyHunters claim hacks of Okta, Microsoft SSO accounts for data theft",
    "link": "https://www.bleepingcomputer.com/news/security/shinyhunters-claim-to-be-behind-sso-account-data-theft-attacks/",
    "date": "2026-01-23T23:35:03.000Z",
    "source": "Bleeping Computer",
    "summary": "The ShinyHunters extortion gang claims it is behind a wave of ongoing voice phishing attacks targeting single sign-on (SSO) accounts at Okta, Microsoft, and Google, enabling threat actors to breach co..."
  },
  {
    "title": "Swipe, Plug-in, Pwned: Researchers Find New Ways to Hack Vehicles",
    "link": "https://www.darkreading.com/endpoint-security/researchers-find-new-ways-hack-vehicles",
    "date": "2026-01-23T21:04:17.000Z",
    "source": "Dark Reading",
    "summary": "Security researchers exploited dozens of vulnerabilities in vehicle infotainment systems and EV chargers during the latest Pwn2Own contest at Automotive World 2026...."
  },
  {
    "title": "Exploited Zero-Day Flaw in Cisco UC Could Affect Millions",
    "link": "https://www.darkreading.com/endpoint-security/exploited-zero-day-flaw-cisco-uc-affect-millions",
    "date": "2026-01-23T20:56:42.000Z",
    "source": "Dark Reading",
    "summary": "Mass scanning is underway for CVE-2026-20045, which Cisco tagged as critical because successful exploitation could lead to a complete system takeover...."
  },
  {
    "title": "Europe's GCVE Raises Concerns Over Fragmentation in Vulnerability Databases",
    "link": "https://www.darkreading.com/cyber-risk/gcve-raises-concerns-fragmentation-vulnerability-database",
    "date": "2026-01-23T20:31:58.000Z",
    "source": "Dark Reading",
    "summary": "GCVE would enhance global collaboration, flexibility, and efficiency in tracking security flaws. Duplicate entries and a decentralization policy may create more chaos for defenders...."
  },
  {
    "title": "Malicious AI extensions on VSCode Marketplace steal developer data",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-ai-extensions-on-vscode-marketplace-steal-developer-data/",
    "date": "2026-01-23T20:11:58.000Z",
    "source": "Bleeping Computer",
    "summary": "Two malicious extensions in Microsoft's Visual Studio Code (VSCode) Marketplace that were collectively installed 1.5 million times, exfiltrate developer data to China-based servers. [...]..."
  },
  {
    "title": "CISA confirms active exploitation of four enterprise software bugs",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-confirms-active-exploitation-of-four-enterprise-software-bugs/",
    "date": "2026-01-23T18:47:31.000Z",
    "source": "Bleeping Computer",
    "summary": "The Cybersecurity and Infrastructure Security Agency (CISA) in the U.S. warned of active exploitation of four vulnerabilities impacting enterprise software from Versa and Zimbra, the Vite frontend too..."
  },
  {
    "title": "Healthy Security Cultures Want People to Report Risks",
    "link": "https://www.darkreading.com/cyber-risk/healthy-security-cultures-thrive-on-risk-reporting",
    "date": "2026-01-23T16:45:35.000Z",
    "source": "Dark Reading",
    "summary": "The signs of an effective security culture are shifting as companies call on CISOs and security teams to raise their hands unabashedly...."
  },
  {
    "title": "US to deport Venezuelans who emptied bank ATMs using malware",
    "link": "https://www.bleepingcomputer.com/news/security/us-to-deport-venezuelans-who-emptied-bank-atms-using-malware/",
    "date": "2026-01-23T16:38:54.000Z",
    "source": "Bleeping Computer",
    "summary": "South Carolina federal prosecutors announced that two Venezuelan nationals convicted of stealing hundreds of thousands of dollars from U.S. banks in an ATM jackpotting scheme will be deported after se..."
  },
  {
    "title": "Hackers exploit critical telnetd auth bypass flaw to get root",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-critical-telnetd-auth-bypass-flaw-to-get-root/",
    "date": "2026-01-23T16:21:46.000Z",
    "source": "Bleeping Computer",
    "summary": "A coordinated campaign has been observed targeting a recently disclosed critical-severity vulnerability that has been present in the GNU InetUtils telnetd server for 11 years. [...]..."
  },
  {
    "title": "CISA Updates KEV Catalog with Four Actively Exploited Software Vulnerabilities",
    "link": "https://thehackernews.com/2026/01/cisa-updates-kev-catalog-with-four.html",
    "date": "2026-01-23T15:24:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in t..."
  },
  {
    "title": "What an AI-Written Honeypot Taught Us About Trusting Machines",
    "link": "https://www.bleepingcomputer.com/news/security/what-an-ai-written-honeypot-taught-us-about-trusting-machines/",
    "date": "2026-01-23T14:59:58.000Z",
    "source": "Bleeping Computer",
    "summary": "AI-generated code can introduce subtle security flaws when teams over-trust automated output. Intruder shows how an AI-written honeypot introduced hidden vulnerabilities that were exploited in attacks..."
  },
  {
    "title": "Microsoft: Outlook for iOS crashes, freezes due to coding error",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-outlook-for-ios-crashes-freezes-due-to-coding-error/",
    "date": "2026-01-23T13:34:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft confirmed today that Outlook mobile may crash or freeze when launched on iPad devices due to a coding error. [...]..."
  },
  {
    "title": "Hackers get $1,047,000 for 76 zero-days at Pwn2Own Automotive 2026",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-get-1-047-000-for-76-zero-days-at-pwn2own-automotive-2026/",
    "date": "2026-01-23T12:50:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Pwn2Own Automotive 2026 has ended with security researchers earning $1,047,000 after exploiting 76 zero-day vulnerabilities between January 21 and January 23. [...]..."
  },
  {
    "title": "Fortinet Confirms Active FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
    "link": "https://thehackernews.com/2026/01/fortinet-confirms-active-forticloud-sso.html",
    "date": "2026-01-23T12:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortinet has officially confirmed that it's working to completely plug a FortiCloud SSO authentication bypass vulnerability following reports of fresh exploitation activity on fully-patched firewalls...."
  },
  {
    "title": "TikTok Forms U.S. Joint Venture to Continue Operations Under 2025 Executive Order",
    "link": "https://thehackernews.com/2026/01/tiktok-forms-us-joint-venture-to.html",
    "date": "2026-01-23T11:30:00.000Z",
    "source": "The Hacker News",
    "summary": "TikTok on Friday officially announced that it formed a joint venture that will allow the hugely popular video-sharing application to continue operating in the U.S.\nThe new venture, named TikTok USDS J..."
  },
  {
    "title": "Phishing Attack Uses Stolen Credentials to Install LogMeIn RMM for Persistent Access",
    "link": "https://thehackernews.com/2026/01/phishing-attack-uses-stolen-credentials.html",
    "date": "2026-01-23T11:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new dual-vector campaign that leverages stolen credentials to deploy legitimate Remote Monitoring and Management (RMM) software for persistent rem..."
  },
  {
    "title": "Fortinet confirms critical FortiCloud auth bypass not fully patched",
    "link": "https://www.bleepingcomputer.com/news/security/fortinet-confirms-critical-forticloud-auth-bypass-not-fully-patched/",
    "date": "2026-01-23T10:39:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Days after admins began reporting that their fully patched firewalls are being hacked, Fortinet confirmed it's working to fully address a critical FortiCloud SSO authentication bypass vulnerability th..."
  },
  {
    "title": "Microsoft Flags Multi-Stage AitM Phishing and BEC Attacks Targeting Energy Firms",
    "link": "https://thehackernews.com/2026/01/microsoft-flags-multi-stage-aitm.html",
    "date": "2026-01-23T08:25:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft has warned of a multi‑stage adversary‑in‑the‑middle (AitM) phishing and business email compromise (BEC) campaign targeting multiple organizations in the energy sector.\n\"The campaign abused S..."
  }
]