[
  {
    "title": "Claroty Patches Authentication Bypass Flaw",
    "link": "https://www.darkreading.com/ics-ot-security/claroty-patches-authentication-bypass-flaw",
    "date": "2025-10-30T20:29:51.000Z",
    "source": "Dark Reading",
    "summary": "CVE-2025-54603 gave attackers an opening to disrupt critical operational technology (OT) environments and steal data from them...."
  },
  {
    "title": "Massive surge of NFC relay malware steals Europeans’ credit cards",
    "link": "https://www.bleepingcomputer.com/news/security/massive-surge-of-nfc-relay-malware-steals-europeans-credit-cards/",
    "date": "2025-10-30T20:17:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Near-Field Communication (NFC) relay malware has grown massively popular in Eastern Europe, with researchers discovering over 760 malicious Android apps using the technique to steal people's payment c..."
  },
  {
    "title": "CISA orders feds to patch VMware Tools flaw exploited by Chinese hackers",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-feds-to-patch-vmware-tools-flaw-exploited-since-october-2024/",
    "date": "2025-10-30T20:01:40.000Z",
    "source": "Bleeping Computer",
    "summary": "CISA has ordered federal agencies to patch a high-severity vulnerability in Broadcom's VMware Aria Operations and VMware Tools software, exploited by Chinese hackers since October 2024. [...]..."
  },
  {
    "title": "LotL Attack Hides Malware in Windows Native AI Stack",
    "link": "https://www.darkreading.com/vulnerabilities-threats/lotl-attack-malware-windows-native-ai-stack",
    "date": "2025-10-30T19:47:22.000Z",
    "source": "Dark Reading",
    "summary": "Security programs trust AI data files, but they shouldn't: they can conceal malware more stealthily than most file types...."
  },
  {
    "title": "Major telecom services provider Ribbon breached by state hackers",
    "link": "https://www.bleepingcomputer.com/news/security/major-telecom-services-provider-ribbon-breached-by-state-hackers/",
    "date": "2025-10-30T19:03:37.000Z",
    "source": "Bleeping Computer",
    "summary": "Ribbon Communications, a provider of telecommunications services to the U.S. government and telecom companies worldwide, revealed that nation-state hackers breached its IT network as early as December..."
  },
  {
    "title": "BPO giant Conduent confirms data breach impacts 10.5 million people",
    "link": "https://www.bleepingcomputer.com/news/security/bpo-giant-conduent-confirms-data-breach-impacts-105-million-people/",
    "date": "2025-10-30T18:38:45.000Z",
    "source": "Bleeping Computer",
    "summary": "American business services giant Conduent has confirmed that a 2024 data breach has impacted over 10.5 million people, according to notifications filed with the US Attorney General's offices. [...]..."
  },
  {
    "title": "WhatsApp adds passwordless chat backups on iOS and Android",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-adds-passwordless-chat-backups-on-ios-and-android/",
    "date": "2025-10-30T18:02:49.000Z",
    "source": "Bleeping Computer",
    "summary": "WhatsApp is rolling out passkey-encrypted backups for iOS and Android devices, enabling users to encrypt their chat history using their fingerprint, face, or a screen lock code. [...]..."
  },
  {
    "title": "Google's Built-In AI Defenses on Android Now Block 10 Billion Scam Messages a Month",
    "link": "https://thehackernews.com/2025/10/googles-built-in-ai-defenses-on-android.html",
    "date": "2025-10-30T17:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Google on Thursday revealed that the scam defenses built into Android safeguard users around the world from more than 10 billion suspected malicious calls and messages every month.\nThe tech giant also..."
  },
  {
    "title": "Ex-L3Harris exec guilty of selling cyber exploits to Russian broker",
    "link": "https://www.bleepingcomputer.com/news/security/ex-l3harris-exec-guilty-of-selling-cyber-exploits-to-russian-broker/",
    "date": "2025-10-30T16:43:51.000Z",
    "source": "Bleeping Computer",
    "summary": "Peter Williams, a former general manager at U.S. defense contractor L3Harris Trenchant, has pleaded guilty in U.S. District Court to stealing and selling confidential cybersecurity information to a Ru..."
  },
  {
    "title": "Russian Ransomware Gangs Weaponize Open-Source AdaptixC2 for Advanced Attacks",
    "link": "https://thehackernews.com/2025/10/russian-ransomware-gangs-weaponize-open.html",
    "date": "2025-10-30T16:40:00.000Z",
    "source": "The Hacker News",
    "summary": "The open-source command-and-control (C2) framework known as AdaptixC2 is being used by a growing number of threat actors, some of whom are related to Russian ransomware gangs.\nAdaptixC2 is an emerging..."
  },
  {
    "title": "CISA and NSA share tips on securing Microsoft Exchange servers",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-and-nsa-share-tips-on-securing-microsoft-exchange-servers/",
    "date": "2025-10-30T16:11:00.000Z",
    "source": "Bleeping Computer",
    "summary": "The Cybersecurity and Infrastructure Security Agency (CISA) and the National Security Agency (NSA) have released guidance to help IT administrators harden Microsoft Exchange servers on their networks ..."
  },
  {
    "title": "New \"Brash\" Exploit Crashes Chromium Browsers Instantly with a Single Malicious URL",
    "link": "https://thehackernews.com/2025/10/new-brash-exploit-crashes-chromium.html",
    "date": "2025-10-30T14:45:00.000Z",
    "source": "The Hacker News",
    "summary": "A severe vulnerability disclosed in Chromium's Blink rendering engine can be exploited to crash many Chromium-based browsers within a few seconds.\nSecurity researcher Jose Pino, who disclosed details ..."
  },
  {
    "title": "Rethinking identity security in the age of autonomous AI agents",
    "link": "https://www.bleepingcomputer.com/news/security/rethinking-identity-security-in-the-age-of-autonomous-ai-agents/",
    "date": "2025-10-30T14:00:10.000Z",
    "source": "Bleeping Computer",
    "summary": "AI agents now make decisions and access systems on their own, creating identity blind spots traditional tools can't see. Learn how Token Security brings identity-first security to agentic AI — making ..."
  },
  {
    "title": "LinkedIn phishing targets finance execs with fake board invites",
    "link": "https://www.bleepingcomputer.com/news/security/linkedin-phishing-targets-finance-execs-with-fake-board-invites/",
    "date": "2025-10-30T13:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Hackers are abusing LinkedIn to target finance executives with direct-message phishing attacks that impersonate executive board invitations, aiming to steal their Microsoft credentials. [...]..."
  },
  {
    "title": "The Death of the Security Checkbox: BAS Is the Power Behind Real Defense",
    "link": "https://thehackernews.com/2025/10/the-death-of-security-checkbox-bas-is.html",
    "date": "2025-10-30T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Security doesn’t fail at the point of breach. It fails at the point of impact. \nThat line set the tone for this year’s Picus Breach and Simulation (BAS) Summit, where researchers, practitioners, and C..."
  },
  {
    "title": "Microsoft promises more Copilot features in Microsoft 365 companion apps",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-promises-more-copilot-features-in-microsoft-365-companion-apps/",
    "date": "2025-10-30T11:42:03.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft 365 companion apps will be getting more Copilot features in the coming weeks. [...]..."
  },
  {
    "title": "ThreatsDay Bulletin: DNS Poisoning Flaw, Supply-Chain Heist, Rust Malware Trick and New RATs Rising",
    "link": "https://thehackernews.com/2025/10/threatsday-bulletin-dns-poisoning-flaw.html",
    "date": "2025-10-30T10:54:00.000Z",
    "source": "The Hacker News",
    "summary": "The comfort zone in cybersecurity is gone. Attackers are scaling down, focusing tighter, and squeezing more value from fewer, high-impact targets. At the same time, defenders face growing blind spots ..."
  },
  {
    "title": "PhantomRaven Malware Found in 126 npm Packages Stealing GitHub Tokens From Devs",
    "link": "https://thehackernews.com/2025/10/phantomraven-malware-found-in-126-npm.html",
    "date": "2025-10-30T10:16:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have uncovered yet another active software supply chain attack campaign targeting the npm registry with over 100 malicious packages that can steal authentication tokens, CI/C..."
  },
  {
    "title": "Data Leak Outs Hacker Students of Iran's MOIS Training Academy",
    "link": "https://www.darkreading.com/threat-intelligence/data-leak-students-iran-mois-training-academy",
    "date": "2025-10-30T06:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Ravin Academy, a school for the Iranian state hackers of tomorrow, has itself, ironically, been hacked...."
  },
  {
    "title": "Malicious NPM packages fetch infostealer for Windows, Linux, macOS",
    "link": "https://www.bleepingcomputer.com/news/security/malicious-npm-packages-fetch-infostealer-for-windows-linux-macos/",
    "date": "2025-10-29T23:16:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Ten malicious packages mimicking legitimate software projects in the npm registry download an information-stealing component that collects sensitive data from Windows, Linux, and macOS systems. [...]..."
  },
  {
    "title": "WordPress security plugin exposes private data to site subscribers",
    "link": "https://www.bleepingcomputer.com/news/security/wordpress-security-plugin-exposes-private-data-to-site-subscribers/",
    "date": "2025-10-29T20:44:00.000Z",
    "source": "Bleeping Computer",
    "summary": "The Anti-Malware Security and Brute-Force Firewall plugin for WordPress, installed on over 100,000 sites, has a vulnerability that allows subscribers to read any file on the server, potentially exposi..."
  },
  {
    "title": "Malicious NPM Packages Disguised With 'Invisible' Dependencies",
    "link": "https://www.darkreading.com/application-security/malicious-npm-packages-invisible-dependencies",
    "date": "2025-10-29T20:43:21.000Z",
    "source": "Dark Reading",
    "summary": "In the \"PhantomRaven\" campaign, threat actors published 126 malicious npm packages that have flown under the radar, while collecting 86,000 downloads...."
  },
  {
    "title": "AI Search Tools Easily Fooled by Fake Content",
    "link": "https://www.darkreading.com/cyber-risk/ai-search-tools-easily-fooled-by-fake-content",
    "date": "2025-10-29T20:36:43.000Z",
    "source": "Dark Reading",
    "summary": "New research shows AI crawlers like Perplexity, Atlas, and ChatGPT are surprisingly easy to fool...."
  },
  {
    "title": "Dentsu Subsidiary Breached, Employee Data Stolen",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/dentsu-subsidiary-breached-employee-data-stolen",
    "date": "2025-10-29T20:14:24.000Z",
    "source": "Dark Reading",
    "summary": "A subsidiary of Japanese marketing and PR giant Dentsu lost sensitive data to unidentified threat actors, the parent company said...."
  },
  {
    "title": "Canada says hacktivists breached water and energy facilities",
    "link": "https://www.bleepingcomputer.com/news/security/canada-says-hacktivists-breached-water-and-energy-facilities/",
    "date": "2025-10-29T19:03:06.000Z",
    "source": "Bleeping Computer",
    "summary": "The Canadian Centre for Cyber Security warned today that hacktivists have breached critical infrastructure systems multiple times across the country, allowing them to modify industrial controls that c..."
  },
  {
    "title": "Microsoft Security Change for Azure VMs Creates Pitfalls",
    "link": "https://www.darkreading.com/cloud-security/microsoft-security-change-azure-vms-creates-pitfalls",
    "date": "2025-10-29T17:49:44.000Z",
    "source": "Dark Reading",
    "summary": "Firms using Azure infrastructure gained a reprieve from a security-focused switch that could have broken apps that relied on public Internet access...."
  },
  {
    "title": "Botnets Step Up Cloud Attacks Via Flaws, Misconfigurations",
    "link": "https://www.darkreading.com/cloud-security/botnets-cloud-attacks-flaws-misconfigurations",
    "date": "2025-10-29T16:04:10.000Z",
    "source": "Dark Reading",
    "summary": "Infamous botnets like Mirai are exploiting Web-exposed assets such as PHP servers, IoT devices, and cloud gateways to gain control over systems and build strength...."
  },
  {
    "title": "Experts Reports Sharp Increase in Automated Botnet Attacks Targeting PHP Servers and IoT Devices",
    "link": "https://thehackernews.com/2025/10/experts-reports-sharp-increase-in.html",
    "date": "2025-10-29T15:38:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers are calling attention to a spike in automated attacks targeting PHP servers, IoT devices, and cloud gateways by various botnets such as Mirai, Gafgyt, and Mozi.\n\"These automa..."
  },
  {
    "title": "New AI-Targeted Cloaking Attack Tricks AI Crawlers Into Citing Fake Info as Verified Facts",
    "link": "https://thehackernews.com/2025/10/new-ai-targeted-cloaking-attack-tricks.html",
    "date": "2025-10-29T14:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have flagged a new security issue in agentic web browsers like OpenAI ChatGPT Atlas that exposes underlying artificial intelligence (AI) models to context poisoning attacks.\n..."
  },
  {
    "title": "From Power Users to Protective Stewards: How to Tune Security Training for Specialized Employees",
    "link": "https://www.darkreading.com/cybersecurity-operations/power-users-protective-stewards-how-tune-security-training-specialized-employees",
    "date": "2025-10-29T12:03:17.000Z",
    "source": "Dark Reading",
    "summary": "The best security training programs build strong security culture by focusing on high-risk groups, including developers, executives, and finance pros...."
  }
]