[
  {
    "title": "New tool blocks imposter attacks disguised as safe commands",
    "link": "https://www.bleepingcomputer.com/news/security/new-tool-blocks-imposter-attacks-disguised-as-safe-commands/",
    "date": "2026-02-08T15:26:48.000Z",
    "source": "Bleeping Computer",
    "summary": "A new open-source and cross-platform tool called Tirith can detect homoglyph attacks over command-line environments by analyzing URLs in typed commands and stopping their execution.  [...]..."
  },
  {
    "title": "OpenClaw Integrates VirusTotal Scanning to Detect Malicious ClawHub Skills",
    "link": "https://thehackernews.com/2026/02/openclaw-integrates-virustotal-scanning.html",
    "date": "2026-02-08T07:32:00.000Z",
    "source": "The Hacker News",
    "summary": "OpenClaw (formerly Moltbot and Clawdbot) has announced that it's partnering with Google-owned VirusTotal to scan skills that are being uploaded to ClawHub, its skill marketplace, as part of broader ef..."
  },
  {
    "title": "State actor targets 155 countries in 'Shadow Campaigns' espionage op",
    "link": "https://www.bleepingcomputer.com/news/security/state-actor-targets-155-countries-in-shadow-campaigns-espionage-op/",
    "date": "2026-02-07T15:09:46.000Z",
    "source": "Bleeping Computer",
    "summary": "A new state-aligned cyberespionage threat group tracked as TGR-STA-1030/UNC6619, has conducted a global-scale operation dubbed the \"Shadow Campaigns,\" where it targeted government infrastructure in 15..."
  },
  {
    "title": "German Agencies Warn of Signal Phishing Targeting Politicians, Military, Journalists",
    "link": "https://thehackernews.com/2026/02/german-agencies-warn-of-signal-phishing.html",
    "date": "2026-02-07T11:15:00.000Z",
    "source": "The Hacker News",
    "summary": "Germany's Federal Office for the Protection of the Constitution (aka Bundesamt für Verfassungsschutz or BfV) and Federal Office for Information Security (BSI) have issued a joint advisory warning of a..."
  },
  {
    "title": "Payments platform BridgePay confirms ransomware attack behind outage",
    "link": "https://www.bleepingcomputer.com/news/security/payments-platform-bridgepay-confirms-ransomware-attack-behind-outage/",
    "date": "2026-02-07T09:47:10.000Z",
    "source": "Bleeping Computer",
    "summary": "A major U.S. payment gateway and solutions provider says a ransomware attack has knocked key systems offline, triggering a widespread outage affecting multiple services. The incident began on Friday a..."
  },
  {
    "title": "Germany warns of Signal account hijacking targeting senior figures",
    "link": "https://www.bleepingcomputer.com/news/security/germany-warns-of-signal-account-hijacking-targeting-senior-figures/",
    "date": "2026-02-06T20:00:33.000Z",
    "source": "Bleeping Computer",
    "summary": "Germany's domestic intelligence agency is warning of suspected state-sponsored threat actors targeting high-ranking individuals in phishing attacks via messaging apps like Signal. [...]..."
  },
  {
    "title": "DKnife Linux toolkit hijacks router traffic to spy, deliver malware",
    "link": "https://www.bleepingcomputer.com/news/security/dknife-linux-toolkit-hijacks-router-traffic-to-spy-deliver-malware/",
    "date": "2026-02-06T18:35:11.000Z",
    "source": "Bleeping Computer",
    "summary": "A newly discovered toolkit called DKnife has been used since 2019 to hijack traffic at the edge-device level and deliver malware in espionage campaigns. [...]..."
  },
  {
    "title": "CISA warns of SmarterMail RCE flaw used in ransomware attacks",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-of-smartermail-rce-flaw-used-in-ransomware-attacks/",
    "date": "2026-02-06T17:16:03.000Z",
    "source": "Bleeping Computer",
    "summary": "The Cybersecurity & Infrastructure Security Agency (CISA) in the U.S. has issued a warning about CVE-2026-24423, an unauthenticated remote code execution (RCE) flaw in SmarterMail that is used in rans..."
  },
  {
    "title": "'Encrypt It Already' Campaign Pushes Big Tech to Prioritize E2E Encryption",
    "link": "https://www.darkreading.com/cloud-security/encrypt-it-already-pushes-big-tech-e2e-encryption",
    "date": "2026-02-06T16:34:41.000Z",
    "source": "Dark Reading",
    "summary": "The Electronic Frontier Foundation is urging major technology companies to follow through on their promises to implement end-to-end encryption (E2E) by default across their services, as privacy concer..."
  },
  {
    "title": "Shai-hulud: The Hidden Cost of Supply Chain Attacks",
    "link": "https://www.darkreading.com/application-security/shai-hulud-hidden-cost-supply-chain-attacks",
    "date": "2026-02-06T16:25:14.000Z",
    "source": "Dark Reading",
    "summary": "Recent supply chain attacks involving self-propagating worms have spread far, but the damage and long-term impact is hard to quantify...."
  },
  {
    "title": "OpenClaw's Gregarious Insecurities Make Safe Usage Difficult",
    "link": "https://www.darkreading.com/application-security/openclaw-insecurities-safe-usage-difficult",
    "date": "2026-02-06T15:42:15.000Z",
    "source": "Dark Reading",
    "summary": "Malicious \"skills\" and persnickety configuration settings are just some of the issues that security researchers have found when installing — and removing — the OpenClaw AI assistant...."
  },
  {
    "title": "EDR, Email, and SASE Miss This Entire Class of Browser Attacks",
    "link": "https://www.bleepingcomputer.com/news/security/edr-email-and-sase-miss-this-entire-class-of-browser-attacks/",
    "date": "2026-02-06T15:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Many modern attacks happen entirely inside the browser, leaving little evidence for traditional security tools. Keep Aware shows why EDR, email, and SASE miss browser-only attacks and how visibility c..."
  },
  {
    "title": "China-Linked DKnife AitM Framework Targets Routers for Traffic Hijacking, Malware Delivery",
    "link": "https://thehackernews.com/2026/02/china-linked-dknife-aitm-framework.html",
    "date": "2026-02-06T14:56:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have taken the wraps off a gateway-monitoring and adversary-in-the-middle (AitM) framework dubbed DKnife that's operated by China-nexus threat actors since at least 2019.\nThe..."
  },
  {
    "title": "EU says TikTok faces large fine over \"addictive design\"",
    "link": "https://www.bleepingcomputer.com/news/security/european-commission-says-tiktok-facing-fine-over-addictive-design/",
    "date": "2026-02-06T13:53:53.000Z",
    "source": "Bleeping Computer",
    "summary": "The European Commission said today that TikTok is facing a fine because its addictive features, including infinite scroll, autoplay, push notifications, and personalized recommendation systems, are br..."
  },
  {
    "title": "CISA Orders Removal of Unsupported Edge Devices to Reduce Federal Network Risk",
    "link": "https://thehackernews.com/2026/02/cisa-orders-removal-of-unsupported-edge.html",
    "date": "2026-02-06T13:43:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has ordered Federal Civilian Executive Branch (FCEB) agencies to strengthen asset lifecycle management for edge network devices and rem..."
  },
  {
    "title": "Man pleads guilty to hacking nearly 600 women’s Snapchat accounts",
    "link": "https://www.bleepingcomputer.com/news/security/man-pleads-guilty-to-hacking-nearly-600-womens-snapchat-accounts/",
    "date": "2026-02-06T12:34:30.000Z",
    "source": "Bleeping Computer",
    "summary": "An Illinois man pleaded guilty to hacking nearly 600 women's Snapchat accounts to steal nude photos that he kept, sold, or traded online, including accounts he compromised at the request of a former u..."
  },
  {
    "title": "Asian State-Backed Group TGR-STA-1030 Breaches 70 Government, Infrastructure Entities",
    "link": "https://thehackernews.com/2026/02/asian-state-backed-group-tgr-sta-1030.html",
    "date": "2026-02-06T12:07:00.000Z",
    "source": "The Hacker News",
    "summary": "A previously undocumented cyber espionage group operating from Asia broke into the networks of at least 70 government and critical infrastructure organizations across 37 countries over the past year, ..."
  },
  {
    "title": "How Samsung Knox Helps Stop Your Network Security Breach",
    "link": "https://thehackernews.com/2026/02/how-samsung-knox-helps-stop-your-network-security-breach.html",
    "date": "2026-02-06T10:30:00.000Z",
    "source": "The Hacker News",
    "summary": "As you know, enterprise network security has undergone significant evolution over the past decade. Firewalls have become more intelligent, threat detection methods have advanced, and access controls a..."
  },
  {
    "title": "Flickr discloses potential data breach exposing users' names, emails",
    "link": "https://www.bleepingcomputer.com/news/security/flickr-discloses-potential-data-breach-exposing-users-names-emails/",
    "date": "2026-02-06T09:43:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Photo-sharing platform Flickr is notifying users of a potential data breach after a vulnerability at a third-party email service provider exposed their real names, email addresses, IP addresses, and a..."
  },
  {
    "title": "CISA orders federal agencies to replace end-of-life edge devices",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-federal-agencies-to-replace-end-of-life-edge-devices/",
    "date": "2026-02-06T08:41:11.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has issued a new binding operational directive requiring federal agencies to identify and remove network edge devices that no longer re..."
  },
  {
    "title": "Compromised dYdX npm and PyPI Packages Deliver Wallet Stealers and RAT Malware",
    "link": "https://thehackernews.com/2026/02/compromised-dydx-npm-and-pypi-packages.html",
    "date": "2026-02-06T08:40:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a new supply chain attack in which legitimate packages on npm and the Python Package Index (PyPI) repository have been compromised to push malicious versions ..."
  },
  {
    "title": "Claude Opus 4.6 Finds 500+ High-Severity Flaws Across Major Open-Source Libraries",
    "link": "https://thehackernews.com/2026/02/claude-opus-46-finds-500-high-severity.html",
    "date": "2026-02-06T05:49:00.000Z",
    "source": "The Hacker News",
    "summary": "Artificial intelligence (AI) company Anthropic revealed that its latest large language model (LLM), Claude Opus 4.6, has found more than 500 previously unknown high-severity security flaws in open-sou..."
  },
  {
    "title": "EnCase Driver Weaponized as EDR Killers Persist",
    "link": "https://www.darkreading.com/threat-intelligence/encase-driver-weaponized-edr-killers-persist",
    "date": "2026-02-05T22:35:20.000Z",
    "source": "Dark Reading",
    "summary": "The forensic tool's driver was signed with a digital certificate that expired years ago, but major security gaps allowed Windows to load it...."
  },
  {
    "title": "Agentic AI Site 'Moltbook' Is Riddled With Security Risks",
    "link": "https://www.darkreading.com/cyber-risk/agentic-ai-moltbook-security-risks",
    "date": "2026-02-05T22:03:29.000Z",
    "source": "Dark Reading",
    "summary": "Someone used AI to build an entire Web platform, which then did something predictable and preventable: It exposed all its data through a publicly accessible API...."
  },
  {
    "title": "Spain's Ministry of Science shuts down systems after breach claims",
    "link": "https://www.bleepingcomputer.com/news/security/spains-ministry-of-science-shuts-down-systems-after-breach-claims/",
    "date": "2026-02-05T21:23:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Spain's Ministry of Science (Ministerio de Ciencia) announced a partial shutdown of its IT systems, affecting several citizen- and company-facing services. [...]..."
  },
  {
    "title": "Ransomware gang uses ISPsystem VMs for stealthy payload delivery",
    "link": "https://www.bleepingcomputer.com/news/security/ransomware-gang-uses-ispsystem-vms-for-stealthy-payload-delivery/",
    "date": "2026-02-05T20:57:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Ransomware operators are hosting and delivering malicious payloads at scale by abusing virtual machines (VMs) provisioned by ISPsystem, a legitimate virtual infrastructure management provider. [...]..."
  },
  {
    "title": "Data Tool to Triage Exploited Vulnerabilities Can Make KEV More Useful",
    "link": "https://www.darkreading.com/threat-intelligence/data-tool-triage-exploited-vulnerabilities-make-kev-catalog-more-useful",
    "date": "2026-02-05T20:53:34.000Z",
    "source": "Dark Reading",
    "summary": "A disconnect exists between an organization's cybersecurity needs and lists like CISA's KEV Catalog. KEV Collider combines data from multiple open source vulnerability frameworks to help security team..."
  },
  {
    "title": "Microsoft to shut down Exchange Online EWS in April 2027",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-shut-down-exchange-web-services-in-cloud-in-2027/",
    "date": "2026-02-05T18:07:41.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced today that the Exchange Web Services (EWS) API for Exchange Online will be shut down in April 2027, after nearly 20 years. [...]..."
  },
  {
    "title": "AISURU/Kimwolf Botnet Launches Record-Setting 31.4 Tbps DDoS Attack",
    "link": "https://thehackernews.com/2026/02/aisurukimwolf-botnet-launches-record.html",
    "date": "2026-02-05T17:25:00.000Z",
    "source": "The Hacker News",
    "summary": "The distributed denial-of-service (DDoS) botnet known as AISURU/Kimwolf has been attributed to a record-setting attack that peaked at 31.4 Terabits per second (Tbps) and lasted only 35 seconds.\nCloudf..."
  },
  {
    "title": "Italian university La Sapienza goes offline after cyberattack",
    "link": "https://www.bleepingcomputer.com/news/security/italian-university-la-sapienza-goes-offline-after-cyberattack/",
    "date": "2026-02-05T17:02:45.000Z",
    "source": "Bleeping Computer",
    "summary": "Rome's \"La Sapienza\" university has been targeted by a cyberattack that impacted its IT systems and caused widespread operational disruptions at the educational institute. [...]..."
  }
]