[
  {
    "title": "[Dark Reading Virtual Event] Cybersecurity Outlook 2026",
    "link": "https://www.darkreading.com/events/dark-reading-virtual-event-cybersecurity-outlook-2026",
    "date": "2025-11-21T18:10:02.980Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Explore Our Online Events",
    "link": "https://www.darkreading.com/events/dark-reading-online-events",
    "date": "2025-11-21T18:10:02.980Z",
    "source": "Dark Reading",
    "summary": ""
  },
  {
    "title": "Microsoft: Out-of-band update fixes Windows 11 hotpatch install loop",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-out-of-band-update-fixes-windows-11-hotpatch-install-loop/",
    "date": "2025-11-21T18:02:05.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft has released an out-of-band cumulative update to fix a known issue causing the November 2025 KB5068966 hotpatch update to reinstall on Windows 11 systems repeatedly. [...]..."
  },
  {
    "title": "Grafana warns of max severity admin spoofing vulnerability",
    "link": "https://www.bleepingcomputer.com/news/security/grafana-warns-of-max-severity-admin-spoofing-vulnerability/",
    "date": "2025-11-21T17:58:32.000Z",
    "source": "Bleeping Computer",
    "summary": "Grafana Labs is warning of a maximum severity vulnerability (CVE-2025-41115) in its Enterprise product that can be exploited to treat new users as administrators or for privilege escalation. [...]..."
  },
  {
    "title": "CrowdStrike catches insider feeding information to hackers",
    "link": "https://www.bleepingcomputer.com/news/security/crowdstrike-catches-insider-feeding-information-to-hackers/",
    "date": "2025-11-21T16:48:41.000Z",
    "source": "Bleeping Computer",
    "summary": "American cybersecurity firm CrowdStrike has confirmed that an insider shared screenshots taken on internal systems with hackers after they were leaked on Telegram by the Scattered Lapsus$ Hunters thre..."
  },
  {
    "title": "FCC rolls back cybersecurity rules for telcos, despite state-hacking risks",
    "link": "https://www.bleepingcomputer.com/news/security/fcc-rolls-back-cybersecurity-rules-for-telcos-despite-state-hacking-risks/",
    "date": "2025-11-21T16:01:41.000Z",
    "source": "Bleeping Computer",
    "summary": "The Federal Communications Commission (FCC) has rolled back a previous ruling that required U.S. telecom carriers to implement stricter cybersecurity measures following the massive hack from the Chine..."
  },
  {
    "title": "'Scattered Spider' teens plead not guilty to UK transport hack",
    "link": "https://www.bleepingcomputer.com/news/security/scattered-spider-teens-plead-not-guilty-to-uk-transport-hack/",
    "date": "2025-11-21T15:41:24.000Z",
    "source": "Bleeping Computer",
    "summary": "Two British teenagers have denied charges related to an investigation into the breach of Transport for London (TfL) in August 2024, which caused millions of pounds in damage and exposed customer data...."
  },
  {
    "title": "Grafana Patches CVSS 10.0 SCIM Flaw Enabling Impersonation and Privilege Escalation",
    "link": "https://thehackernews.com/2025/11/grafana-patches-cvss-100-scim-flaw.html",
    "date": "2025-11-21T15:40:00.000Z",
    "source": "The Hacker News",
    "summary": "Grafana has released security updates to address a maximum severity security flaw that could allow privilege escalation or user impersonation under certain configurations.\nThe vulnerability, tracked a..."
  },
  {
    "title": "With AI Reshaping Entry-Level Cyber, What Happens to the Security Talent Pipeline?",
    "link": "https://www.darkreading.com/cybersecurity-careers/with-ai-reshaping-entry-level-cyber-what-happens-to-the-security-talent-pipeline-",
    "date": "2025-11-21T15:02:45.000Z",
    "source": "Dark Reading",
    "summary": "Automation is rewriting early-career cybersecurity work, raising urgent questions about how the next generation of security professionals will gain real-world expertise...."
  },
  {
    "title": "Avast Makes AI-Driven Scam Defense Available for Free Worldwide",
    "link": "https://www.bleepingcomputer.com/news/security/avast-makes-ai-driven-scam-defense-available-for-free-worldwide/",
    "date": "2025-11-21T15:00:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Avast is rolling out Scam Guardian, a free AI-powered protection layer that analyzes websites, messages, and links to detect rising scam threats. Powered by Gen Threat Labs data, it reveals hidden dan..."
  },
  {
    "title": "Switching to Offense: US Makes Cyber Strategy Changes",
    "link": "https://www.darkreading.com/cyber-risk/us-makes-cyber-strategy-changes",
    "date": "2025-11-21T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The US national cyber director describes the next cyber strategy as focusing \"on shaping adversary behavior,\" adding consequences and aggressive response...."
  },
  {
    "title": "Google begins showing ads in AI Mode (AI answers)",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-begins-showing-ads-in-ai-mode-ai-answers/",
    "date": "2025-11-21T13:02:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has started rolling out ads in AI mode, which is the company's \"answer engine,\" not a search engine. [...]..."
  },
  {
    "title": "Google Brings AirDrop Compatibility to Android’s Quick Share Using Rust-Hardened Security",
    "link": "https://thehackernews.com/2025/11/google-adds-airdrop-compatibility-to.html",
    "date": "2025-11-21T13:00:00.000Z",
    "source": "The Hacker News",
    "summary": "In a surprise move, Google on Thursday announced that it has updated Quick Share, its peer-to-peer file transfer service, to work with Apple's equipment AirDrop, allowing users to more easily share fi..."
  },
  {
    "title": "Why IT Admins Choose Samsung for Mobile Security",
    "link": "https://thehackernews.com/2025/11/why-it-admins-choose-samsung-for-mobile.html",
    "date": "2025-11-21T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Ever wonder how some IT teams keep corporate data safe without slowing down employees? Of course you have.\nMobile devices are essential for modern work—but with mobility comes risk. IT admins, like yo..."
  },
  {
    "title": "APT24 Deploys BADAUDIO in Years-Long Espionage Hitting Taiwan and 1,000+ Domains",
    "link": "https://thehackernews.com/2025/11/apt24-deploys-badaudio-in-years-long.html",
    "date": "2025-11-21T10:42:00.000Z",
    "source": "The Hacker News",
    "summary": "A China-nexus threat actor known as APT24 has been observed using a previously undocumented malware dubbed BADAUDIO to establish persistent remote access to compromised networks as part of a nearly th..."
  },
  {
    "title": "SEC Drops SolarWinds Case After Years of High-Stakes Cybersecurity Scrutiny",
    "link": "https://thehackernews.com/2025/11/sec-drops-solarwinds-case-after-years.html",
    "date": "2025-11-21T08:05:00.000Z",
    "source": "The Hacker News",
    "summary": "The U.S. Securities and Exchange Commission (SEC) has abandoned its lawsuit against SolarWinds and its chief information security officer, alleging that the company had misled investors about the secu..."
  },
  {
    "title": "Salesforce Flags Unauthorized Data Access via Gainsight-Linked OAuth Activity",
    "link": "https://thehackernews.com/2025/11/salesforce-flags-unauthorized-data.html",
    "date": "2025-11-21T05:32:00.000Z",
    "source": "The Hacker News",
    "summary": "Salesforce has warned of detected \"unusual activity\" related to Gainsight-published applications connected to the platform.\n\"Our investigation indicates this activity may have enabled unauthorized acc..."
  },
  {
    "title": "Inside Iran's Cyber Objectives: What Do They Want?",
    "link": "https://www.darkreading.com/cybersecurity-operations/iran-cyber-objectives",
    "date": "2025-11-21T05:02:00.000Z",
    "source": "Dark Reading",
    "summary": "The regime's cyber-espionage strategy employs dual-use targeting, collecting info that can support both military needs and broader political objectives...."
  },
  {
    "title": "Securing the Win: What Cybersecurity Can Learn From the Paddock",
    "link": "https://www.darkreading.com/cybersecurity-operations/securing-win-what-cybersecurity-learn-from-paddock",
    "date": "2025-11-20T23:23:05.000Z",
    "source": "Dark Reading",
    "summary": "A Formula 1 pit crew demonstrates the basic principles of how modern security teams should work...."
  },
  {
    "title": "Google exposes BadAudio malware used in APT24 espionage campaigns",
    "link": "https://www.bleepingcomputer.com/news/security/google-exposes-badaudio-malware-used-in-apt24-espionage-campaigns/",
    "date": "2025-11-20T22:12:32.000Z",
    "source": "Bleeping Computer",
    "summary": "China-linked APT24 hackers have been using a previously undocumented malware called BadAudio in a three-year espionage campaign that recently switched to more sophisticated attack methods. [...]..."
  },
  {
    "title": "China's 'PlushDaemon' Hackers Infect Routers to Hijack Software Updates",
    "link": "https://www.darkreading.com/endpoint-security/chinese-apt-routers-hijack-software-updates",
    "date": "2025-11-20T21:20:32.000Z",
    "source": "Dark Reading",
    "summary": "A unique take on the software update gambit has allowed Beijing's state-sponsored advanced persistent threat (APT) to evade attention as it mostly targets Chinese organizations...."
  },
  {
    "title": "'Matrix Push' C2 Tool Hijacks Browser Notifications",
    "link": "https://www.darkreading.com/threat-intelligence/matrix-push-c2-tool-hijacks-browser-notifications-phishing",
    "date": "2025-11-20T20:44:34.000Z",
    "source": "Dark Reading",
    "summary": "Have you ever given two seconds of thought to a browser notification? No? That's what hackers bent on phishing are counting on...."
  },
  {
    "title": "Same Old Security Problems: Cyber Training Still Fails Miserably",
    "link": "https://www.darkreading.com/cybersecurity-operations/security-problems-cyber-training-fails-miserably",
    "date": "2025-11-20T20:18:16.000Z",
    "source": "Dark Reading",
    "summary": "Editors from Dark Reading, Cybersecurity Dive, and TechTarget Search Security break down the depressing state of cybersecurity awareness campaigns and how organizations can overcome basic struggles wi..."
  },
  {
    "title": "Mozilla Says It’s Finally Done With Two-Faced Onerep",
    "link": "https://krebsonsecurity.com/2025/11/mozilla-says-its-finally-done-with-two-faced-onerep/",
    "date": "2025-11-20T19:06:51.000Z",
    "source": "Krebs on Security",
    "summary": "In March 2024, Mozilla said it was winding down its collaboration with Onerep -- an identity protection service offered with the Firefox web browser that promises to remove users from hundreds of peop..."
  },
  {
    "title": "Hacker claims to steal 2.3TB data from Italian rail group, Almaviva",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-claims-to-steal-23tb-data-from-italian-rail-group-almaviva/",
    "date": "2025-11-20T18:54:17.000Z",
    "source": "Bleeping Computer",
    "summary": "Data from Italy's national railway operator, the FS Italiane Group, has been exposed after a threat actor breached the organization's IT services provider, Almaviva. [...]..."
  },
  {
    "title": "ShadowRay 2.0 Exploits Unpatched Ray Flaw to Build Self-Spreading GPU Cryptomining Botnet",
    "link": "https://thehackernews.com/2025/11/shadowray-20-exploits-unpatched-ray.html",
    "date": "2025-11-20T17:24:00.000Z",
    "source": "The Hacker News",
    "summary": "Oligo Security has warned of ongoing attacks exploiting a two-year-old security flaw in the Ray open-source artificial intelligence (AI) framework to turn infected clusters with NVIDIA GPUs into a sel..."
  },
  {
    "title": "GlobalProtect VPN portals probed with 2.3 million scan sessions",
    "link": "https://www.bleepingcomputer.com/news/security/globalprotect-vpn-portals-probed-with-23-million-scan-sessions/",
    "date": "2025-11-20T17:08:55.000Z",
    "source": "Bleeping Computer",
    "summary": "A major spike in malicious scanning against Palo Alto Networks GlobalProtect portals has been detected, starting on November 14, 2025. [...]..."
  },
  {
    "title": "Tsundere Botnet Expands Using Game Lures and Ethereum-Based C2 on Windows",
    "link": "https://thehackernews.com/2025/11/tsundere-botnet-expands-using-game.html",
    "date": "2025-11-20T16:57:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have warned of an actively expanding botnet dubbed Tsundere that's targeting Windows users.\nActive since mid-2025, the threat is designed to execute arbitrary JavaScript code..."
  },
  {
    "title": "Salesforce investigates customer data theft via Gainsight breach",
    "link": "https://www.bleepingcomputer.com/news/security/salesforce-investigates-customer-data-theft-via-gainsight-breach/",
    "date": "2025-11-20T16:47:20.000Z",
    "source": "Bleeping Computer",
    "summary": "Salesforce says it revoked refresh tokens linked to Gainsight-published applications while investigating a new wave of data theft attacks targeting customers. [...]..."
  },
  {
    "title": "New SonicWall SonicOS flaw allows hackers to crash firewalls",
    "link": "https://www.bleepingcomputer.com/news/security/new-sonicwall-sonicos-flaw-allows-hackers-to-crash-firewalls/",
    "date": "2025-11-20T15:56:00.000Z",
    "source": "Bleeping Computer",
    "summary": "American cybersecurity company SonicWall urged customers today to patch a high-severity SonicOS SSLVPN security flaw that can allow attackers to crash vulnerable firewalls. [...]..."
  }
]