[
  {
    "title": "Critical flaw lets hackers track, eavesdrop via Bluetooth audio devices",
    "link": "https://www.bleepingcomputer.com/news/security/critical-flaw-lets-hackers-track-eavesdrop-via-bluetooth-audio-devices/",
    "date": "2026-01-15T16:13:54.000Z",
    "source": "Bleeping Computer",
    "summary": "A critical vulnerability in Google's Fast Pair protocol can allow attackers to hijack Bluetooth audio accessories like wireless headphones and earbuds, track users, and eavesdrop on their conversation..."
  },
  {
    "title": "Critical WordPress Modular DS Plugin Flaw Actively Exploited to Gain Admin Access",
    "link": "https://thehackernews.com/2026/01/critical-wordpress-modular-ds-plugin.html",
    "date": "2026-01-15T15:31:00.000Z",
    "source": "The Hacker News",
    "summary": "A maximum-severity security flaw in a WordPress plugin called Modular DS has come under active exploitation in the wild, according to Patchstack.\nThe vulnerability, tracked as CVE-2026-23550 (CVSS sco..."
  },
  {
    "title": "Researchers Reveal Reprompt Attack Allowing Single-Click Data Exfiltration From Microsoft Copilot",
    "link": "https://thehackernews.com/2026/01/researchers-reveal-reprompt-attack.html",
    "date": "2026-01-15T15:09:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have disclosed details of a new attack method dubbed Reprompt that could allow bad actors to exfiltrate sensitive data from artificial intelligence (AI) chatbots like Microso..."
  },
  {
    "title": "How to automate just-in-time access to applications with Tines",
    "link": "https://www.bleepingcomputer.com/news/security/how-to-automate-just-in-time-access-to-applications-with-tines/",
    "date": "2026-01-15T15:01:10.000Z",
    "source": "Bleeping Computer",
    "summary": "Managing just-in-time access at scale is a growing IAM challenge as speed and auditability collide daily. Tines shows how automated workflows can grant, track, and revoke temporary app access without ..."
  },
  {
    "title": "ThreatsDay Bulletin: AI Voice Cloning Exploit, Wi-Fi Kill Switch, PLC Vulns, and 14 More Stories",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-ai-voice-cloning.html",
    "date": "2026-01-15T13:56:00.000Z",
    "source": "The Hacker News",
    "summary": "The internet never stays quiet. Every week, new hacks, scams, and security problems show up somewhere.\nThis week’s stories show how fast attackers change their tricks, how small mistakes turn into big..."
  },
  {
    "title": "Model Security Is the Wrong Frame – The Real Risk Is Workflow Security",
    "link": "https://thehackernews.com/2026/01/model-security-is-wrong-frame-real-risk.html",
    "date": "2026-01-15T11:55:00.000Z",
    "source": "The Hacker News",
    "summary": "As AI copilots and assistants become embedded in daily work, security teams are still focused on protecting the models themselves. But recent incidents suggest the bigger risk lies elsewhere: in the w..."
  },
  {
    "title": "4 Outdated Habits Destroying Your SOC's MTTR in 2026",
    "link": "https://thehackernews.com/2026/01/4-outdated-habits-destroying-your-socs.html",
    "date": "2026-01-15T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "It’s 2026, yet many SOCs are still operating the way they did years ago, using tools and processes designed for a very different threat landscape. Given the growth in volumes and complexity of cyber t..."
  },
  {
    "title": "FTC bans GM from selling drivers' location data for five years",
    "link": "https://www.bleepingcomputer.com/news/security/ftc-bans-general-motors-from-selling-drivers-location-data-for-five-years/",
    "date": "2026-01-15T09:59:30.000Z",
    "source": "Bleeping Computer",
    "summary": "The FTC has finalized an order with General Motors, settling charges that it collected and sold the location and driving data of millions of drivers without consent. [...]..."
  },
  {
    "title": "Microsoft Legal Action Disrupts RedVDS Cybercrime Infrastructure Used for Online Fraud",
    "link": "https://thehackernews.com/2026/01/microsoft-legal-action-disrupts-redvds.html",
    "date": "2026-01-15T09:37:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Wednesday announced that it has taken a \"coordinated legal action\" in the U.S. and the U.K. to disrupt a cybercrime subscription service called RedVDS that has allegedly fueled millions i..."
  },
  {
    "title": "Palo Alto Networks warns of DoS bug letting hackers disable firewalls",
    "link": "https://www.bleepingcomputer.com/news/security/palo-alto-networks-warns-of-dos-bug-letting-hackers-disable-firewalls/",
    "date": "2026-01-15T09:02:42.000Z",
    "source": "Bleeping Computer",
    "summary": "Palo Alto Networks patched a high-severity vulnerability that could allow unauthenticated attackers to disable firewall protections in denial-of-service (DoS) attacks. [...]..."
  },
  {
    "title": "Palo Alto Fixes GlobalProtect DoS Flaw That Can Crash Firewalls Without Login",
    "link": "https://thehackernews.com/2026/01/palo-alto-fixes-globalprotect-dos-flaw.html",
    "date": "2026-01-15T08:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Palo Alto Networks has released security updates for a high-severity security flaw impacting GlobalProtect Gateway and Portal, for which it said there exists a proof-of-concept (PoC) exploit.\nThe vuln..."
  },
  {
    "title": "Microsoft disrupts massive RedVDS cybercrime virtual desktop service",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-seizes-servers-disrupts-massive-redvds-cybercrime-platform/",
    "date": "2026-01-15T07:11:45.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced on Wednesday that it disrupted RedVDS, a massive cybercrime platform linked to at least $40 million in reported losses in the United States alone since March 2025. [...]..."
  },
  {
    "title": "ChatGPT's upcoming cross-platform feature is codenamed \"Agora\"",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpts-upcoming-cross-platform-feature-is-codenamed-agora/",
    "date": "2026-01-15T03:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI is internally testing a new feature called \"Agora,\" and it could be related to some sort of cross-platform feature that works in real time or some other new product. [...]..."
  },
  {
    "title": "Google plans to make Chrome for Android an agentic browser with Gemini",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/google-plans-to-make-chrome-for-android-an-agentic-browser-with-gemini/",
    "date": "2026-01-15T01:30:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google appears to be testing a new feature that integrates Gemini into Chrome for Android, allowing you to use agentic browser capabilities on your mobile device. [...]..."
  },
  {
    "title": "Google's Personal Intelligence links Gmail, Photos and Search to Gemini",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/googles-personal-intelligence-links-gmail-photos-and-search-to-gemini/",
    "date": "2026-01-15T00:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "Google is rolling out 'Personal Intelligence,' a new Gemini feature that pulls your data from Gmail, Photos, Google Search, and other products. [...]..."
  },
  {
    "title": "OpenAI's hidden ChatGPT Translate tool takes on Google Translate",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-hidden-chatgpt-translate-tool-takes-on-google-translate/",
    "date": "2026-01-14T22:52:16.000Z",
    "source": "Bleeping Computer",
    "summary": "OpenAI has quietly rolled out a new ChatGPT feature called ChatGPT Translate, and it looks very similar to Google Translate on the web. [...]..."
  },
  {
    "title": "South Korean giant Kyowon confirms data theft in ransomware attack",
    "link": "https://www.bleepingcomputer.com/news/security/south-korean-giant-kyowon-confirms-data-theft-in-ransomware-attack/",
    "date": "2026-01-14T21:49:50.000Z",
    "source": "Bleeping Computer",
    "summary": "The Kyowon Group (Kyowon), a South Korean conglomerate, disclosed that a cyberattack has disrupted its operations and customer information may have been exposed in the incident. [...]..."
  },
  {
    "title": "France fines Free Mobile €42 million over 2024 data breach incident",
    "link": "https://www.bleepingcomputer.com/news/security/france-fines-free-mobile-42-million-over-2024-data-breach-incident/",
    "date": "2026-01-14T19:50:49.000Z",
    "source": "Bleeping Computer",
    "summary": "The French data protection authority (CNIL) has imposed cumulative fines of €42 million on Free Mobile and its parent company, Free, for inadequate protection of customer data against cyber threats. [..."
  },
  {
    "title": "Researchers Null-Route Over 550 Kimwolf and Aisuru Botnet Command Servers",
    "link": "https://thehackernews.com/2026/01/kimwolf-botnet-infected-over-2-million.html",
    "date": "2026-01-14T19:03:00.000Z",
    "source": "The Hacker News",
    "summary": "The Black Lotus Labs team at Lumen Technologies said it null-routed traffic to more than 550 command-and-control (C2) nodes associated with the AISURU/Kimwolf botnet since early October 2025.\nAISURU a..."
  },
  {
    "title": "Exploit code public for critical FortiSIEM command injection flaw",
    "link": "https://www.bleepingcomputer.com/news/security/exploit-code-public-for-critical-fortisiem-command-injection-flaw/",
    "date": "2026-01-14T18:51:54.000Z",
    "source": "Bleeping Computer",
    "summary": "Technical details and a public exploit have been published for a critical vulnerability affecting Fortinet's Security Information and Event Management (SIEM) solution that could be leveraged by a remo..."
  },
  {
    "title": "Verizon Wireless outage puts phones in SOS mode without cell service",
    "link": "https://www.bleepingcomputer.com/news/mobile/verizon-wireless-outage-puts-phones-in-sos-mode-without-cell-service/",
    "date": "2026-01-14T18:27:25.000Z",
    "source": "Bleeping Computer",
    "summary": "Verizon Wireless is suffering a massive outage in the US, with customers reporting their phones stuck in SOS mode with no cellular service. [...]..."
  },
  {
    "title": "AI Agents Are Becoming Authorization Bypass Paths",
    "link": "https://thehackernews.com/2026/01/ai-agents-are-becoming-privilege.html",
    "date": "2026-01-14T15:07:00.000Z",
    "source": "The Hacker News",
    "summary": "Not long ago, AI agents were harmless. They wrote snippets of code. They answered questions. They helped individuals move a little faster.\nThen organizations got ambitious.\nInstead of personal copilot..."
  },
  {
    "title": "Hackers Exploit c-ares DLL Side-Loading to Bypass Security and Deploy Malware",
    "link": "https://thehackernews.com/2026/01/hackers-exploit-c-ares-dll-side-loading.html",
    "date": "2026-01-14T14:18:00.000Z",
    "source": "The Hacker News",
    "summary": "Security experts have disclosed details of an active malware campaign that's exploiting a DLL side-loading vulnerability in a legitimate binary associated with the open-source c-ares library to bypass..."
  },
  {
    "title": "Fortinet Fixes Critical FortiSIEM Flaw Allowing Unauthenticated Remote Code Execution",
    "link": "https://thehackernews.com/2026/01/fortinet-fixes-critical-fortisiem-flaw.html",
    "date": "2026-01-14T11:53:00.000Z",
    "source": "The Hacker News",
    "summary": "Fortinet has released updates to fix a critical security flaw impacting FortiSIEM that could allow an unauthenticated attacker to achieve code execution on susceptible instances.\nThe operating system ..."
  },
  {
    "title": "New Research: 64% of 3rd-Party Applications Access Sensitive Data Without Justification",
    "link": "https://thehackernews.com/2026/01/new-research-64-of-3rd-party.html",
    "date": "2026-01-14T11:00:00.000Z",
    "source": "The Hacker News",
    "summary": "Research analyzing 4,700 leading websites reveals that 64% of third-party applications now access sensitive data without business justification, up from 51% in 2024. \nGovernment sector malicious activ..."
  },
  {
    "title": "Microsoft Fixes 114 Windows Flaws in January 2026 Patch, One Actively Exploited",
    "link": "https://thehackernews.com/2026/01/microsoft-fixes-114-windows-flaws-in.html",
    "date": "2026-01-14T09:38:00.000Z",
    "source": "The Hacker News",
    "summary": "Microsoft on Tuesday rolled out its first security update for 2026, addressing 114 security flaws, including one vulnerability that it said has been actively exploited in the wild.\nOf the 114 flaws, e..."
  },
  {
    "title": "Critical Node.js Vulnerability Can Cause Server Crashes via async_hooks Stack Overflow",
    "link": "https://thehackernews.com/2026/01/critical-nodejs-vulnerability-can-cause.html",
    "date": "2026-01-14T07:05:00.000Z",
    "source": "The Hacker News",
    "summary": "Node.js has released updates to fix what it described as a critical security issue impacting \"virtually every production Node.js app\" that, if successfully exploited, could trigger a denial-of-service..."
  },
  {
    "title": "PLUGGYAPE Malware Uses Signal and WhatsApp to Target Ukrainian Defense Forces",
    "link": "https://thehackernews.com/2026/01/pluggyape-malware-uses-signal-and.html",
    "date": "2026-01-14T05:48:00.000Z",
    "source": "The Hacker News",
    "summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has disclosed details of new cyber attacks targeting its defense forces with malware known as PLUGGYAPE between October and December 2025.\nThe..."
  },
  {
    "title": "Patch Tuesday, January 2026 Edition",
    "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
    "date": "2026-01-14T00:47:38.000Z",
    "source": "Krebs on Security",
    "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\"..."
  },
  {
    "title": "Long-Running Web Skimming Campaign Steals Credit Cards From Online Checkout Pages",
    "link": "https://thehackernews.com/2026/01/long-running-web-skimming-campaign.html",
    "date": "2026-01-13T17:30:00.000Z",
    "source": "The Hacker News",
    "summary": "Cybersecurity researchers have discovered a major web skimming campaign that has been active since January 2022, targeting several major payment networks like American Express, Diners Club, Discover, ..."
  }
]