[
  {
    "title": "Iranian APT 'BladedFeline' Hides in Network for 8 Years",
    "link": "https://www.darkreading.com/threat-intelligence/iranian-apt-bladedfeline-hides-network-8-years",
    "date": "2025-06-05T09:00:00.000Z",
    "source": "Dark Reading",
    "summary": "ESET published research on the Iranian APT \"BladedFeline,\" which researchers believe is a subgroup of the cyber-espionage entity APT34...."
  },
  {
    "title": "Interlock ransomware claims Kettering Health breach, leaks stolen data",
    "link": "https://www.bleepingcomputer.com/news/security/interlock-ransomware-claims-kettering-health-breach-leaks-stolen-data/",
    "date": "2025-06-05T07:31:11.000Z",
    "source": "Bleeping Computer",
    "summary": "The Interlock ransomware gang has claimed a recent cyberattack on the Kettering Health healthcare network and leaked data allegedly stolen from breached systems. [...]..."
  },
  {
    "title": "US offers $10M for tips on state hackers tied to RedLine malware",
    "link": "https://www.bleepingcomputer.com/news/security/us-offers-10m-for-tips-on-state-hackers-tied-to-redline-malware/",
    "date": "2025-06-05T06:25:21.000Z",
    "source": "Bleeping Computer",
    "summary": "The U.S. Department of State has announced a reward of up to $10 million for any information on government-sponsored hackers with ties to the RedLine infostealer malware operation and its suspected cr..."
  },
  {
    "title": "Cybersecurity Training in Africa Aims to Bolster Professionals' Ranks",
    "link": "https://www.darkreading.com/cybersecurity-operations/cybersecurity-training-africa-professionals-ranks",
    "date": "2025-06-05T06:00:00.000Z",
    "source": "Dark Reading",
    "summary": "The United Nations, Carnegie Mellon University, and private organizations are all aiming to train the next generation of cybersecurity experts, boost economies, and disrupt pipelines to armed groups...."
  },
  {
    "title": "Critical Cisco ISE Auth Bypass Flaw Impacts Cloud Deployments on AWS, Azure, and OCI",
    "link": "https://thehackernews.com/2025/06/critical-cisco-ise-auth-bypass-flaw.html",
    "date": "2025-06-05T05:37:00.000Z",
    "source": "The Hacker News",
    "summary": "Cisco has released security patches to address a critical security flaw impacting the Identity Services Engine (ISE) that, if successfully exploited, could allow unauthenticated actors to carry out ma..."
  },
  {
    "title": "35K Solar Devices Vulnerable to Potential Hijacking",
    "link": "https://www.darkreading.com/vulnerabilities-threats/35k-solar-devices-internet-exposure-hijacking",
    "date": "2025-06-04T21:53:20.000Z",
    "source": "Dark Reading",
    "summary": "A little more than three-quarters of these exposed devices are located in Europe, followed by Asia, with 17%...."
  },
  {
    "title": "Microsoft unveils free EU cybersecurity program for governments",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-unveils-free-eu-cybersecurity-program-for-governments/",
    "date": "2025-06-04T20:36:27.000Z",
    "source": "Bleeping Computer",
    "summary": "Microsoft announced in Berlin today a new European Security Program that promises to bolster cybersecurity for European governments. [...]..."
  },
  {
    "title": "Vishing Crew Targets Salesforce Data",
    "link": "https://www.darkreading.com/application-security/vishing-crew-salesforce-data",
    "date": "2025-06-04T20:18:05.000Z",
    "source": "Dark Reading",
    "summary": "A group Google is tracking as UNC6040 has been tricking users into installing a malicious version of a Salesforce app to gain access to and steal data from the platform...."
  },
  {
    "title": "FBI: Play ransomware breached 900 victims, including critical orgs",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-play-ransomware-breached-900-victims-including-critical-orgs/",
    "date": "2025-06-04T20:06:14.000Z",
    "source": "Bleeping Computer",
    "summary": "In an update to a joint advisory with CISA and the Australian Cyber Security Centre, the FBI said that the Play ransomware gang had breached roughly 900 organizations as of May 2025, three times the n..."
  },
  {
    "title": "Hacker arrested for breaching 5,000 hosting accounts to mine crypto",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-arrested-for-breaching-5-000-hosting-accounts-to-mine-crypto/",
    "date": "2025-06-04T19:38:13.000Z",
    "source": "Bleeping Computer",
    "summary": "The Ukrainian police arrested a 35-year-old hacker who breached 5,000 accounts at an international hosting company and used them to mine cryptocurrency, resulting in $4.5 million in damages. [...]..."
  },
  {
    "title": "Cisco warns of ISE and CCP flaws with public exploit code",
    "link": "https://www.bleepingcomputer.com/news/security/cisco-warns-of-ise-and-ccp-flaws-with-public-exploit-code/",
    "date": "2025-06-04T19:19:16.000Z",
    "source": "Bleeping Computer",
    "summary": "Cisco has released patches to address three vulnerabilities with public exploit code in its Identity Services Engine (ISE) and Customer Collaboration Platform (CCP) solutions. [...]..."
  },
  {
    "title": "Ukraine claims it hacked Tupolev, Russia’s strategic warplane maker",
    "link": "https://www.bleepingcomputer.com/news/security/ukraine-claims-it-hacked-tupolev-russias-strategic-warplane-maker/",
    "date": "2025-06-04T18:00:29.000Z",
    "source": "Bleeping Computer",
    "summary": "The Main Intelligence Directorate (GUR) of Ukraine's Ministry of Defense claims it hacked the Russian aerospace and defense company Tupolev, which develops Russia's supersonic strategic bombers. [...]..."
  },
  {
    "title": "How Neuroscience Can Help Us Battle 'Alert Fatigue'",
    "link": "https://www.darkreading.com/vulnerabilities-threats/how-neuroscience-battle-alert-fatigue",
    "date": "2025-06-04T18:00:00.000Z",
    "source": "Dark Reading",
    "summary": "By understanding the neurological realities of human attention, organizations can build more sustainable security operations that protect not only their digital assets but also the well-being of those..."
  },
  {
    "title": "Researchers Bypass Deepfake Detection With Replay Attacks",
    "link": "https://www.darkreading.com/cybersecurity-analytics/researchers-bypass-deepfake-detection-replay-attacks",
    "date": "2025-06-04T17:30:13.000Z",
    "source": "Dark Reading",
    "summary": "An international group of researchers found that simply rerecording deepfake audio with natural acoustics in the background allows it to bypass detection models at a higher-than-expected rate...."
  },
  {
    "title": "BidenCash carding market domains seized in international operation",
    "link": "https://www.bleepingcomputer.com/news/security/bidencash-carding-market-domains-seized-in-international-operation/",
    "date": "2025-06-04T17:10:50.000Z",
    "source": "Bleeping Computer",
    "summary": "Earlier today, law enforcement seized multiple domains of BidenCash, the infamous dark web market for stolen credit cards, personal information, and SSH access. [...]..."
  },
  {
    "title": "Your Asus router may be part of a botnet - here's how to tell and what to do",
    "link": "https://www.zdnet.com/article/your-asus-router-may-be-part-of-a-botnet-heres-how-to-tell-and-what-to-do/",
    "date": "2025-06-04T16:44:00.000Z",
    "source": "ZDNet Security",
    "summary": "Cybercriminals have hacked into thousands of Asus routers, possibly as a prelude to a botnet attack, says a security firm...."
  },
  {
    "title": "FBI warns of NFT airdrop scams targeting Hedera Hashgraph wallets",
    "link": "https://www.bleepingcomputer.com/news/security/fbi-warns-of-nft-airdrop-scams-targeting-hedera-hashgraph-wallets/",
    "date": "2025-06-04T16:37:33.000Z",
    "source": "Bleeping Computer",
    "summary": "The FBI is warning about a new scam where cybercriminals exploit NFT airdrops on the Hedera Hashgraph network to steal crypto from cryptocurrency wallets. [...]..."
  },
  {
    "title": "Qualcomm patches three exploited security flaws, but you could still be vulnerable",
    "link": "https://www.zdnet.com/article/qualcomm-patches-three-exploited-security-flaws-but-you-could-still-be-vulnerable/",
    "date": "2025-06-04T16:24:35.000Z",
    "source": "ZDNet Security",
    "summary": "Device manufacturers must still apply the critical updates to their individual products, but we're not out of the woods yet...."
  },
  {
    "title": "The default TV setting you should turn off ASAP - and why professionals do the same",
    "link": "https://www.zdnet.com/article/the-default-tv-setting-you-should-turn-off-asap-and-why-professionals-do-the-same/",
    "date": "2025-06-04T15:31:00.000Z",
    "source": "ZDNet Security",
    "summary": "Often regarded as the 'soap opera effect,' motion smoothing can enhance your gaming, but tends to be distracting for everything else. Here's how to turn it off...."
  },
  {
    "title": "Google Exposes Vishing Group UNC6040 Targeting Salesforce with Fake Data Loader App",
    "link": "https://thehackernews.com/2025/06/google-exposes-vishing-group-unc6040.html",
    "date": "2025-06-04T15:24:00.000Z",
    "source": "The Hacker News",
    "summary": "Google has disclosed details of a financially motivated threat cluster that it said \"specializes\" in voice phishing (aka vishing) campaigns designed to breach organizations' Salesforce instances for l..."
  },
  {
    "title": "Attackers Impersonate Ruby Packages to Steal Sensitive Telegram Data",
    "link": "https://www.darkreading.com/cyberattacks-data-breaches/attackers-impersonate-ruby-packages-telegram-data",
    "date": "2025-06-04T15:02:57.000Z",
    "source": "Dark Reading",
    "summary": "Malicious RubyGems pose as a legitimate plug-in for the popular Fastlane rapid development platform in a geopolitically motivated attack with global supply chain reach...."
  },
  {
    "title": "Media giant Lee Enterprises says data breach affects 39,000 people",
    "link": "https://www.bleepingcomputer.com/news/security/media-giant-lee-enterprises-says-data-breach-affects-39-000-people/",
    "date": "2025-06-04T14:30:14.000Z",
    "source": "Bleeping Computer",
    "summary": "Publishing giant Lee Enterprises is notifying nearly 40,000 people whose personal information was stolen in a February 2025 ransomware attack. [...]..."
  },
  {
    "title": "Google: Hackers target Salesforce accounts in data extortion attacks",
    "link": "https://www.bleepingcomputer.com/news/security/google-hackers-target-salesforce-accounts-in-data-extortion-attacks/",
    "date": "2025-06-04T14:11:12.000Z",
    "source": "Bleeping Computer",
    "summary": "Google has observed hackers claiming to be the ShinyHunters extortion group conducting social engineering attacks against multi-national companies to steal data from organizations' Salesforce platform..."
  },
  {
    "title": "Kerberos AS-REP roasting attacks: What you need to know",
    "link": "https://www.bleepingcomputer.com/news/security/kerberos-as-rep-roasting-attacks-what-you-need-to-know/",
    "date": "2025-06-04T14:01:11.000Z",
    "source": "Bleeping Computer",
    "summary": "Think your passwords are strong enough? AS-REP Roasting is back in the spotlight — and it's targeting weak spots in Active Directory. Learn more from Specops Software how attackers exploit missing Ker..."
  },
  {
    "title": "Beware of Device Code Phishing",
    "link": "https://www.darkreading.com/vulnerabilities-threats/beware-device-code-phishing",
    "date": "2025-06-04T14:00:00.000Z",
    "source": "Dark Reading",
    "summary": "Hackers are exploiting trusted authentication flows — like Microsoft Teams and IoT logins — to trick users into handing over access tokens, bypassing MFA and slipping undetected into corporate network..."
  },
  {
    "title": "Chaos RAT Malware Targets Windows and Linux via Fake Network Tool Downloads",
    "link": "https://thehackernews.com/2025/06/chaos-rat-malware-targets-windows-and.html",
    "date": "2025-06-04T12:55:00.000Z",
    "source": "The Hacker News",
    "summary": "Threat hunters are calling attention to a new variant of a remote access trojan (RAT) called Chaos RAT that has been used in recent attacks targeting Windows and Linux systems.\nAccording to findings f..."
  },
  {
    "title": "Your SaaS Data Isn't Safe: Why Traditional DLP Solutions Fail in the Browser Era",
    "link": "https://thehackernews.com/2025/06/your-saas-data-isnt-safe-why.html",
    "date": "2025-06-04T12:13:00.000Z",
    "source": "The Hacker News",
    "summary": "Traditional data leakage prevention (DLP) tools aren't keeping pace with the realities of how modern businesses use SaaS applications.\nCompanies today rely heavily on SaaS platforms like Google Worksp..."
  },
  {
    "title": "Malicious PyPI, npm, and Ruby Packages Exposed in Ongoing Open-Source Supply Chain Attacks",
    "link": "https://thehackernews.com/2025/06/malicious-pypi-npm-and-ruby-packages.html",
    "date": "2025-06-04T10:11:00.000Z",
    "source": "The Hacker News",
    "summary": "Several malicious packages have been uncovered across the npm, Python, and Ruby package repositories that drain funds from cryptocurrency wallets, erase entire codebases after installation, and exfilt..."
  },
  {
    "title": "Hacker targets other hackers and gamers with backdoored GitHub code",
    "link": "https://www.bleepingcomputer.com/news/security/hacker-targets-other-hackers-and-gamers-with-backdoored-github-code/",
    "date": "2025-06-04T10:00:00.000Z",
    "source": "Bleeping Computer",
    "summary": "A hacker targets other hackers, gamers, and researchers with exploits, bots, and game cheats in source code hosted on GitHub that contain hidden backdoors to give the threat actor remote access to inf..."
  },
  {
    "title": "HPE Issues Security Patch for StoreOnce Bug Allowing Remote Authentication Bypass",
    "link": "https://thehackernews.com/2025/06/hpe-issues-security-patch-for-storeonce.html",
    "date": "2025-06-04T05:23:00.000Z",
    "source": "The Hacker News",
    "summary": "Hewlett Packard Enterprise (HPE) has released security updates to address as many as eight vulnerabilities in its StoreOnce data backup and deduplication solution that could result in an authenticatio..."
  }
]